{'kind': 'books#volumes', 'totalItems': 418, 'items': [{'kind': 'books#volume', 'id': 'Nh0tswEACAAJ', 'etag': '0U0vUfe9pFE', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/Nh0tswEACAAJ', 'volumeInfo': {'title': 'Title Adventures of Huckleberry Finn', 'authors': ['Mark Twain'], 'publishedDate': '2017-11-15', 'description': 'ADVENTURES OF HUCKLEBERRY FINNAdventures of Huckleberry Finn (or, in more recent editions, The Adventures of Finn Huckleberry) is a Mark Twain novel, first published in the United Kingdom in December 1884 and in the United States in February 1885. Commonly named Great American Novels, the work is among the first in major American literature to be written throughout vernacular English, characterized by local regionalism of color. It is said in the first person by Huckleberry "Huck" Finn, a friend of Tom Sawyer the narrator of two other Twain novels (Tom Sawyer abroad and Tom Sawyer, detective). This is a direct sequel to The Adventures of Tom Sawyer.The book is known for its colorful depiction of people and places along the Mississippi River. Located in a pre - war Southern society that had ceased to exist about 20 years before the publication of the work, Adventures of Huckleberry Finn is an often scathing satire about entrenched attitudes, especially racism.Adventures of Huckleberry Finn has always been the subject of studies by literary critics since its publication. The book was widely criticized during the release because of its heavy use of foul language. Throughout the twentieth century, and despite the arguments that the protagonist and tenor of the book are anti-racist, criticism of the book continued due to its perceived use of racial stereotypes and its frequent use of racial insult. "negro".MARK TWAIN (Samuel Langhorne Clemens)Samuel Langhorne Clemens (November 30, 1835 - April 21, 1910) better known by his pseudonym Mark Twain, was a writer, humorist, entrepreneur, publisher and American speaker. Among his novels are The Adventures of Tom Sawyer (1876) and his sequel, The Adventures of Huckleberry Finn (1885), the latter often called "The Great American Novel".Twain was raised in Hannibal, Missouri, who later provided the framework for Tom Sawyer and Huckleberry Finn. He apprenticed with a printer and then worked as a typographer, contributing articles to the journal of his older brother, Orion Clemens. He later became a riverboat pilot on the Mississippi River before heading west to Orion in Nevada. He spoke humorously about his lack of success in mining, turning to journalism for the Virginia City Territorial Enterprise. His humorous story, "The Jumping Jumping Frog of Calaveras County", was published in 1865, based on a story he heard at Angels Hotel in Angels Camp, California where he had spent some time as a minor. The news has attracted international attention and has even been translated into French. His wit and satire, in prose and in speech, earned praise from critics and peers, and he was a friend to presidents, artists, industrialists, and European royalty.Twain has earned a lot of money from his writings and lectures, but he has invested in companies that have lost most - including Paige Compositor, a mechanical typographer who has failed because of its complexity and inaccuracy. He went bankrupt as a result of these financial setbacks, but he eventually overcame his financial problems with the help of Henry Huttleston Rogers. He chose to pay all his creditors in full before the bankruptcy, even though he had no legal responsibility in this regard.Twain was born shortly after the appearance of Halley\'s Comet, and he predicted that he would "come out with" too; he died the day after the return of the comet. He was hailed as "the greatest humorist in this country" and William Faulkner called him "the father of American literature".', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1973311879'}, {'type': 'ISBN_13', 'identifier': '9781973311874'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 234, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=Nh0tswEACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&cd=1&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=Nh0tswEACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Title_Adventures_of_Huckleberry_Finn.html?hl=&id=Nh0tswEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=Nh0tswEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'This is a direct sequel to The Adventures of Tom Sawyer.The book is known for its colorful depiction of people and places along the Mississippi River.'}}, {'kind': 'books#volume', 'id': 'Z9JyswEACAAJ', 'etag': 'y2orEHXknVo', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/Z9JyswEACAAJ', 'volumeInfo': {'title': 'Adventures of Huckleberry Finn', 'authors': ['Mark Twain'], 'publishedDate': '2017-12-17', 'description': 'Adventures of Huckleberry Finn (or, in more recent editions, The Adventures of Huckleberry Finn) is a novel by Mark Twain, first published in the United Kingdom in December 1884 and in the United States in February 1885. Commonly named among the Great American Novels, the work is among the first in major American literature to be written throughout in vernacular English, characterized by local color regionalism. It is told in the first person by Huckleberry "Huck" Finn, the narrator of two other Twain novels (Tom Sawyer Abroad and Tom Sawyer, Detective) and a friend of Tom Sawyer. It is a direct sequel to The Adventures of Tom Sawyer.The book is noted for its colorful description of people and places along the Mississippi River. Set in a Southern antebellum society that had ceased to exist about 20 years before the work was published, Adventures of Huckleberry Finn is an often scathing satire on entrenched attitudes, particularly racism.Perennially popular with readers, Adventures of Huckleberry Finn has also been the continued object of study by literary critics since its publication. The book was widely criticized upon release because of its extensive use of coarse language. Throughout the 20th century, and despite arguments that the protagonist and the tenor of the book are anti-racist, criticism of the book continued due to both its perceived use of racial stereotypes and its frequent use of the racial slur "nigger".AuthorSamuel Langhorne Clemens (November 30, 1835 - April 21, 1910), better known by his pen name Mark Twain, was an American writer, humorist, entrepreneur, publisher, and lecturer. Among his novels are The Adventures of Tom Sawyer (1876) and its sequel, the Adventures of Huckleberry Finn (1885), the latter often called "The Great American Novel".Twain was raised in Hannibal, Missouri, which later provided the setting for Tom Sawyer and Huckleberry Finn. He served an apprenticeship with a printer and then worked as a typesetter, contributing articles to the newspaper of his older brother Orion Clemens. He later became a riverboat pilot on the Mississippi River before heading west to join Orion in Nevada. He referred humorously to his lack of success at mining, turning to journalism for the Virginia City Territorial Enterprise. His humorous story, "The Celebrated Jumping Frog of Calaveras County", was published in 1865, based on a story that he heard at Angels Hotel in Angels Camp, California where he had spent some time as a miner. The short story brought international attention and was even translated into French. His wit and satire, in prose and in speech, earned praise from critics and peers, and he was a friend to presidents, artists, industrialists, and European royalty.Twain earned a great deal of money from his writings and lectures, but he invested in ventures that lost most of it--notably the Paige Compositor, a mechanical typesetter that failed because of its complexity and imprecision. He filed for bankruptcy in the wake of these financial setbacks, but he eventually overcame his financial troubles with the help of Henry Huttleston Rogers. He chose to pay all his pre-bankruptcy creditors in full, even after he had no legal responsibility to do so.Twain was born shortly after an appearance of Halley\'s Comet, and he predicted that he would "go out with it" as well; he died the day after the comet returned. He was lauded as the "greatest humorist this country has produced", and William Faulkner called him "the father of American literature".', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1973573792'}, {'type': 'ISBN_13', 'identifier': '9781973573791'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 295, 'printType': 'BOOK', 'averageRating': 4, 'ratingsCount': 1, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=Z9JyswEACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&cd=2&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=Z9JyswEACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Adventures_of_Huckleberry_Finn.html?hl=&id=Z9JyswEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=Z9JyswEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The Adventures of Huckleberry Finn is a novel by the American Mark Twain, published in London on December 4, 1884 under the title The Adventures of Finn Huckleberry, then in New York in February of the following year under the title ...'}}, {'kind': 'books#volume', 'id': 'Pu86MQAACAAJ', 'etag': 'N3wyEC8YUXo', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/Pu86MQAACAAJ', 'volumeInfo': {'title': 'Huck Finn', 'subtitle': 'The Adventures of Huckleberry Finn', 'authors': ['Mark Twain'], 'publishedDate': '2017-01-20', 'description': "Do you enjoy classic literature in easy-to-carry paperback? Then you'll love Huck Finn by Mark Twain! The full title is The Adventures of Huckleberry Finn. It was published in 1884. Perhaps you read Huck Finn in school as a youth or maybe this is your first time reading Mark Twain's masterpiece or maybe you're a teacher buying the book for your children's literature class. Either way, enjoy Mark Twain's Huck Finn book today!", 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1542635691'}, {'type': 'ISBN_13', 'identifier': '9781542635691'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 202, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=Pu86MQAACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&cd=3&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=Pu86MQAACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Huck_Finn.html?hl=&id=Pu86MQAACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=Pu86MQAACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'It was published in 1884. Perhaps you read Huck Finn in school as a youth or maybe this is your first time reading Mark Twain&#39;s masterpiece or maybe you&#39;re a teacher buying the book for your children&#39;s literature class.'}}, {'kind': 'books#volume', 'id': 'RqmwtAEACAAJ', 'etag': 'dPyl0bkCutw', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/RqmwtAEACAAJ', 'volumeInfo': {'title': 'The Adventures of Huckleberry Finn', 'authors': ['Mark Twain'], 'publisher': 'Digireads.com', 'publishedDate': '2005', 'description': '"The Adventures of Huckleberry Finn" is considered by many to be the greatest of all American novels. This sequel to Twain\'s "The Adventures of Tom Sawyer," is a first person narrative told by its title character. The novel picks up where "The Adventures of Tom Sawyer" leaves off. Huck Finn who is now wealthy with the discovery of treasure at the end of "The Adventures of Tom Sawyer" finds himself in great danger from his abusive drunkard father who wishes to cash in on Huck\'s fortune. Fearing for his life Huck believes that he must run away from his home with the Widow Douglas and her Sister, Miss Watson. Huck fakes his own death and escapes to Jackson\'s Island. There he finds Miss Watson\'s escaped slave, Jim. Together they escape down the Mississippi River on a raft. "The Adventures of Huckleberry Finn" is a story told in the time of slavery with language that embodies the regional dialects that are common to Twain\'s work and the Mississippi River Valley in which Twain grew up. The novel is as much a biting and satirical commentary on slavery, religion, and civilized society as it is a light-hearted comedy and buddy travel story through Midwestern 19th century America.', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1420922629'}, {'type': 'ISBN_13', 'identifier': '9781420922622'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 172, 'printType': 'BOOK', 'averageRating': 3.5, 'ratingsCount': 3189, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=RqmwtAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=RqmwtAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=RqmwtAEACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&cd=4&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=RqmwtAEACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Huckleberry_Finn.html?hl=&id=RqmwtAEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=RqmwtAEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'This sequel to Twain&#39;s &quot;The Adventures of Tom Sawyer,&quot; is a first person narrative told by its title character. The novel picks up where &quot;The Adventures of Tom Sawyer&quot; leaves off.'}}, {'kind': 'books#volume', 'id': '255tPgAACAAJ', 'etag': 'p7oTZYYZzd4', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/255tPgAACAAJ', 'volumeInfo': {'title': 'Mark Twain and Huckleberry Finn', 'authors': ['Stewart Ross'], 'publisher': 'Viking Juvenile', 'publishedDate': '1999', 'description': 'Examines the personal life and literary career of the American author of many well known books, including the somewhat controversial title, "The Adventures of Huckleberry Finn."', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '0670881813'}, {'type': 'ISBN_13', 'identifier': '9780670881819'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 0, 'printType': 'BOOK', 'categories': ['Adventure stories, American'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=255tPgAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=255tPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=255tPgAACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&cd=5&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=255tPgAACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Mark_Twain_and_Huckleberry_Finn.html?hl=&id=255tPgAACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=255tPgAACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Examines the personal life and literary career of the American author of many well known books, including the somewhat controversial title, &quot;The Adventures of Huckleberry Finn.&quot;'}}, {'kind': 'books#volume', 'id': 'QdVGMQAACAAJ', 'etag': 'OFS1gQczyuw', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/QdVGMQAACAAJ', 'volumeInfo': {'title': 'Adventures of Tom Sawyer and Huckleberry Finn', 'subtitle': 'Novel', 'authors': ['Mark Twain'], 'publishedDate': '2016-12-11', 'description': 'Thomas "Tom" Sawyer is the title character of the Mark Twain novel The Adventures of Tom Sawyer (1876). He appears in three other novels by Twain: Adventures of Huckleberry Finn (1884), Tom Sawyer Abroad (1894), and Tom Sawyer, Detective (1896).Sawyer also appears in at least three unfinished Twain works, Huck and Tom Among the Indians, Schoolhouse Hill and Tom Sawyer\'s Conspiracy. While all three uncompleted works were posthumously published, only Tom Sawyer\'s Conspiracy has a complete plot, as Twain abandoned the other two works after finishing only a few chapters.The fictional character\'s name may have been derived from a jolly and flamboyant fireman named Tom Sawyer with whom Twain was acquainted in San Francisco, California, while Twain was employed as a reporter at the San Francisco...Adventures of Huckleberry Finn (or, in more recent editions, The Adventures of Huckleberry Finn) is a novel by Mark Twain, first published in the United Kingdom in December 1884 and in the United States in February 1885. Commonly named among the Great American Novels, the work is among the first in major American literature to be written throughout in vernacular English,...The book is noted for its colorful description of people and places along the Mississippi River. Set in a Southern antebellum society that had ceased to exist about 20 years before the work was published, Adventures of Huckleberry Finn is an often scathing satire on entrenched attitudes, particularly racism...Summary : Tom Sawyer is a boy of about 12 years of age, who resides in the fictional town of St. Petersburg, Missouri, in about the year 1845. Tom Sawyer\'s best friends include Joe Harper and Huckleberry Finn. In The Adventures of Tom Sawyer...Huck is the story begins in fictional St. Kingston, Missouri (based on the actual town of Hannibal, Missouri), on the shore of the Mississippi River "forty to fifty years ago" (the novel having been published in 1884). Huckleberry "Huck" Finn (the protagonist and first-person narrator) and his friend, Thomas "Tom" Sawyer, have each come into a considerable sum of money as a result of their earlier adventures (detailed in The Adventures of Tom Sawyer)...Extrait : (Tom) The old lady pulled her spectacles down and looked over them about the room; then she put them up and looked out under them. She seldom or never looked through them for so small a thing as a boy; they were her state pair, the pride of her heart, and were...(Huck) The widow she cried over me, and called me a poor lost lamb, and she called me a lot of other names, too, but she never meant no harm by it. She put me in them new clothes again, and I couldn\'t do nothing but sweat and sweat, and feel all cramped up. Well, then, the old thing commenced again. The widow rung a bell for supper, and you had to come to timeBiography : Samuel Langhorne Clemens (November 30, 1835 - April 21, 1910),[2] better known by his pen name Mark Twain, was an American writer, entrepreneur, publisher and lecturer. Among his novels are The Adventures of Tom Sawyer (1876) and its sequel, Adventures of Huckleberry Finn (1885),[3] the latter often called "The Great American Novel".Twain was raised in Hannibal, Missouri, which later provided the setting for Tom Sawyer and Huckleberry Finn. After an apprenticeship with a printer, Twain worked as a typesetter and contributed articles to the newspaper of his older brother, Orion Clemens. He later became a riverboat pilot on the Mississippi River before heading west to join Orion in Nevada. He referred humorously to his lack of success at mining, turning to journalism for the Virginia City Territorial Enterprise.[4] In 1865, his humorous story "The Celebrated Jumping Frog of Calaveras County" was published, based on a story he heard at Angels Hotel in Angels Camp, California, where he had spent some time as a miner. The short story brought international attention, and was even translated into classic Greek...', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1520123477'}, {'type': 'ISBN_13', 'identifier': '9781520123479'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 439, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=QdVGMQAACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&cd=6&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=QdVGMQAACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Adventures_of_Tom_Sawyer_and_Huckleberry.html?hl=&id=QdVGMQAACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=QdVGMQAACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Thomas &quot;Tom&quot; Sawyer is the title character of the Mark Twain novel The Adventures of Tom Sawyer (1876).'}}, {'kind': 'books#volume', 'id': 'ngm-ugEACAAJ', 'etag': 'r/N2vp0/7x8', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/ngm-ugEACAAJ', 'volumeInfo': {'title': 'The Adventures of Huckleberry Finn', 'subtitle': 'Large Print', 'authors': ['Mark Twain'], 'publisher': 'Createspace Independent Publishing Platform', 'publishedDate': '2018-08-07', 'description': 'Adventures of Huckleberry Finn by Mark Twain Adventures of Huckleberry Finn is a novel by Mark Twain, first published in the United Kingdom in December 1884 and in the United States in February 1885. Commonly named among the Great American Novels, the work is among the first in major American literature to be written throughout in vernacular English, characterized by local color regionalism. It is told in the first person by Huckleberry "Huck" Finn, a friend of Tom Sawyer and narrator of two other Twain novels (Tom Sawyer Abroad and Tom Sawyer, Detective). It is a direct sequel to The Adventures of Tom Sawyer. The book is noted for its colorful description of people and places along the Mississippi River. Set in a Southern antebellum society that had ceased to exist about twenty years before the work was published, Adventures of Huckleberry Finn is an often scathing satire on entrenched attitudes, particularly racism. We are delighted to publish this classic book as part of our extensive Classic Library collection. Many of the books in our collection have been out of print for decades, and therefore have not been accessible to the general public. The aim of our publishing program is to facilitate rapid access to this vast reservoir of literature, and our view is that this is a significant literary work, which deserves to be brought back into print after many decades. The contents of the vast majority of titles in the Classic Library have been scanned from the original works. To ensure a high quality product, each title has been meticulously hand curated by our staff. Our philosophy has been guided by a desire to provide the reader with a book that is as close as possible to ownership of the original work. We hope that you will enjoy this wonderful classic work, and that for you it becomes an enriching experience.', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1724825658'}, {'type': 'ISBN_13', 'identifier': '9781724825650'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 424, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=ngm-ugEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=ngm-ugEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=ngm-ugEACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&cd=7&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=ngm-ugEACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Huckleberry_Finn.html?hl=&id=ngm-ugEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=ngm-ugEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'We are delighted to publish this classic book as part of our extensive Classic Library collection. Many of the books in our collection have been out of print for decades, and therefore have not been accessible to the general public.'}}, {'kind': 'books#volume', 'id': '2hbEsgEACAAJ', 'etag': 'Nkx28hy/tqU', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/2hbEsgEACAAJ', 'volumeInfo': {'title': 'The Adventures of Huckleberry Finn', 'authors': ['Mark Twain'], 'publisher': 'Digireads.com', 'publishedDate': '2015-06-17', 'description': '"The Adventures of Huckleberry Finn" is considered by many to be the greatest of all American novels. This sequel to Twain\'s "The Adventures of Tom Sawyer," is a first person narrative told by its title character. The novel picks up where "The Adventures of Tom Sawyer" leaves off. Huck Finn who is now wealthy with the discovery of treasure at the end of "The Adventures of Tom Sawyer" finds himself in great danger from his abusive drunkard father who wishes to cash in on Huck\'s fortune. Fearing for his life Huck believes that he must run away from his home with the Widow Douglas and her Sister, Miss Watson. Huck fakes his own death and escapes to Jackson\'s Island. There he finds Miss Watson\'s escaped slave, Jim. Together they escape down the Mississippi River on a raft. "The Adventures of Huckleberry Finn" is a story told in the time of slavery with language that embodies the regional dialects that are common to Twain\'s work and the Mississippi River Valley in which Twain grew up. The novel is as much a biting and satirical commentary on slavery, religion, and civilized society as it is a light-hearted comedy and buddy travel story through Midwestern 19th century America. This edition is printed on premium acid-free paper and includes an introduction by Brander Matthews.', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1420951602'}, {'type': 'ISBN_13', 'identifier': '9781420951608'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 220, 'printType': 'BOOK', 'categories': ['Fiction'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=2hbEsgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=2hbEsgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=2hbEsgEACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&cd=8&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=2hbEsgEACAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Huckleberry_Finn.html?hl=&id=2hbEsgEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=2hbEsgEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'This edition is printed on premium acid-free paper and includes an introduction by Brander Matthews.'}}, {'kind': 'books#volume', 'id': '7bU4AAAAMAAJ', 'etag': 'LIg5+AoKXQA', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/7bU4AAAAMAAJ', 'volumeInfo': {'title': 'The Adventures of Huckleberry Finn', 'subtitle': '(Tom Sawyer', 'authors': ['Mark Twain'], 'publishedDate': '1912', 'industryIdentifiers': [{'type': 'OTHER', 'identifier': 'UOM:39015000557994'}], 'readingModes': {'text': True, 'image': False}, 'pageCount': 436, 'printType': 'BOOK', 'averageRating': 4, 'ratingsCount': 168, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '1.6.11.0.preview.2', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=7bU4AAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=7bU4AAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=7bU4AAAAMAAJ&q=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&cd=9&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=7bU4AAAAMAAJ&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Huckleberry_Finn.html?hl=&id=7bU4AAAAMAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=7bU4AAAAMAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}}, {'kind': 'books#volume', 'id': '_zJrGHfzU_YC', 'etag': 'OcE26vEfkAY', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/_zJrGHfzU_YC', 'volumeInfo': {'title': 'The Adventures of Huckleberry Finn', 'subtitle': 'A Penguin Enriched eBook Classic', 'authors': ['Mark Twain'], 'publisher': 'Penguin', 'publishedDate': '2008-09-30', 'description': "Of all the contenders for the title of The Great American Novel, none has a better claim than The Adventures of Huckleberry Finn. Intended at first as a simple story of a boy's adventures in the Mississippi Valley ”a sequel to Tom Sawyer” the book grew and matured under Twain's hand into a work of immeasurable richness and complexity. More than a century after its publication, the critical debate over the symbolic significance of Huck's and Jim's voyage is still fresh, and it remains a major work that can be enjoyed at many levels: as an incomparable adventure story and as a classic of American humor. Enriched eBook Features Editor R. Kent Rasmussen provides the following specially commissioned features for this Enriched eBook Classic: * Chronology * Filmography and Stills from the 1920 Silent Film Huckleberry Film * Contemporary Reviews of Huckleberry Finn * Further Reading * Online Mark Twain Resources and Places to Visit * Photos of Mark Twain Sites and First Edition Frontispiece * Selection of E.W. Kemble’s Illustrations for the First Edition of The Adventures of Huckleberry Finn and John Harley’s Illustrations for the First Edition of Life on the Mississippi * Enriched eBook Notes The enriched eBook format invites readers to go beyond the pages of these beloved works and gain more insight into the life and times of an author and the period in which the book was originally written for a rich reading experience.", 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781440657580'}, {'type': 'ISBN_10', 'identifier': '1440657580'}], 'readingModes': {'text': True, 'image': False}, 'pageCount': 368, 'printType': 'BOOK', 'categories': ['Fiction'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.8.7.0.preview.2', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=_zJrGHfzU_YC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=_zJrGHfzU_YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=_zJrGHfzU_YC&printsec=frontcover&dq=title:Adventures+of+Huckleberry+Finn+by+Mark+Twain&hl=&cd=10&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=_zJrGHfzU_YC&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=_zJrGHfzU_YC'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 10.83, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 10.83, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=_zJrGHfzU_YC&rdid=book-_zJrGHfzU_YC&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 10830000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 10830000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/The_Adventures_of_Huckleberry_Finn-sample-epub.acsm?id=_zJrGHfzU_YC&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=_zJrGHfzU_YC&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Enriched eBook Features Editor R. Kent Rasmussen provides the following specially commissioned features for this Enriched eBook Classic: * Chronology * Filmography and Stills from the 1920 Silent Film Huckleberry Film * Contemporary Reviews ...'}}]}