{'kind': 'books#volumes', 'totalItems': 457, 'items': [{'kind': 'books#volume', 'id': 'iajDywEACAAJ', 'etag': '9jpgwZKwlDI', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/iajDywEACAAJ', 'volumeInfo': {'title': 'Peter Pan (Illustrated)', 'authors': ['J. M. Barrie'], 'publishedDate': '2018-11', 'description': "Peter Pan; or, the Boy Who Wouldn't Grow Up or Peter and Wendy is J. M. Barrie's most famous work, in the form of a 1904 play and a 1911 novel. Both versions tell the story of Peter Pan, a mischievous yet innocent little boy who can fly, and has many adventures on the island of Neverland that is inhabited by mermaids, fairies, Native Americans and pirates. The Peter Pan stories also involve the characters Wendy Darling and her two brothers, Peter's fairy Tinker Bell, the Lost Boys, and the pirate Captain Hook. The play and novel were inspired by Barrie's friendship with the Llewelyn Davies family. Barrie continued to revise the play for years after its debut until publication of the play script in 1928.The play debuted in London on 27 December 1904 with Nina Boucicault, daughter of playwright Dion Boucicault, in the title role. A Broadway production was mounted in 1905 starring Maude Adams. It was later revived with such actresses as Marilyn Miller and Eva Le Gallienne. The play has since been adapted as a pantomime, stage musical, a television special, and several films, including a 1924 silent film, Disney's 1953 animated full-length feature film, and a 2003 live action production. The play is now rarely performed in its original form on stage in the United Kingdom, whereas pantomime adaptations are frequently staged around Christmas. In the U.S., the original version has also been supplanted in popularity by the 1954 musical version, which became popular on television.The novel was first published in 1911 by Hodder & Stoughton in the United Kingdom and Charles Scribner's Sons in the United States. The original book contains a frontispiece and 11 half-tone plates by artist F. D. Bedford (whose illustrations are still under copyright in the EU). The novel was first abridged by May Byron in 1915, with Barrie's permission, and published under the title Peter Pan and Wendy, the first time this form was used. This version was later illustrated by Mabel Lucie Attwell in 1921. In 1929, Barrie gave the copyright of the Peter Pan works to Great Ormond Street Hospital, a children's hospital in London.", 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1728993415'}, {'type': 'ISBN_13', 'identifier': '9781728993416'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 131, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=iajDywEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&cd=1&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=iajDywEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Peter_Pan_Illustrated.html?hl=&id=iajDywEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=iajDywEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The novel was first abridged by May Byron in 1915, with Barrie&#39;s permission, and published under the title Peter Pan and Wendy, the first time this form was used. This version was later illustrated by Mabel Lucie Attwell in 1921.'}}, {'kind': 'books#volume', 'id': 'TeqKzgEACAAJ', 'etag': 'v524BHXGKuI', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/TeqKzgEACAAJ', 'volumeInfo': {'title': 'Peter Pan', 'authors': ['James M. Barrie'], 'publisher': 'Pop! Lit for Kids', 'publishedDate': '2022-01-03', 'description': "The World of Discovery Collection is a specially curated selection of children's books that focus on discovering Asia and discovering STEM (Science, Technology, Engineering and Maths). Under the guidance of Dr Ruth Y L Wong, these books aim to promote reading for pleasure, while exciting kids through discovery. With 51 books in this inaugural batch, and with more to come, the books are divided into three levels depending on the child's reading ability: A (Achieving), B (Blooming) and C (Confident). Level C Set 3 features seven titles, exploring themes of science, imagination, nature and global stories. Intended outcomes of Level C include teaching children to be able to: point to the words as they are read aloud sound out at least 90% of the words read longer sentences and longer texts enjoy being read to engage in independent reading Each book includes a story-based activity at the end of the books to help parents and educators get children to engage with the story. Includes these 7 titles: Advances in Alchemy (The Young Scientists series) Did you know that popsicles were invented by an 11-year-old boy, Frank Epperson, by accident? Or that caffeine was discovered by a chemist nicknamed Dr Poison? Read about them and other startling discoveries in the fields of Chemistry and Biology! Breakers of Barriers (The Young Scientists series) Did you know that Blaise Pascal became one of the first inventors of the mechanical calculator while trying to help his father with his work? Or that Tu Youyou, a Chinese scientist, found a cure for malaria by reading ancient Chinese medical texts and then using herself as a human test subject? Read about them and other stunning stories of people who made history after overcoming many barriers! Fabulous Physics (The Young Scientists series) Did you know that Marie Curie, who discovered radioactivity, started off as a domestic helper looking after a farmer's children? Or that Michael Faraday, inventor of the electric motor, taught himself science while working in a small bookshop? Read about them and other amazing people who solved puzzles related to Physics! Magical Mathematics (The Young Scientists series) Did you know that Carl Gauss, a German mathematician, used mathematics to find his own date of birth? Or that Maria Agnesi, the first woman to be appointed a mathematics professor at a university, could speak 7 languages at the age of 13? Read about them and other astonishing stories of people who were magical with numbers! Scientific Pioneers (The Young Scientists series) Did you know that Al-Haytham, one of the originators of the scientific method, pretended to be a lunatic to get himself locked up? Or that Carl Linnaeus, famous for his classification system for living things, once preferred exploring forests to reading books? Read about them and other incredible people who helped develop the scientific method! Women of Discovery (The Young Scientists series) Did you know that the Eiffel Tower was partly built based on the calculations of Sophie Germain, a French mathematician? Or that one of the world's greatest bug scientist was a woman named Maria Merian? Read about them and other fabulous females who made significant contributions to science! Secrets in the Rocks (The Young Scientists series) Did you know that Georges Cuvier, the father of the dinosaur world, loved sketching flowers and animals? Or that Louis Aggasiz, discoverer of the Ice Age, kept a live tree full of birds and bugs in his bedroom? Read about them and other astounding tales of people who uncovered secrets in the rocks and solved the mysteries beneath our feet!", 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '9811244618'}, {'type': 'ISBN_13', 'identifier': '9789811244612'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 0, 'printType': 'BOOK', 'categories': ['Juvenile Fiction'], 'averageRating': 3.5, 'ratingsCount': 135, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=TeqKzgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=TeqKzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=TeqKzgEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&cd=2&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=TeqKzgEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Peter_Pan.html?hl=&id=TeqKzgEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=TeqKzgEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Under the guidance of Dr Ruth Y L Wong, these books aim to promote reading for pleasure, while exciting kids through discovery.'}}, {'kind': 'books#volume', 'id': 'ICPDDwAAQBAJ', 'etag': 'PaJNqbLd4UA', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/ICPDDwAAQBAJ', 'volumeInfo': {'title': 'Peter Pan in Kensington Gardens', 'authors': ['J. M. Barrie'], 'publisher': 'Good Press', 'publishedDate': '2021-04-24', 'description': '"Peter Pan in Kensington Gardens" by J. M. Barrie. Published by Good Press. Good Press publishes a wide range of titles that encompasses every genre. From well-known classics & literary fiction and non-fiction to forgotten−or yet undiscovered gems−of world literature, we issue the books that need to be read. Each Good Press edition has been meticulously edited and formatted to boost readability for all e-readers and devices. Our goal is to produce eBooks that are user-friendly and accessible to everyone in a high-quality digital format.', 'industryIdentifiers': [{'type': 'OTHER', 'identifier': 'EAN:4057664639608'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 4005, 'printType': 'BOOK', 'categories': ['Fiction'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '0.5.7.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=ICPDDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=ICPDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=ICPDDwAAQBAJ&printsec=frontcover&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&cd=3&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=ICPDDwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=ICPDDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 1.99, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 1.99, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=ICPDDwAAQBAJ&rdid=book-ICPDDwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 1990000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 1990000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=ICPDDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Good Press publishes a wide range of titles that encompasses every genre. From well-known classics &amp; literary fiction and non-fiction to forgotten−or yet undiscovered gems−of world literature, we issue the books that need to be read.'}}, {'kind': 'books#volume', 'id': 'wWrAzQEACAAJ', 'etag': '8Pkx8ePTV6g', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/wWrAzQEACAAJ', 'volumeInfo': {'title': 'Peter Pan', 'subtitle': 'Peter and Wendy (New Edition) - J. M. Barrie', 'authors': ['J. Barrie'], 'publishedDate': '2020-06-26', 'description': '"Peter Pan" is a classic tale enjoyed by children for more than 100 years, although these days, it is better known through various movie adaptions that have been made from it. And yet, as they say, the \'book is better than the movie.\' Why? Because movie makers are notorious for making changes to the books they are based on, and these changes tend to take away from the magic the author poured into the original. It is unfortunately the case that with "Peter Pan," even the book has been adapted many times, too. Well, this is your chance to read the tale as it was originally written with its original illustrations, drinking in the magic that started it all. With even the cover being inspired by the original, this edition is about as close as you can get to capturing the original thrill of "Peter Pan.""Peter Pan" was originally published in 1911 by J. M. Barrie with the title, "Peter and Wendy." Please provide your review after purchase for our future enhancements.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9798657130683'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 183, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=wWrAzQEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&cd=4&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=wWrAzQEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Peter_Pan.html?hl=&id=wWrAzQEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=wWrAzQEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'With even the cover being inspired by the original, this edition is about as close as you can get to capturing the original thrill of &quot;Peter Pan.&quot;&quot;Peter Pan&quot; was originally published in 1911 by J. M. Barrie with the title, &quot;Peter and Wendy.'}}, {'kind': 'books#volume', 'id': 'gkO3zAEACAAJ', 'etag': 'w9J6Wm8LT/g', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/gkO3zAEACAAJ', 'volumeInfo': {'title': 'Peter Pan (Peter and Wendy) Illustrated And Annotated', 'authors': ['James Matthew Barrie'], 'publishedDate': '2019-12-08', 'description': 'About Author: Sir James Matthew Barrie, 1st Baronet, OM (/ˈbæri/; 9 May 1860 - 19 June 1937) was a Scottish novelist and playwright, best remembered today as the creator of Peter Pan. He was born and educated in Scotland and then moved to London, where he wrote a number of successful novels and plays. There he met the Llewelyn Davies boys, who inspired him to write about a baby boy who has magical adventures in Kensington Gardens (first included in Barrie\'s adult novel The Little White Bird), then to write Peter Pan, or The Boy Who Wouldn\'t Grow Up, a "fairy play" about an ageless boy and an ordinary girl named Wendy who have adventures in the fantasy setting of Neverland.Although he continued to write successfully, Peter Pan overshadowed his other work, and is credited with popularising the name Wendy.[1] Barrie unofficially adopted the Davies boys following the deaths of their parents. Barrie was made a baronet by George V on 14 June 1913, [2] and a member of the Order of Merit in the 1922 New Year Honours.[3] Before his death, he gave the rights to the Peter Pan works to Great Ormond Street Hospital for Children in London, which continues to benefit from them.Product Description: Peter Pan; or, the Boy Who Wouldn\'t Grow Up or Peter and Wendy is J. M. Barrie\'s most famous work, in the form of a 1904 play and a 1911 novel. Both versions tell the story of Peter Pan, a mischievous yet innocent little boy who can fly, and has many adventures on the island of Neverland that is inhabited by mermaids, fairies, Native Americans and pirates. The Peter Pan stories also involve the characters Wendy Darling and her two brothers, Peter\'s fairy Tinker Bell, the Lost Boys, and the pirate Captain Hook. The play and novel were inspired by Barrie\'s friendship with the Llewelyn Davies family. Barrie continued to revise the play for years after its debut until publication of the play script in 1928.The play debuted in London on 27 December 1904 with Nina Boucicault, daughter of playwright Dion Boucicault, in the title role. A Broadway production was mounted in 1905 starring Maude Adams. It was later revived with such actresses as Marilyn Miller and Eva Le Gallienne. The play has since been adapted as a pantomime, stage musical, a television special, and several films, including a 1924 silent film, the 1953 Disney film, and a 2003 live action production. The play is now rarely performed in its original form on stage in the United Kingdom, whereas pantomime adaptations are frequently staged around Christmas. In the U.S., the original version has also been supplanted in popularity by the 1954 musical version, which became popular on television.The novel was first published in 1911 by Hodder & Stoughton in the United Kingdom, and Charles Scribner\'s Sons in the United States. The original book contains a frontispiece and 11 half-tone plates by artist F. D. Bedford (whose illustrations are still under copyright in the EU). The novel was first abridged by May Byron in 1915, with Barrie\'s permission, and published under the title Peter Pan and Wendy, the first time this form was used. This version was later illustrated by Mabel Lucie Attwell in 1921. In 1929, Barrie gave the copyright of the Peter Pan works to Great Ormond Street Hospital, a children\'s hospital in London.Barrie created Peter Pan in stories he told to the sons of his friend Sylvia Llewelyn Davies, with whom he had forged a special relationship. Mrs. Llewelyn Davies\'s death from cancer came within a few years after the death of her husband; Barrie was a co-guardian of the boys, and unofficially adopted them.The character\'s name comes from two sources: Peter Llewelyn Davies, one of the boys, and Pan, the mischievous Greek god of the woodlands.Andrew Birkin has suggested that the inspiration for the character was Barrie\'s elder brother David, whose death in a skating accident at the age of fourteen deeply affected their mother. Source: Wikipedia', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1673249558'}, {'type': 'ISBN_13', 'identifier': '9781673249552'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 144, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=gkO3zAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=gkO3zAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=gkO3zAEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&cd=5&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=gkO3zAEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Peter_Pan_Peter_and_Wendy_Illustrated_An.html?hl=&id=gkO3zAEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=gkO3zAEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The novel was first abridged by May Byron in 1915, with Barrie&#39;s permission, and published under the title Peter Pan and Wendy, the first time this form was used. This version was later illustrated by Mabel Lucie Attwell in 1921.'}}, {'kind': 'books#volume', 'id': '5QDYzQEACAAJ', 'etag': 'GOU/RIN051s', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/5QDYzQEACAAJ', 'volumeInfo': {'title': 'Peter Pan', 'authors': ['James Matthew Barrie'], 'publishedDate': '2020-09-13', 'description': '"Peter Pan" is a classic tale enjoyed by children for more than 100 years, although these days, it is better known through various movie adaptions that have been made from it. And yet, as they say, the \'book is better than the movie.\' Why? Because movie makers are notorious for making changes to the books they are based on, and these changes tend to take away from the magic the author poured into the original. It is unfortunately the case that with "Peter Pan," even the book has been adapted many times, too. Well, this is your chance to read the tale as it was originally written with its original illustrations, drinking in the magic that started it all. With even the cover being inspired by the original, this edition is about as close as you can get to capturing the original thrill of "Peter Pan."Peter Pan" was originally published in 1911 by J. M. Barrie with the title, "Peter and Wendy." This edition is carefully constructed from that original text. It also contains the original illustrations by F. D. Bedford.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9798685954701'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 84, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=5QDYzQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=5QDYzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=5QDYzQEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&cd=6&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=5QDYzQEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Peter_Pan.html?hl=&id=5QDYzQEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=5QDYzQEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'With even the cover being inspired by the original, this edition is about as close as you can get to capturing the original thrill of &quot;Peter Pan.&quot;Peter Pan&quot; was originally published in 1911 by J. M. Barrie with the title, &quot;Peter and Wendy.'}}, {'kind': 'books#volume', 'id': 'FpPZzQEACAAJ', 'etag': 'Usel3R5HDAM', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/FpPZzQEACAAJ', 'volumeInfo': {'title': 'Peter Pan', 'authors': ['James Matthew Barrie'], 'publishedDate': '2020-09-13', 'description': '"Peter Pan" is a classic tale enjoyed by children for more than 100 years, although these days, it is better known through various movie adaptions that have been made from it. And yet, as they say, the \'book is better than the movie.\' Why? Because movie makers are notorious for making changes to the books they are based on, and these changes tend to take away from the magic the author poured into the original. It is unfortunately the case that with "Peter Pan," even the book has been adapted many times, too. Well, this is your chance to read the tale as it was originally written with its original illustrations, drinking in the magic that started it all. With even the cover being inspired by the original, this edition is about as close as you can get to capturing the original thrill of "Peter Pan."Peter Pan" was originally published in 1911 by J. M. Barrie with the title, "Peter and Wendy." This edition is carefully constructed from that original text. It also contains the original illustrations by F. D. Bedford.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9798685954718'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 84, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=FpPZzQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=FpPZzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=FpPZzQEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&cd=7&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=FpPZzQEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Peter_Pan.html?hl=&id=FpPZzQEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=FpPZzQEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'With even the cover being inspired by the original, this edition is about as close as you can get to capturing the original thrill of &quot;Peter Pan.&quot;Peter Pan&quot; was originally published in 1911 by J. M. Barrie with the title, &quot;Peter and Wendy.'}}, {'kind': 'books#volume', 'id': 'MLskjwEACAAJ', 'etag': '86E/bri8lts', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/MLskjwEACAAJ', 'volumeInfo': {'title': 'Peter Pan, Peter and Wendy.', 'authors': ['J. M. Barrie'], 'publisher': 'Createspace Independent Publishing Platform', 'publishedDate': '2015-12-19', 'description': "J. M. Barrie first used Peter Pan as a character in a section of The Little White Bird (1902). He returned to that character as the centre of his stage play entitled Peter Pan, or The Boy Who Wouldn't Grow Up, which premiered on 27 December 1904 in London. The play was highly popular, running to 1913. Following the success of the 1904 play, Barrie's publishers, Hodder and Stoughton, extracted chapters 13-18 of The Little White Bird and republished them in 1906 under the title Peter Pan in Kensington Gardens, with the addition of illustrations by Arthur Rackham. Barrie adapted and expanded the play's story line as a novel, published in 1911 as Peter and Wendy.", 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1522824960'}, {'type': 'ISBN_13', 'identifier': '9781522824961'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 122, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=MLskjwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=MLskjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=MLskjwEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&cd=8&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=MLskjwEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Peter_Pan_Peter_and_Wendy.html?hl=&id=MLskjwEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=MLskjwEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Barrie adapted and expanded the play&#39;s story line as a novel, published in 1911 as Peter and Wendy.'}}, {'kind': 'books#volume', 'id': 'Pt3bzQEACAAJ', 'etag': '2d2la9wu+9c', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/Pt3bzQEACAAJ', 'volumeInfo': {'title': 'Peter Pan', 'subtitle': 'Peter and Wendy', 'authors': ['James Barrie'], 'publishedDate': '2020-09-10', 'description': '"Peter Pan" was originally published in 1911 by J. M. Barrie with the title, "Peter and Wendy." For more than a century, the adventures of Peter Pan--the boy who can fly and never grows up--and Wendy Darling have captured the hearts of generations of readers. In this enchanting tale, the magic world of Neverland and its wonderful inhabitants, including the Lost Boys, Captain Hook, Tiger Lily, and the beloved Tinker Bell, are brought to life like never before.Peter Pan is a stunning book is sure to become a treasured keepsake for fans of all ages.A must for every family library.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9798684846656'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 68, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=Pt3bzQEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&cd=9&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=Pt3bzQEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Peter_Pan.html?hl=&id=Pt3bzQEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=Pt3bzQEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'In this enchanting tale, the magic world of Neverland and its wonderful inhabitants, including the Lost Boys, Captain Hook, Tiger Lily, and the beloved Tinker Bell, are brought to life like never before.Peter Pan is a stunning book is sure ...'}}, {'kind': 'books#volume', 'id': 'hY8NtAEACAAJ', 'etag': 'DlzSXgxPqBc', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/hY8NtAEACAAJ', 'volumeInfo': {'title': 'Peter and Wendy', 'authors': ['J. Barrie'], 'publisher': 'Createspace Independent Publishing Platform', 'publishedDate': '2018-03-16', 'description': "Voted Top 100 in Books for Children. Peter and Wendy. J. M. Barrie. Illustrated by F. D. Bedford. Peter Pan; or, the Boy Who Wouldn't Grow Up or Peter and Wendy is J. M. Barrie's most famous work, in the form of a 1904 play and a 1911 novel. Both versions tell the story of Peter Pan, a mischievous little boy who can fly, and his adventures on the island of Neverland with Wendy Darling and her brothers, the fairy Tinker Bell, the Lost Boys, the Indian princess Tiger Lily, and the pirate Captain Hook. The play and novel were inspired by Barrie's friendship with the Llewelyn Davies family. Barrie continued to revise the play for years after its debut; the novel reflects one version of the story. The play debuted in London on 27 December 1904 with Nina Boucicault, daughter of playwright Dion Boucicault, in the title role. A Broadway production was mounted in 1905 starring Maude Adams. It was later revived with such actresses as Marilyn Miller and Eva Le Gallienne. The play has since seen adaptation as a pantomime, stage musical, a television special, and several films, including a 1924 silent film, a 1953 animated Disney full-length feature, and a 2003 live action production. The play is now rarely performed in its original form on stage in the United Kingdom, whereas pantomime adaptations are frequently staged around Christmas. In the U.S., the original version has also been supplanted in popularity by the 1954 musical version, which became popular on television. The novel was first published in 1911 by Hodder & Stoughton in the United Kingdom and Charles Scribner's Sons in the United States. The original book contains a frontispiece and 11 half-tone plates by artist F. D. Bedford (whose illustrations are still in copyright in the EU). The novel was first abridged by May Byron in 1915, with Barrie's permission, and published under the title Peter Pan and Wendy, the first time this form was used. This version was later illustrated by Mabel Lucie Attwell in 1921. The novel is now usually published under that title or simply Peter Pan. The script of the play, which Barrie had continued to revise since its first performance, was published in 1928. In 1929, Barrie gave the copyright of the Peter Pan works to Great Ormond Street Hospital, a children's hospital in London.", 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1986508994'}, {'type': 'ISBN_13', 'identifier': '9781986508995'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 182, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=hY8NtAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=hY8NtAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=hY8NtAEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&cd=10&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=hY8NtAEACAAJ&dq=title:Peter+Pan+by+J.+M.+Barrie&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Peter_and_Wendy.html?hl=&id=hY8NtAEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=hY8NtAEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The play and novel were inspired by Barrie&#39;s friendship with the Llewelyn Davies family. Barrie continued to revise the play for years after its debut; the novel reflects one version of the story.'}}]}