{'kind': 'books#volumes', 'totalItems': 245, 'items': [{'kind': 'books#volume', 'id': '2QN5CwAAQBAJ', 'etag': 'cSDujDOh33s', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/2QN5CwAAQBAJ', 'volumeInfo': {'title': 'The Adventures of Ferdinand Count Fathom, Complete', 'subtitle': "Smollett's Collection", 'authors': ['T. Smollett'], 'publisher': 'VM eBooks', 'publishedDate': '2016-01-29', 'description': 'INTRODUCTION The Adventures of Ferdinand Count Fathom, Smollett\'s third novel, was given to the world in 1753. Lady Mary Wortley Montagu, writing to her daughter, the Countess of Bute, over a year later [ January 1st, 1755], remarked that "my friend Smollett . . . has certainly a talent for invention, though I think it flags a little in his last work." Lady Mary was both right and wrong. The inventive power which we commonly think of as Smollett\'s was the ability to work over his own experience into realistic fiction. Of this, Ferdinand Count Fathom shows comparatively little. It shows relatively little, too, of Smollett\'s vigorous personality, which in his earlier works was present to give life and interest to almost every chapter, were it to describe a street brawl, a ludicrous situation, a whimsical character, or with venomous prejudice to gibbet some enemy. This individuality—the peculiar spirit of the author which can be felt rather than described—is present in the dedication of Fathom to Doctor ———, who is no other than Smollett himself, and a candid revelation of his character, by the way, this dedication contains. It is present, too, in the opening chapters, which show, likewise, in the picture of Fathom\'s mother, something of the author\'s peculiar "talent for invention." Subsequently, however, there is no denying that the Smollett invention and the Smollett spirit both flag. And yet, in a way, Fathom displays more invention than any of the author\'s novels; it is based far less than any other on personal experience. Unfortunately such thorough-going invention was not suited to Smollett\'s genius. The result is, that while uninteresting as a novel of contemporary manners, Fathom has an interest of its own in that it reveals a new side of its author. We think of Smollett, generally, as a rambling storyteller, a rational, unromantic man of the world, who fills his pages with his own oddly-metamorphosed acquaintances and experiences. The Smollett of Count Fathom, on the contrary, is rather a forerunner of the romantic school, who has created a tolerably organic tale of adventure out of his own brain. Though this is notably less readable than the author\'s earlier works, still the wonder is that when the man is so far "off his beat," he should yet know so well how to meet the strange conditions which confront him. To one whose idea of Smollett\'s genius is formed entirely by Random and Pickle and Humphry Clinker, Ferdinand Count Fathom will offer many surprises. The first of these is the comparative lifelessness of the book. True, here again are action and incident galore, but generally unaccompanied by that rough Georgian hurly-burly, common in Smollett, which is so interesting to contemplate from a comfortable distance, and which goes so far towards making his fiction seem real. Nor are the characters, for the most part, life-like enough to be interesting. There is an apparent exception, to be sure, in the hero\'s mother, already mentioned, the hardened camp-follower, whom we confidently expect to become vitalised after the savage fashion of Smollett\'s characters. But, alas! we have no chance to learn the lady\'s style of conversation, for the few words that come from her lips are but partially characteristic; we have only too little chance to learn her manners and customs. In the fourth chapter, while she is making sure with her dagger that all those on the field of battle whom she wishes to rifle are really dead, an officer of the hussars, who has been watching her lucrative progress, unfeelingly puts a brace of bullets into the lady\'s brain, just as she raises her hand to smite him to the heart. Perhaps it is as well that she is thus removed before our disappointment at the non-fulfilment of her promise becomes poignant. So far as we may judge from the other personages of Count Fathom, even this interesting Amazon would sooner or later have turned into a wooden figure, with a label giving the necessary information as to her character. Such certainly is her son, Fathom, the hero of the book. Because he is placarded, "Shrewd villain of monstrous inhumanity," we are fain to accept him for what his creator intended; but seldom in word or deed is he a convincingly real villain. His friend and foil, the noble young Count de Melvil, is no more alive than he; and equally wooden are Joshua, the high-minded, saint-like Jew, and that tedious, foolish Don Diego. Neither is the heroine alive, the peerless Monimia, but then, in her case, want of vitality is not surprising; the presence of it would amaze us. If she were a woman throbbing with life, she would be different from Smollett\'s other heroines. The "second lady" of the melodrama, Mademoiselle de Melvil, though by no means vivified, is yet more real than her sister-in-law. The fact that they are mostly inanimate figures is not the only surprise given us by the personages of Count Fathom. It is a surprise to find few of them strikingly whimsical; it is a surprise to find them in some cases far more distinctly conceived than any of the people in Roderick Random or Peregrine Pickle. In the second of these, we saw Smollett beginning to understand the use of incident to indicate consistent development of character. In Count Fathom, he seems fully to understand this principle of art, though he has not learned to apply it successfully. And so, in spite of an excellent conception, Fathom, as I have said, is unreal. After all his villainies, which he perpetrates without any apparent qualms of conscience, it is incredible that he should honestly repent of his crimes. We are much inclined to doubt when we read that "his vice and ambition was now quite mortified within him," the subsequent testimony of Matthew Bramble, Esq., in Humphry Clinker, to the contrary, notwithstanding. Yet Fathom up to this point is consistently drawn, and drawn for a purpose:—to show that cold-blooded roguery, though successful for a while, will come to grief in the end. To heighten the effect of his scoundrel, Smollett develops parallel with him the virtuous Count de Melvil. The author\'s scheme of thus using one character as the foil of another, though not conspicuous for its originality, shows a decided advance in the theory of constructive technique. Only, as I have said, Smollett\'s execution is now defective. "But," one will naturally ask, "if Fathom lacks the amusing, and not infrequently stimulating, hurly-burly of Smollett\'s former novels; if its characters, though well-conceived, are seldom divertingly fantastic and never thoroughly animate; what makes the book interesting?" The surprise will be greater than ever when the answer is given that, to a large extent, the plot makes Fathom interesting. Yes, Smollett, hitherto indifferent to structure, has here written a story in which the plot itself, often clumsy though it may be, engages a reader\'s attention. One actually wants to know whether the young Count is ever going to receive consolation for his sorrows and inflict justice on his basely ungrateful pensioner. And when, finally, all turns out as it should, one is amazed to find how many of the people in the book have helped towards the designed conclusion. Not all of them, indeed, nor all of the adventures, are indispensable, but it is manifest at the end that much, which, for the time, most readers think irrelevant—such as Don Diego\'s history—is, after all, essential. It has already been said that in Count Fathom Smollett appears to some extent as a romanticist, and this is another fact which lends interest to the book. That he had a powerful imagination is not a surprise. Any one versed in Smollett has already seen it in the remarkable situations which he has put before us in his earlier works. These do not indicate, however, that Smollett possessed the imagination which could excite romantic interest; for in Roderick Random and in Peregrine Pickle, the wonderful situations serve chiefly to amuse. In Fathom, however, there are some designed to excite horror; and one, at least, is eminently successful. The hero\'s night in the wood between Bar-le-duc and Chalons was no doubt more blood-curdling to our eighteenth-century ancestors than it is to us, who have become acquainted with scores of similar situations in the small number of exciting romances which belong to literature, and in the greater number which do not. Still, even to-day, a reader, with his taste jaded by trashy novels, will be conscious of Smollett\'s power, and of several thrills, likewise, as he reads about Fathom\'s experience in the loft in which the beldame locks him to pass the night. This situation is melodramatic rather than romantic, as the word is used technically in application to eighteenth and nineteenth-century literature. There is no little in Fathom, however, which is genuinely romantic in the latter sense. Such is the imprisonment of the Countess in the castle-tower, whence she waves her handkerchief to the young Count, her son and would-be rescuer. And especially so is the scene in the church, when Renaldo (the very name is romantic) visits at midnight the supposed grave of his lady-love. While he was waiting for the sexton to open the door, his "soul . . . was wound up to the highest pitch of enthusiastic sorrow. The uncommon darkness, . . . the solemn silence, and lonely situation of the place, conspired with the occasion of his coming, and the dismal images of his fancy, to produce a real rapture of gloomy expectation, which the whole world could not have persuaded him to disappoint. The clock struck twelve, the owl screeched from the ruined battlement, the door was opened by the sexton, who, by the light of a glimmering taper, conducted the despairing lover to a dreary aisle, and stamped upon the ground with his foot, saying, \'Here the young lady lies interred.\'" We have here such an amount of the usual romantic machinery of the "grave-yard" school of poets—that school of which Professor W. L. Phelps calls Young, in his Night Thoughts, the most "conspicuous exemplar"—that one is at first inclined to think Smollett poking fun at it. The context, however, seems to prove that he was perfectly serious. It is interesting, then, as well as surprising, to find traces of the romantic spirit in his fiction over ten years before Walpole\'s Castle of Otranto. It is also interesting to find so much melodramatic feeling in him, because it makes stronger the connection between him and his nineteenth-century disciple, Dickens. From all that I have said, it must not be thought that the usual Smollett is always, or almost always, absent from Count Fathom. I have spoken of the dedication and of the opening chapters as what we might expect from his pen. There are, besides, true Smollett strokes in the scenes in the prison from which Melvil rescues Fathom, and there is a good deal of the satirical Smollett fun in the description of Fathom\'s ups and downs, first as the petted beau, and then as the fashionable doctor. In chronicling the latter meteoric career, Smollett had already observed the peculiarity of his countrymen which Thackeray was fond of harping on in the next century—"the maxim which universally prevails among the English people . . . to overlook, . . . on their return to the metropolis, all the connexions they may have chanced to acquire during their residence at any of the medical wells. And this social disposition is so scrupulously maintained, that two persons who live in the most intimate correspondence at Bath or Tunbridge, shall, in four-and-twenty hours . . . meet in St. James\'s Park, without betraying the least token of recognition." And good, too, is the way in which, as Dr. Fathom goes rapidly down the social hill, he makes excuses for his declining splendour. His chariot was overturned "with a hideous crash" at such danger to himself, "that he did not believe he should ever hazard himself again in any sort of wheel carriage." He turned off his men for maids, because "men servants are generally impudent, lazy, debauched, or dishonest." To avoid the din of the street, he shifted his lodgings into a quiet, obscure court. And so forth and so on, in the true Smollett vein. But, after all, such of the old sparks are struck only occasionally. Apart from its plot, which not a few nineteenth-century writers of detective-stories might have improved, The Adventures of Ferdinand Count Fathom is less interesting for itself than any other piece of fiction from Smollett\'s pen. For a student of Smollett, however, it is highly interesting as showing the author\'s romantic, melodramatic tendencies, and the growth of his constructive technique. G. H. MAYNADIER THE ADVENTURES OF FERDINAND COUNT FATHOM TO DOCTOR ——— You and I, my good friend, have often deliberated on the difficulty of writing such a dedication as might gratify the self-complacency of a patron, without exposing the author to the ridicule or censure of the public; and I think we generally agreed that the task was altogether impracticable.—Indeed, this was one of the few subjects on which we have always thought in the same manner. For, notwithstanding that deference and regard which we mutually pay to each other, certain it is, we have often differed, according to the predominancy of those different passions, which frequently warp the opinion, and perplex the understanding of the most judicious. In dedication, as in poetry, there is no medium; for, if any one of the human virtues be omitted in the enumeration of the patron\'s good qualities, the whole address is construed into an affront, and the writer has the mortification to find his praise prostituted to very little purpose. On the other hand, should he yield to the transports of gratitude or affection, which is always apt to exaggerate, and produce no more than the genuine effusions of his heart, the world will make no allowance for the warmth of his passion, but ascribe the praise he bestows to interested views and sordid adulation. Sometimes too, dazzled by the tinsel of a character which he has no opportunity to investigate, he pours forth the homage of his admiration upon some false Maecenas, whose future conduct gives the lie to his eulogium, and involves him in shame and confusion of face. Such was the fate of a late ingenious author [ the Author of the "Seasons"], who was so often put to the blush for the undeserved incense he had offered in the heat of an enthusiastic disposition, misled by popular applause, that he had resolved to retract, in his last will, all the encomiums which he had thus prematurely bestowed, and stigmatise the unworthy by name—a laudable scheme of poetical justice, the execution of which was fatally prevented by untimely death. Whatever may have been the fate of other dedicators, I, for my own part, sit down to write this address, without any apprehension of disgrace or disappointment; because I know you are too well convinced of my affection and sincerity to repine at what I shall say touching your character and conduct. And you will do me the justice to believe, that this public distinction is a testimony of my particular friendship and esteem. Not that I am either insensible of your infirmities, or disposed to conceal them from the notice of mankind. There are certain foibles which can only be cured by shame and mortification; and whether or not yours be of that species, I shall have the comfort to think my best endeavours were used for your reformation. Know then, I can despise your pride, while I honour your integrity, and applaud your taste, while I am shocked at your ostentation.—I have known you trifling, superficial, and obstinate in dispute; meanly jealous and awkwardly reserved; rash and haughty in your resentments; and coarse and lowly in your connexions. I have blushed at the weakness of your conversation, and trembled at the errors of your conduct—yet, as I own you possess certain good qualities, which overbalance these defects, and distinguish you on this occasion as a person for whom I have the most perfect attachment and esteem, you have no cause to complain of the indelicacy with which your faults are reprehended. And as they are chiefly the excesses of a sanguine disposition and looseness of thought, impatient of caution or control, you may, thus stimulated, watch over your own intemperance and infirmity with redoubled vigilance and consideration, and for the future profit by the severity of my reproof. These, however, are not the only motives that induce me to trouble you with this public application. I must not only perform my duty to my friends, but also discharge the debt I owe to my own interest. We live in a censorious age; and an author cannot take too much precaution to anticipate the prejudice, misapprehension, and temerity of malice, ignorance, and presumption. I therefore think it incumbent upon me to give some previous intimation of the plan which I have executed in the subsequent performance, that I may not be condemned upon partial evidence; and to whom can I with more propriety appeal in my explanation than to you, who are so well acquainted with all the sentiments and emotions of my breast? A novel is a large diffused picture, comprehending the characters of life, disposed in different groups, and exhibited in various attitudes, for the purposes of an uniform plan, and general occurrence, to which every individual figure is subservient. But this plan cannot be executed with propriety, probability, or success, without a principal personage to attract the attention, unite the incidents, unwind the clue of the labyrinth, and at last close the scene, by virtue of his own importance. Almost all the heroes of this kind, who have hitherto succeeded on the English stage, are characters of transcendent worth, conducted through the vicissitudes of fortune, to that goal of happiness, which ever ought to be the repose of extraordinary desert.—Yet the same principle by which we rejoice at the remuneration of merit, will teach us to relish the disgrace and discomfiture of vice, which is always an example of extensive use and influence, because it leaves a deep impression of terror upon the minds of those who were not confirmed in the pursuit of morality and virtue, and, while the balance wavers, enables the right scale to preponderate. In the drama, which is a more limited field of invention, the chief personage is often the object of our detestation and abhorrence; and we are as well pleased to see the wicked schemes of a Richard blasted, and the perfidy of a Maskwell exposed, as to behold a Bevil happy, and an Edward victorious. The impulses of fear, which is the most violent and interesting of all the passions, remain longer than any other upon the memory; and for one that is allured to virtue, by the contemplation of that peace and happiness which it bestows, a hundred are deterred from the practice of vice, by that infamy and punishment to which it is liable, from the laws and regulations of mankind. Let me not, therefore, be condemned for having chosen my principal character from the purlieus of treachery and fraud, when I declare my purpose is to set him up as a beacon for the benefit of the unexperienced and unwary, who, from the perusal of these memoirs, may learn to avoid the manifold snares with which they are continually surrounded in the paths of life; while those who hesitate on the brink of iniquity may be terrified from plunging into that irremediable gulf, by surveying the deplorable fate of Ferdinand Count Fathom. That the mind might not be fatigued, nor the imagination disgusted, by a succession of vicious objects, I have endeavoured to refresh the attention with occasional incidents of a different nature; and raised up a virtuous character, in opposition to the adventurer, with a view to amuse the fancy, engage the affection, and form a striking contrast which might heighten the expression, and give a relief to the moral of the whole. If I have not succeeded in my endeavours to unfold the mysteries of fraud, to instruct the ignorant, and entertain the vacant; if I have failed in my attempts to subject folly to ridicule, and vice to indignation; to rouse the spirit of mirth, wake the soul of compassion, and touch the secret springs that move the heart; I have, at least, adorned virtue with honour and applause, branded iniquity with reproach and shame, and carefully avoided every hint or expression which could give umbrage to the most delicate reader—circumstances which (whatever may be my fate with the public) will with you always operate in favour of, Dear sir, your very affectionate friend and servant, THE AUTHOR. CHAPTER ONE SOME SAGE OBSERVATIONS THAT NATURALLY INTRODUCE OUR IMPORTANT HISTORY. Cardinal de Retz very judiciously observes, that all historians must of necessity be subject to mistakes, in explaining the motives of those actions they record, unless they derive their intelligence from the candid confession of the person whose character they represent; and that, of consequence, every man of importance ought to write his own memoirs, provided he has honesty enough to tell the truth, without suppressing any circumstance that may tend to the information of the reader. This, however, is a requisite that, I am afraid, would be very rarely found among the number of those who exhibit their own portraits to the public. Indeed, I will venture to say, that, how upright soever a man\'s intentions may be, he will, in the performance of such a task, be sometimes misled by his own phantasy, and represent objects, as they appeared to him, through the mists of prejudice and passion. An unconcerned reader, when he peruses the history of two competitors, who lived two thousand years ago, or who perhaps never had existence, except in the imagination of the author, cannot help interesting himself in the dispute, and espousing one side of the contest, with all the zeal of a warm adherent. What wonder, then, that we should be heated in our own concerns, review our actions with the same self-approbation that they had formerly acquired, and recommend them to the world with all the enthusiasm of paternal affection? Supposing this to be the case, it was lucky for the cause of historical truth, that so many pens have been drawn by writers, who could not be suspected of such partiality; and that many great personages, among the ancients as well as moderns, either would not or could not entertain the public with their own memoirs. From this want of inclination or capacity to write, in our hero himself, the undertaking is now left to me, of transmitting to posterity the remarkable adventures of FERDINAND COUNT FATHOM; and by the time the reader shall have glanced over the subsequent sheets, I doubt not but he will bless God that the adventurer was not his own historian. This mirror of modern chivalry was none of those who owe their dignity to the circumstances of their birth, and are consecrated from the cradle for the purposes of greatness, merely because they are the accidental children of wealth. He was heir to no visible patrimony, unless we reckon a robust constitution, a tolerable appearance, and an uncommon capacity, as the advantages of inheritance. If the comparison obtains in this point of consideration, he was as much as any man indebted to his parent; and pity it was, that, in the sequel of his fortune, he never had an opportunity of manifesting his filial gratitude and regard. From this agreeable act of duty to his sire, and all those tendernesses that are reciprocally enjoyed betwixt the father and the son, he was unhappily excluded by a small circumstance; at which, however, he was never heard to repine. In short, had he been brought forth in the fabulous ages of the world, the nature of his origin might have turned to his account; he might, like other heroes of antiquity, have laid claim to divine extraction, without running the risk of being claimed by an earthly father. Not that his parents had any reason to disown or renounce their offspring, or that there was anything preternatural in the circumstances of his generation and birth; on the contrary, he was, from the beginning, a child of promising parts, and in due course of nature ushered into the world amidst a whole cloud of witnesses. But, that he was acknowledged by no mortal sire, solely proceeded from the uncertainty of his mother, whose affections were so dissipated among a number of admirers, that she could never pitch upon the person from whose loins our hero sprung. Over and above this important doubt under which he was begotten, other particularities attended his birth, and seemed to mark him out as something uncommon among the sons of men. He was brought forth in a waggon, and might be said to be literally a native of two different countries; for, though he first saw the light in Holland, he was not born till after the carriage arrived in Flanders; so that, all these extraordinary circumstances considered, the task of determining to what government he naturally owed allegiance, would be at least as difficult as that of ascertaining the so much contested birthplace of Homer. Certain it is, the Count\'s mother was an Englishwoman, who, after having been five times a widow in one campaign, was, in the last year of the renowned Marlborough\'s command, numbered among the baggage of the allied army, which she still accompanied, through pure benevolence of spirit, supplying the ranks with the refreshing streams of choice Geneva, and accommodating individuals with clean linen, as the emergency of their occasions required. Nor was her philanthropy altogether confined to such ministration; she abounded with "the milk of human kindness," which flowed plentifully among her fellow-creatures; and to every son of Mars who cultivated her favour, she liberally dispensed her smiles, in order to sweeten the toils and dangers of the field. And here it will not be amiss to anticipate the remarks of the reader, who, in the chastity and excellency of his conception, may possibly exclaim, "Good Heaven! will these authors never reform their imaginations, and lift their ideas from the obscene objects of low life? Must the public be again disgusted with the grovelling adventures of a waggon? Will no writer of genius draw his pen in the vindication of taste, and entertain us with the agreeable characters, the dignified conversation, the poignant repartee, in short, the genteel comedy of the polite world?" Have a little patience, gentle, delicate, sublime critic; you, I doubt not, are one of those consummate connoisseurs, who, in their purifications, let humour evaporate, while they endeavour to preserve decorum, and polish wit, until the edge of it is quite worn off. Or, perhaps, of that class, who, in the sapience of taste, are disgusted with those very flavours in the productions of their own country which have yielded infinite delectation to their faculties, when imported from another clime; and d—n an author in despite of all precedent and prescription;—who extol the writings of Petronius Arbiter, read with rapture the amorous sallies of Ovid\'s pen, and chuckle over the story of Lucian\'s ass; yet, if a modern author presumes to relate the progress of a simple intrigue, are shocked at the indecency and immorality of the scene;—who delight in following Guzman d\'Alfarache, through all the mazes of squalid beggary; who with pleasure accompany Don Quixote and his squire, in the lowest paths of fortune; who are diverted with the adventures of Scarron\'s ragged troop of strollers, and highly entertained with the servile situations of Gil Blas; yet, when a character in humble life occasionally occurs in a performance of our own growth, exclaim, with an air of disgust, "Was ever anything so mean! sure, this writer must have been very conversant with the lowest scenes of life;"—who, when Swift or Pope represents a coxcomb in the act of swearing, scruple not to laugh at the ridiculous execrations; but, in a less reputed author, condemn the use of such profane expletives;—who eagerly explore the jakes of Rabelais, for amusement, and even extract humour from the dean\'s description of a lady\'s dressing-room; yet in a production of these days, unstamped with such venerable names, will stop their noses, with all the signs of loathing and abhorrence, at a bare mention of the china chamber-pot;—who applauded Catullus, Juvenal, Persius, and Lucan, for their spirit in lashing the greatest names of antiquity; yet, when a British satirist, of this generation, has courage enough to call in question the talents of a pseudo-patron in power, accuse him of insolence, rancour, and scurrility. If such you be, courteous reader, I say again, have a little patience; for your entertainment we are about to write. Our hero shall, with all convenient despatch, be gradually sublimed into those splendid connexions of which you are enamoured; and God forbid, that, in the meantime, the nature of his extraction should turn to his prejudice in a land of freedom like this, where individuals are every day ennobled in consequence of their own qualifications, without the least retrospective regard to the rank or merit of their ancestors. Yes, refined reader, we are hastening to that goal of perfection, where satire dares not show her face; where nature is castigated, almost even to still life; where humour turns changeling, and slavers in an insipid grin; where wit is volatilised into a mere vapour; where decency, divested of all substance, hovers about like a fantastic shadow; where the salt of genius, escaping, leaves nothing but pure and simple phlegm; and the inoffensive pen for ever drops the mild manna of soul-sweetening praise. CHAPTER TWO A SUPERFICIAL VIEW OF OUR HERO\'S INFANCY. Having thus bespoken the indulgence of our guests, let us now produce the particulars of our entertainment, and speedily conduct our adventurer through the stage of infancy, which seldom teems with interesting incidents. As the occupations of his mother would not conveniently permit her to suckle this her firstborn at her own breast, and those happy ages were now no more, in which the charge of nursing a child might be left to the next goat or she-wolf, she resolved to improve upon the ordinances of nature, and foster him with a juice much more energetic than the milk of goat, wolf, or woman; this was no other than that delicious nectar, which, as we have already hinted, she so cordially distributed from a small cask that hung before her, depending from her shoulders by a leathern zone. Thus determined, ere he was yet twelve days old, she enclosed him in a canvas knapsack, which being adjusted to her neck, fell down upon her back, and balanced the cargo that rested on her bosom. There are not wanting those who affirm, that, while her double charge was carried about in this situation, her keg was furnished with a long and slender flexible tube, which, when the child began to be clamorous, she conveyed into his mouth, and straight he stilled himself with sucking; but this we consider as an extravagant assertion of those who mix the marvellous in all their narrations, because we cannot conceive how the tender organs of an infant could digest such a fiery beverage, which never fails to discompose the constitutions of the most hardy and robust. We therefore conclude that the use of this potation was more restrained, and that it was with simple element diluted into a composition adapted to his taste and years. Be this as it will, he certainly was indulged in the use of it to such a degree as would have effectually obstructed his future fortune, had not he been happily cloyed with the repetition of the same fare, for which he conceived the utmost detestation and abhorrence, rejecting it with loathing and disgust, like those choice spirits, who, having been crammed with religion in their childhood, renounce it in their youth, among other absurd prejudices of education. While he was thus dangled in a state of suspension, a German trooper was transiently smit with the charms of his mother, who listened to his honourable addresses, and once more received the silken bonds of matrimony; the ceremony having been performed as usual at the drum-head. The lady had no sooner taken possession of her new name, than she bestowed it upon her son, who was thenceforward distinguished by the appellation of Ferdinand de Fadom; nor was the husband offended at this presumption in his wife, which he not only considered as a proof of her affection and esteem, but also as a compliment, by which he might in time acquire the credit of being the real father of such a hopeful child. Notwithstanding this new engagement with a foreigner, our hero\'s mother still exercised the virtues of her calling among the English troops, so much was she biassed by that laudable partiality, which, as Horace observes, the natale solum generally inspires. Indeed this inclination was enforced by another reason, that did not fail to influence her conduct in this particular; all her knowledge of the High Dutch language consisted in some words of traffic absolutely necessary for the practice of hex vocation, together with sundry oaths and terms of reproach, that kept her customers in awe; so that, except among her own countrymen, she could not indulge that propensity to conversation, for which she had been remarkable from her earliest years. Nor did this instance of her affection fail of turning to her account in the sequel. She was promoted to the office of cook to a regimental mess of officers; and, before the peace of Utrecht, was actually in possession of a suttling-tent, pitched for the accommodation of the gentlemen in the army. Meanwhile, Ferdinand improved apace in the accomplishments of infancy; his beauty was conspicuous, and his vigour so uncommon, that he was with justice likened unto Hercules in the cradle. The friends of his father-in-law dandled him on their knees, while he played with their whiskers, and, before he was thirteen months old, taught him to suck brandy impregnated with gunpowder, through the touch-hole of a pistol. At the same time, he was caressed by divers serjeants of the British army, who severally and in secret contemplated his qualifications with a father\'s pride, excited by the artful declaration with which the mother had flattered each apart. Soon as the war was (for her unhappily) concluded, she, as in duty bound, followed her husband into Bohemia; and his regiment being sent into garrison at Prague, she opened a cabaret in that city, which was frequented by a good many guests of the Scotch and Irish nations, who were devoted to the exercise of arms in the service of the Emperor. It was by this communication that the English tongue became vernacular to young Ferdinand, who, without such opportunity, would have been a stranger to the language of his forefathers, in spite of all his mother\'s loquacity and elocution; though it must be owned, for the credit of her maternal care, that she let slip no occasion of making it familiar to his ear and conception; for, even at those intervals in which she could find no person to carry on the altercation, she used to hold forth in earnest soliloquies upon the subject of her own situation, giving vent to many opprobrious invectives against her husband\'s country, between which and Old England she drew many odious comparisons; and prayed, without ceasing, that Europe might speedily be involved in a general war, so as that she might have some chance of re-enjoying the pleasures and emoluments of a Flanders campaign. CHAPTER THREE HE IS INITIATED IN A MILITARY LIFE, AND HAS THE GOOD FORTUNE TO ACQUIRE A GENEROUS PATRON. While she wearied Heaven with these petitions, the flame of war broke out betwixt the houses of Ottoman and Austria, and the Emperor sent forth an army into Hungary, under the auspices of the renowned Prince Eugene. On account of this expedition, the mother of our hero gave up housekeeping, and cheerfully followed her customers and husband into the field; having first provided herself with store of those commodities in which she had formerly merchandised. Although the hope of profit might in some measure affect her determination, one of the chief motives for her visiting the frontiers of Turkey, was the desire of initiating her son in the rudiments of his education, which she now thought high time to inculcate, he being, at this period, in the sixth year of his age; he was accordingly conducted to the camp, which she considered as the most consummate school of life, and proposed for the scene of his instruction; and in this academy he had not continued many weeks, when he was an eye-witness of that famous victory, which, with sixty thousand men, the Imperial general obtained over an army of one hundred and fifty thousand Turks. His father-in-law was engaged, and his mother would not be idle on this occasion. She was a perfect mistress of all the camp qualifications, and thought it a duty incumbent on her to contribute all that lay in her power towards distressing the enemy. With these sentiments she hovered about the skirts of the army, and the troops were no sooner employed in the pursuit, than she began to traverse the field of battle with a poignard and a bag, in order to consult her own interest, annoy the foe, and exercise her humanity at the same time. In short, she had, with amazing prowess, delivered some fifty or threescore disabled Mussulmen of the pain under which they groaned, and made a comfortable booty of the spoils of the slain, when her eyes were attracted by the rich attire of an Imperial officer, who lay bleeding on the plain, to all appearance in the agonies of death. She could not in her heart refuse that favour to a friend and Christian she had so compassionately bestowed upon so many enemies and infidels, and therefore drew near with the sovereign remedy, which she had already administered with such success. As she approached this deplorable object of pity, her ears were surprised with an ejaculation in the English tongue, which he fervently pronounced, though with a weak and languid voice, recommending his soul to God, and his family to the protection of Heaven. Our Amazon\'s purpose was staggered by this providential incident; the sound of her native language, so unexpectedly heard, and so pathetically delivered, had a surprising effect upon her imagination; and the faculty of reflection did not forsake her in such emergency. Though she could not recollect the features of this unhappy officer, she concluded, from his appearance, that he was some person of distinction in the service, and foresaw greater advantage to herself in attempting to preserve his life, than she could possibly reap from the execution of her first resolve. "If," said she to herself, "I can find means of conveying him to his tent alive, he cannot but in conscience acknowledge my humanity with some considerable recompense; and, should he chance to survive his wounds, I have everything to expect from his gratitude and power." Fraught with these prudential suggestions, she drew near the unfortunate stranger, and, in a softened accent of pity and condolence, questioned him concerning his name, condition, and the nature of his mischance, at the same time making a gentle tender of her service. Agreeably surprised to hear himself accosted in such a manner, by a person whose equipage seemed to promise far other designs, he thanked her in the most grateful terms for her humanity, with the appellation of kind countrywoman; gave her to understand that he was colonel of a regiment of horse; that he had fallen in consequence of a shot he received in his breast at the beginning of the action; and, finally, entreated her to procure some carriage on which he might be removed to his tent. Perceiving him faint and exhausted with loss of blood, she raised up his head, and treated him with that cordial which was her constant companion. At that instant, espying a small body of hussars returning to the camp with the plunder they had taken, she invoked their assistance, and they forthwith carried the officer to his own quarters, where his wound was dressed, and his preserver carefully tended him until his recovery was completed. In return for these good offices, this gentleman, who was originally of Scotland, rewarded her for the present with great liberality, assured her of his influence in promoting her husband, and took upon himself the charge of young Ferdinand\'s education; the boy was immediately taken into his protection, and entered as a trooper in his own regiment; but his good intentions towards his father-in-law were frustrated by the death of the German, who, in a few days after this disposition, was shot in the trenches before Temiswaer. This event, over and above the conjugal affliction with which it invaded the lady\'s quiet, would have involved her in infinite difficulty and distress, with regard to her temporal concerns, by leaving her unprotected in the midst of strangers, had not she been thus providentially supplied with an effectual patron in the colonel, who was known by the appellation of Count Melvil. He no sooner saw her, by the death of her husband, detached from all personal connexions with a military life, than he proposed that she should quit her occupation in the camp, and retire to his habitation in the city of Presburg, where she would be entertained in ease and plenty during the remaining part of her natural life. With all due acknowledgments of his generosity, she begged to be excused from embracing his proposal, alleging she was so much accustomed to her present way of life, and so much devoted to the service of the soldiery, that she should never be happy in retirement, while the troops of any prince in Christendom kept the field. The Count, finding her determined to prosecute her scheme, repeated his promise of befriending her upon all occasions; and in the meantime admitted Ferdinand into the number of his domestics, resolving that he should be brought up in attendance upon his own son, who was a boy of the same age. He kept him, however, in his tent, until he should have an opportunity of revisiting his family in person; and, before that occasion offered, two whole years elapsed, during which the illustrious Prince Eugene gained the celebrated battle of Belgrade, and afterwards made himself master of that important frontier. CHAPTER FOUR HIS MOTHER\'S PROWESS AND DEATH; TOGETHER WITH SOME INSTANCES OF HIS OWN SAGACITY. It would have been impossible for the mother of our adventurer, such as she hath been described, to sit quietly in her tent, while such an heroic scene was acting. She was no sooner apprised of the general\'s intention to attack the enemy, than she, as usual, packed up her moveables in a waggon, which she committed to the care of a peasant in the neighbourhood, and put herself in motion with the troops; big with the expectation of re-acting that part in which she had formerly acquitted herself so much to her advantage.—Nay, she by this time looked upon her own presence as a certain omen of success to the cause which she espoused; and, in their march to battle, actually encouraged the ranks with repeated declarations, importing, that she had been eye-witness of ten decisive engagements, in all of which her friends had been victorious, and imputing such uncommon good fortune to some supernatural quality inherent in her person. Whether or not this confidence contributed to the fortune of the day, by inspiring the soldiers to an uncommon pitch of courage and resolution, I shall not pretend to determine. But, certain it is, the victory began from that quarter in which she had posted herself; and no corps in the army behaved with such intrepidity as that which was manifested by those who were favoured with her admonitions and example; for she not only exposed her person to the enemy\'s fire, with the indifference and deliberation of a veteran, but she is said to have achieved a very conspicuous exploit by the prowess of her single arm. The extremity of the line to which she had attached herself, being assaulted in flank by a body of the spahis, wheeled about, in order to sustain the charge, and received them with such a seasonable fire, as brought a great number of turbans to the ground; among those who fell, was one of the chiefs or agas, who had advanced before the rest, with a view to signalise his valour. Our English Penthesilea no sooner saw this Turkish leader drop, than, struck with the magnificence of his own and horse\'s trappings, she sprung forward to seize them as her prize, and found the aga not dead, though in a good measure disabled by his misfortune, which was entirely owing to the weight of his horse, that, having been killed by a musket-ball, lay upon his leg, so that he could not disengage himself. Nevertheless, perceiving the virago approach with fell intent, he brandished his symitar, and tried to intimidate his assailant with a most horrible exclamation; but it was not the dismal yell of a dismounted cavalier, though enforced with a hideous ferocity of countenance, and the menacing gestures with which he waited her approach, that could intimidate such an undaunted she-campaigner; she saw him writhing in the agonies of a situation from which he could not move; and, running towards him with the nimbleness and intrepidity of a Camilla, described a semicircle in the progress of her assault, and attacking him on one side, plunged her well-tried dagger in his throat. The shades of death encompassed him, his life-blood issued at the wound, he fell prone upon the earth, he bit the dust, and having thrice invoked the name of Allah! straight expired. While his destiny was thus fulfilled, his followers began to reel; they seemed dismayed at the fate of their chief, beheld their companions drop like the leaves in autumn, and suddenly halted in the midst of their career. The Imperialists, observing the confusion of the enemy, redoubled their fire; and, raising a dreadful shout, advanced in order to improve the advantage they had gained. The spahis durst not wait the shock of such an encounter; they wheeled to the right-about, and clapping spurs to their horses, fled in the utmost disorder. This was actually the circumstance that turned the scale of battle. The Austrians pursued their good fortune with uncommon impetuosity, and in a few minutes left the field clear for the mother of our hero, who was such an adept in the art of stripping, that in the twinkling of an eye the bodies of the aga and his Arabian lay naked to the skin. It would have been happy for her, had she been contented with these first-fruits, reaped from the fortune of the day, and retired with her spoils, which were not inconsiderable; but, intoxicated with the glory she had won, enticed by the glittering caparisons that lay scattered on the plain, and without doubt prompted by the secret instinct of her fate, she resolved to seize opportunity by the forelock, and once for all indemnify herself for the many fatigues, hazards, and sorrows she had undergone. Thus determined, she reconnoitred the field, and practised her address so successfully, that in less than half an hour she was loaded with ermine and embroidery, and disposed to retreat with her burden, when her regards were solicited by a splendid bundle, which she descried at some distance lying on the ground. This was no other than an unhappy officer of hussars; who, after having the good fortune to take a Turkish standard, was desperately wounded in the thigh, and obliged to quit his horse; finding himself in such a helpless condition, he had wrapped his acquisition round his body, that whatever might happen, he and his glory should not be parted; and thus shrouded, among the dying and the dead, he had observed the progress of our heroine, who stalked about the field, like another Atropos, finishing, wherever she came, the work of death. He did not at all doubt, that he himself would be visited in the course of her peregrinations, and therefore provided for her reception, with a pistol ready cocked in his hand, while he lay perdue beneath his covert, in all appearance bereft of life. He was not deceived in his prognostic; she no sooner eyed the golden crescent than, inflamed with curiosity or cupidity, she directed thitherward her steps, and discerning the carcase of a man, from which, she thought, there would be a necessity for disengaging it, she lifted up her weapon, in order to make sure of her purchase; and in the very instant of discharging her blow, received a brace of bullets in her brain. Thus ended the mortal pilgrimage of this modern Amazon; who, in point of courage, was not inferior to Semiramis, Tomyris, Zenobia, Thalestris, or any boasted heroine of ancient times. It cannot be supposed that this catastrophe made a very deep impression upon the mind of young Ferdinand, who had just then attained the ninth year of his age, and been for a considerable time weaned from her maternal caresses; especially as he felt no wants nor grievances in the family of the Count, who favoured him with a particular share of indulgence, because he perceived in him a spirit of docility, insinuation, and sagacity, far above his years. He did not, however, fail to lament the untimely fate of his mother, with such filial expressions of sorrow, as still more intimately recommended him to his patron; who, being himself a man of extraordinary benevolence, looked upon the boy as a prodigy of natural affection, and foresaw in his future services a fund of gratitude and attachment, that could not fail to render him a valuable acquisition to his family. In his own country, he had often seen connexions of that sort, which having been planted in the infancy of the adherent, had grown up to a surprising pitch of fidelity and friendship, that no temptation could bias, and no danger dissolve. He therefore rejoiced in the hope of seeing his own son accommodated with such a faithful attendant, in the person of young Fathom, on whom he resolved to bestow the same education he had planned for the other, though conveyed in such a manner as should be suitable to the sphere in which he was ordained to move. In consequence of these determinations, our young adventurer led a very easy life, in quality of page to the Count, in whose tent he lay upon a pallet, close to his field-bed, and often diverted him with his childish prattle in the English tongue, which the more seldom his master had occasion to speak, he the more delighted to hear. In the exercise of his function, the boy was incredibly assiduous and alert; far from neglecting the little particulars of his duty, and embarking in the mischievous amusements of the children belonging to the camp, he was always diligent, sedate, agreeably officious and anticipating; and in the whole of his behaviour seemed to express the most vigilant sense of his patron\'s goodness and generosity; nay, to such a degree had these sentiments, in all appearance, operated upon his reflection, that one morning, while he supposed the Count asleep, he crept softly to his bedside, and gently kissing his hand, which happened to be uncovered, pronounced, in a low voice, a most fervent prayer in his behalf, beseeching Heaven to shower down blessings upon him, as the widow\'s friend and the orphan\'s father. This benediction was not lost upon the Count, who chanced to be awake, and heard it with admiration; but what riveted Ferdinand in his good graces, was a discovery that our youth made, while his master was upon duty in the trenches before Belgrade. Two foot soldiers, standing sentry near the door of the tent, were captivated with the sight of some valuable moveables belonging to it; and supposing, in their great wisdom, that the city of Belgrade was too well fortified to be taken during that campaign, they came to a resolution of withdrawing themselves from the severe service of the trenches, by deserting to the enemy, after they should have rifled Count Melvil\'s tent of the furniture by which they were so powerfully allured. The particulars of this plan were concerted in the French language, which, they imagined, would screen them from all risk of being detected, in case they should be overheard, though, as there was no living creature in sight, they had no reason to believe that any person was privy to their conversation. Nevertheless, they were mistaken in both these conjectures. The conference reached the ears of Fathom, who was at the other end of the tent, and had perceived the eager looks with which they considered some parts of the furniture. He had penetration enough to suspect their desire, and, alarmed by that suspicion, listened attentively to their discourse; which, from a slender knowledge in the French tongue, he had the good fortune partly to understand. This important piece of intelligence he communicated to the Count at his return, and measures were immediately taken to defeat the design, and make an example of the authors, who being permitted to load themselves with the booty, were apprehended in their retreat, and punished with death according to their demerits. CHAPTER FIVE A BRIEF DETAIL OF HIS EDUCATION. Nothing could have more seasonably happened to confirm the good opinion which the colonel entertained of Ferdinand\'s principles. His intentions towards the boy grew every day more and more warm; and, immediately after the peace of Passarowitz, he retired to his own house at Presburg, and presented young Fathom to his lady, not only as the son of a person to whom he owed his life, but also as a lad who merited his peculiar protection and regard by his own personal virtue. The Countess, who was an Hungarian, received him with great kindness and affability, and her son was ravished with the prospect of enjoying such a companion. In short, fortune seemed to have provided for him an asylum, in which he might be safely trained up, and suitably prepared for more important scenes of life than any of his ancestors had ever known. He was not, in all respects, entertained on the footing of his young master; yet he shared in all his education and amusements, as one whom the old gentleman was fully determined to qualify for the station of an officer in the service; and, if he did not eat with the Count, he was every day regaled with choice bits from his table; holding, as it were, a middle place between the rank of a relation and favourite domestic. Although his patron maintained a tutor in the house, to superintend the conduct of his heir, he committed the charge of his learning to the instructions of a public school; where he imagined the boy would imbibe a laudable spirit of emulation among his fellows, which could not fail of turning out to the advantage of his education. Ferdinand was entered in the same academy; and the two lads proceeded equally in the paths of erudition; a mutual friendship and intimacy soon ensued, and, notwithstanding the levity and caprice commonly discernible in the behaviour of such boys, very few or rather no quarrels happened in the course of their communication. Yet their dispositions were altogether different, and their talents unlike. Nay, this dissimilarity was the very bond of their union; because it prevented that jealousy and rivalship which often interrupts the harmony of two warm contemporaries. The young Count made extraordinary progress in the exercises of the school, though he seemed to take very little pains in the cultivation of his studies; and became a perfect hero in all the athletic diversions of his fellow-scholars; but, at the same time, exhibited such a bashful appearance and uncouth address, that his mother despaired of ever seeing him improved into any degree of polite behaviour. On the other hand, Fathom, who was in point of learning a mere dunce, became, even in his childhood, remarkable among the ladies for his genteel deportment and vivacity; they admired the proficiency he made under the directions of his dancing-master, the air with which he performed his obeisance at his entrance and exit; and were charmed with the agreeable assurance and lively sallies of his conversation; while they expressed the utmost concern and disgust at the boorish demeanour of his companion, whose extorted bows resembled the pawings of a mule, who hung his head in silence like a detected sheep-stealer, who sat in company under the most awkward expressions of constraint, and whose discourse never exceeded the simple monosyllables of negation and assent. In vain did all the females of the family propose to him young Fathom, as a pattern and reproach. He remained unaltered by all their efforts and expostulations, and allowed our adventurer to enjoy the triumph of his praise, while he himself was conscious of his own superiority in those qualifications which seemed of more real importance than the mere exteriors and forms of life. His present ambition was not to make a figure at his father\'s table, but to eclipse his rivals at school, and to acquire an influence and authority among these confederates. Nevertheless, Fathom might possibly have fallen under his displeasure or contempt, had not that pliant genius found means to retain his friendship by seasonable compliances and submission; for the sole study, or at least the chief aim of Ferdinand, was to make himself necessary and agreeable to those on whom his dependence was placed. His talent was in this particular suited to his inclination; he seemed to have inherited it from his mother\'s womb; and, without all doubt, would have raised upon it a most admirable superstructure of fortune and applause, had not it been inseparably yoked with a most insidious principle of self-love, that grew up with him from the cradle, and left no room in his heart for the least particle of social virtue. This last, however, he knew so well how to counterfeit, by means of a large share of ductility and dissimulation, that, surely, he was calculated by nature to dupe even the most cautious, and gratify his appetites, by levying contributions on all mankind. Among other tasks imposed by the pedant upon the form to which our two companions belonged, they were one evening ordered to translate a chapter of Caesar\'s Commentaries. Accordingly the young Count went to work, and performed the undertaking with great elegance and despatch. Fathom, having spent the night in more effeminate amusements, was next morning so much hurried for want of time, that in his transcription he neglected to insert a few variations from the text, these being the terms on which he was allowed to use it; so that it was verbatim a copy of the original. As those exercises were always delivered in a heap, subscribed with the several names of the boys to whom they belonged, the schoolmaster chanced to peruse the version of Ferdinand, before he looked into any of the rest, and could not help bestowing upon it particular marks of approbation. The next that fell under his examination was that of the young Count, when he immediately perceived the sameness, and, far from imputing it to the true cause, upbraided him with having copied the exercise of our adventurer, and insisted upon chastising him upon the spot for his want of application. Had not the young gentleman thought his honour was concerned, he would have submitted to the punishment without murmuring; but he inherited, from his parents, the pride of two fierce nations, and, being overwhelmed with reproaches for that which he imagined ought to have redounded to his glory, he could not brook the indignity, and boldly affirmed, that he himself was the original, to whom Ferdinand was beholden for his performance. The schoolmaster, nettled to find himself mistaken in his judgment, resolved that the Count should have no cause to exult in the discovery he had made, and, like a true flogger, actually whipped him for having allowed Fathom to copy his exercise. Nay, in the hope of vindicating his own penetration, he took an opportunity of questioning Ferdinand in private concerning the circumstances of the translation, and our hero, perceiving his drift, gave him such artful and ambiguous answers, as persuaded him that the young Count had acted the part of a plagiary, and that the other had been restrained from doing himself justice, by the consideration of his own dependence. This profound director did not fail, in honour of his own discernment, to whisper about the misrepresentation, as an instance of the young Count\'s insolence, and Fathom\'s humility and good sense. The story was circulated among the servants, especially the maids belonging to the family, whose favour our hero had acquired by his engaging behaviour; and at length it reached the ears of his patron, who, incensed at his son\'s presumption and inhospitality, called him to a severe account, when the young gentleman absolutely denied the truth of the allegation, and appealed to the evidence of Fathom himself. Our adventurer was accordingly summoned by the father, and encouraged to declare the truth, with an assurance of his constant protection; upon which Ferdinand very wisely fell upon his knees, and, while the tears gushed from his eyes, acquitted the young Count of the imputation, and expressed his apprehension, that the report had been spread by some of his enemies, who wanted to prejudice him in the opinion of his patron. The old gentleman was not satisfied of his son\'s integrity by this declaration; being naturally of a generous disposition, highly prepossessed in favour of the poor orphan, and chagrined at the unpromising appearance of his heir, he suspected that Fathom was overawed by the fear of giving offence, and that, notwithstanding what he had said, the case really stood as it had been represented. In this persuasion, he earnestly exhorted his son to resist and combat with any impulse he might feel within himself, tending to selfishness, fraud, or imposition; to encourage every sentiment of candour and benevolence, and to behave with moderation and affability to all his fellow-creatures. He laid upon him strong injunctions, not without a mixture of threats, to consider Fathom as the object of his peculiar regard; to respect him as the son of the Count\'s preserver, as a Briton, a stranger, and, above all, an helpless orphan, to whom the rights of hospitality were doubly due. Such admonitions were not lost upon the youth, who, under the rough husk of his personal exhibition, possessed a large share of generous sensibility. Without any formal professions to his father, he resolved to govern himself according to his remonstrances; and, far from conceiving the least spark of animosity against Fathom, he looked upon the poor boy as the innocent cause of his disgrace, and redoubled his kindness towards him, that his honour might never again be called in question, upon the same subject. Nothing is more liable to misconstruction than an act of uncommon generosity; one half of the world mistake the motive, from want of ideas to conceive an instance of beneficence that soars so high above the level of their own sentiments; and the rest suspect it of something sinister or selfish, from the suggestions of their own sordid and vicious inclinations. The young Count subjected himself to such misinterpretation, among those who observed the increased warmth of civility and complaisance in his behaviour to Ferdinand. They ascribed it to his desire of still profiting by our adventurer\'s superior talents, by which alone they supposed him enabled to maintain any degree of reputation at school; or to the fear of being convicted by him of some misdemeanour of which he knew himself guilty. These suspicions were not effaced by the conduct of Ferdinand, who, when examined on the subject, managed his answers in such a manner, as confirmed their conjectures, while he pretended to refute them, and at the same time acquired to himself credit for his extraordinary discretion and self-denial. If he exhibited such a proof of sagacity in the twelfth year of his age, what might not be expected from his finesse in the maturity of his faculties and experience? Thus secured in the good graces of the whole family, he saw the days of his puerility glide along in the most agreeable elapse of caresses and amusement. He never fairly plunged into the stream of school-education, but, by floating on the surface, imbibed a small tincture of those different sciences which his master pretended to teach. In short, he resembled those vagrant swallows that skim along the level of some pool or river, without venturing to wet one feather in their wings, except in the accidental pursuit of an inconsiderable fly. Yet, though his capacity or inclination was unsuited for studies of this kind, he did not fail to manifest a perfect genius in the acquisition of other more profitable arts. Over and above the accomplishments of address, for which he hath been already celebrated, he excelled all his fellows in his dexterity at fives and billiards; was altogether unrivalled in his skill at draughts and backgammon; began, even at these years, to understand the moves and schemes of chess; and made himself a mere adept in the mystery of cards, which he learned in the course of his assiduities and attention to the females of the house. CHAPTER SIX HE MEDITATES SCHEMES OF IMPORTANCE. It was in these parties that he attracted the notice and friendship of his patron\'s daughter, a girl by two years older than himself, who was not insensible to his qualifications, and looked upon him with the most favourable eyes of prepossession. Whether or not he at this period of his life began to project plans for availing himself of her susceptibility, is uncertain; but, without all doubt, he cultivated her esteem with as obsequious and submissive attention as if he had already formed the design, which, in his advanced age, he attempted to put in execution. Divers circumstances conspired to promote him in the favour of this young lady; the greenness of his years secured him from any appearance of fallacious aim; so that he was indulged in frequent opportunities of conversing with his young mistress, whose parents encouraged this communication, by which they hoped she would improve in speaking the language of her father. Such connexions naturally produce intimacy and friendship. Fathom\'s person was agreeable, his talents calculated for the meridian of those parties, and his manners so engaging, that there would have been no just subject for wonder, had he made an impression upon the tender unexperienced heart of Mademoiselle de Melvil, whose beauty was not so attractive as to extinguish his hope, in raising up a number of formidable rivals; though her expectations of fortune were such as commonly lend additional lustre to personal merit. All these considerations were so many steps towards the success of Ferdinand\'s pretensions; and though he cannot be supposed to have perceived them at first, he in the sequel seemed perfectly well apprised of his advantages, and used them to the full extent of his faculties. Observing that she delighted in music, he betook himself to the study of that art, and, by dint of application and a tolerable ear, learned of himself to accompany her with a German flute, while she sung and played upon the harpsichord. The Count, seeing his inclination, and the progress he had made, resolved that his capacity should not be lost for want of cultivation; and accordingly provided him with a master, by whom he was instructed in the principles of the art, and soon became a proficient in playing upon the violin. In the practice of these improvements and avocations, and in attendance upon his young master, whom he took care never to disoblige or neglect, he attained to the age of sixteen, without feeling the least abatement in the friendship and generosity of those upon whom he depended; but, on the contrary, receiving every day fresh marks of their bounty and regard. He had before this time been smit with the ambition of making a conquest of the young lady\'s heart, and foresaw manifold advantages to himself in becoming son-in-law to Count Melvil, who, he never doubted, would soon be reconciled to the match, if once it could be effectuated without his knowledge. Although he thought he had great reason to believe that Mademoiselle looked upon him with an eye of peculiar favour, his disposition was happily tempered with an ingredient of caution, that hindered him from acting with precipitation; and he had discerned in the young lady\'s deportment certain indications of loftiness and pride, which kept him in the utmost vigilance and circumspection; for he knew, that, by a premature declaration, he should run the risk of forfeiting all the advantages he had gained, and blasting those expectations that now blossomed so gaily in his heart. Restricted by these reflections, he acted at a wary distance, and determined to proceed by the method of sap, and, summoning all his artifice and attractions to his aid, employed them under the insidious cover of profound respect, in order to undermine those bulwarks of haughtiness or discretion, which otherwise might have rendered his approaches to her impracticable. With a view to enhance the value of his company, and sound her sentiments at the same time, he became more reserved than usual, and seldomer engaged in her parties of music and cards; yet, in the midst of his reserve, he never failed in those demonstrations of reverence and regard, which he knew perfectly well how to express, but devised such excuses for his absence, as she could not help admitting. In consequence of this affected shyness, she more than once gently chid him for his neglect and indifference, observing, with an ironical air, that he was now too much of a man to be entertained with such effeminate diversions; but her reproofs were pronounced with too much ease and good-humour to be agreeable to our hero, who desired to see her ruffled and chagrined at his absence, and to hear himself rebuked with an angry affectation of disdain. This effort, therefore, he reinforced with the most captivating carriage he could assume, in those hours which he now so sparingly bestowed upon his mistress. He regaled her with all the entertaining stories he could learn or invent, particularly such as he thought would justify and recommend the levelling power of love, that knows no distinctions of fortune. He sung nothing but tender airs and passionate complaints, composed by desponding or despairing swains; and, to render his performances of this kind the more pathetic, interlarded them with some seasonable sighs, while the tears, which he had ever at command, stood collected in either eye. It was impossible for her to overlook such studied emotions; she in a jocose manner taxed him with having lost his heart, rallied the excess of his passion, and in a merry strain undertook to be an advocate for his love. Her behaviour was still wide of his wish and expectation. He thought she would, in consequence of her discovery, have betrayed some interested symptom; that her face would have undergone some favourable suffusion; that her tongue would have faltered, her breast heaved, and her whole deportment betokened internal agitation and disorder, in which case, he meant to profit by the happy impression, and declare himself, before she could possibly recollect the dictates of her pride.—Baffled however in his endeavours, by the serenity of the young lady, which he still deemed equivocal, he had recourse to another experiment, by which he believed he should make a discovery of her sentiments beyond all possibility of doubt. One day, while he accompanied Mademoiselle in her exercise of music, he pretended all of a sudden to be taken ill, and counterfeited a swoon in her apartment. Surprised at this accident, she screamed aloud, but far from running to his assistance, with the transports and distraction of a lover, she ordered her maid, who was present, to support his head, and went in person to call for more help. He was accordingly removed to his own chamber, where, willing to be still more certified of her inclinations, he prolonged the farce, and lay groaning under the pretence of a severe fever. The whole family was alarmed upon this occasion; for, as we have already observed, he was an universal favourite. He was immediately visited by the old Count and his lady, who expressed the utmost concern at his distemper, ordered him to be carefully attended, and sent for a physician without loss of time. The young gentleman would scarce stir from his bedside, where he ministered unto him with all the demonstrations of brotherly affection; and Miss exhorted him to keep up his spirits, with many expressions of unreserved sympathy and regard. Nevertheless, he saw nothing in her behaviour but what might be naturally expected from common friendship, and a compassionate disposition, and was very much mortified at his disappointment. Whether the miscarriage actually affected his constitution, or the doctor happened to be mistaken in his diagnostics, we shall not pretend to determine; but the patient was certainly treated secundum artem, and all his complaints in a little time realised; for the physician, like a true graduate, had an eye to the apothecary in his prescriptions; and such was the concern and scrupulous care with which our hero was attended, that the orders of the faculty were performed with the utmost punctuality. He was blooded, vomited, purged, and blistered, in the usual forms (for the physicians of Hungary are generally as well skilled in the arts of their occupation as any other leeches under the sun), and swallowed a whole dispensary of bolusses, draughts, and apozems, by which means he became fairly delirious in three days, and so untractable, that he could be no longer managed according to rule; otherwise, in all likelihood, the world would never have enjoyed the benefit of these adventures. In short, his constitution, though unable to cope with two such formidable antagonists as the doctor and the disease he had conjured up, was no sooner rid of the one, than it easily got the better of the other; and though Ferdinand, after all, found his grand aim unaccomplished, his malady was productive of a consequence, which, though he had not foreseen it, he did not fail to convert to his own use and advantage. CHAPTER SEVEN ENGAGES IN PARTNERSHIP WITH A FEMALE ASSOCIATE, IN ORDER TO PUT HIS TALENTS IN ACTION. While he displayed his qualifications in order to entrap the heart of his young mistress, he had unwittingly enslaved the affections of her maid. This attendant was also a favourite of the young lady, and, though her senior by two or three good years at least, unquestionably her superior in point of personal beauty; she moreover possessed a good stock of cunning and discernment, and was furnished by nature with a very amorous complexion. These circumstances being premised, the reader will not be surprised to find her smitten by those uncommon qualifications which we have celebrated in young Fathom. She had in good sooth long sighed in secret, under the powerful influence of his charms, and practised upon him all those little arts, by which a woman strives to attract the admiration, and ensnare the heart of a man she loves; but all his faculties were employed upon the plan which he had already projected; that was the goal of his whole attention, to which all his measures tended; and whether or not he perceived the impression he had made upon Teresa, he never gave her the least reason to believe he was conscious of his victory, until he found himself baffled in his design upon the heart of her mistress.—She therefore persevered in her distant attempts to allure him, with the usual coquetries of dress and address, and, in the sweet hope of profiting by his susceptibility, made shift to suppress her feelings, and keep her passion within bounds, until his supposed danger alarmed her fears, and raised such a tumult within her breast, that she could no longer conceal her love, but gave a loose to her sorrow in the most immoderate expressions of anguish and affliction, and, while his delirium lasted, behaved with all the agitation of a despairing shepherdess. Ferdinand was, or pretended to be, the last person in the family who understood the situation of her thoughts; when he perceived her passion, he entered into deliberation with himself, and tasked his reflection and foresight, in order to discover how best he might convert this conquest to his own advantage. Here, then, that we may neglect no opportunity of doing justice to our hero, it will be proper to observe, that, howsoever unapt his understanding might be to receive and retain the usual culture of the schools, he was naturally a genius self-taught, in point of sagacity and invention.—He dived into the characters of mankind, with a penetration peculiar to himself, and, had he been admitted as a pupil in any political academy, would have certainly become one of the ablest statesmen in Europe. Having revolved all the probable consequences of such a connexion, he determined to prosecute an amour with the lady whose affection he had subdued; because he hoped to interest her as an auxiliary in his grand scheme upon Mademoiselle, which he did not as yet think proper to lay aside; for he was not more ambitious in the plan, than indefatigable in the prosecution of it. He knew it would be impossible to execute his aims upon the Count\'s daughter under the eye of Teresa, whose natural discernment would be whetted with jealousy, and who would watch his conduct, and thwart his progress with all the vigilance and spite of a slighted maiden. On the other hand, he did not doubt of being able to bring her over to his interest, by the influence he had already gained, or might afterwards acquire over her passions; in which case, she would effectually espouse his cause, and employ her good offices with her mistress in his behalf; besides, he was induced by another motive, which, though secondary, did not fail in this case to have an effect upon his determination. He looked upon Teresa with the eyes of appetite, which he longed to gratify; for he was not at all dead to the instigations of the flesh, though he had philosophy enough to resist them, when he thought they interfered with his interest. Here the case was quite different. His desire happened to be upon the side of his advantage, and therefore, resolving to indulge it, he no sooner found himself in a condition to manage such an adventure, than he began to make gradual advances in point of warmth and particular complacency to the love-sick maid. He first of all thanked her, in the most grateful terms, for the concern she had manifested at his distemper, and the kind services he had received from her during the course of it; he treated her upon all occasions with unusual affability and regard, assiduously courted her acquaintance and conversation, and contracted an intimacy that in a little time produced a declaration of love. Although her heart was too much intendered to hold out against all the forms of assault, far from yielding at discretion, she stood upon honourable terms, with great obstinacy of punctilio, and, while she owned he was master of her inclinations, gave him to understand, with a peremptory and resolute air, that he should never make a conquest of her virtue; observing, that, if the passion he professed was genuine, he would not scruple to give such a proof of it as would at once convince her of his sincerity; and that he could have no just cause to refuse her that satisfaction, she being his equal in point of birth and situation; for, if he was the companion and favourite of the young Count, she was the friend and confidant of Mademoiselle. He acknowledged the strength of her argument, and that her condescension was greater than his deserts, but objected against the proposal, as infinitely prejudicial to the fortunes of them both. He represented the state of dependence in which they mutually stood; their utter incapacity to support one another under the consequences of a precipitate match, clandestinely made, without the consent and concurrence of their patrons. He displayed, with great eloquence, all those gay expectations they had reason to entertain, from that eminent degree of favour which they had already secured in the family; and set forth, in the most alluring colours, those enchanting scenes of pleasure they might enjoy in each other, without that disagreeable consciousness of a nuptial chain, provided she would be his associate in the execution of a plan which he had projected for their reciprocal convenience. Having thus inflamed her love of pleasure and curiosity, he, with great caution, hinted his design upon the young lady\'s fortune, and, perceiving her listening with the most greedy attention, and perfectly ripe for the conspiracy, he disclosed his intention at full length, assuring her, with the most solemn protestations of love and attachment, that, could he once make himself legal possessor of an estate which Mademoiselle inherited by the will of a deceased aunt, his dear Teresa should reap the happy fruits of his affluence, and wholly engross his time and attention. Such a base declaration our hero would not have ventured to make, had he not implicitly believed the damsel was as great a latitudinarian as himself, in point of morals and principle; and been well assured, that, though he should be mistaken in her way of thinking, so far as to be threatened with a detection of his purpose, he would always have it in his power to refute her accusation as mere calumny, by the character he had hitherto maintained, and the circumspection of his future conduct. He seldom or never erred in his observations on the human heart. Teresa, instead of disapproving, relished the plan in general, with demonstrations of singular satisfaction. She at once conceived all the advantageous consequences of such a scheme, and perceived in it only one flaw, which, however, she did not think incurable. This defect was no other than a sufficient bond of union, by which they might be effectually tied down to their mutual interest. She foresaw, that, in case Ferdinand should obtain possession of the prize, he might, with great ease, deny their contract, and disavow her claim of participation. She therefore demanded security, and proposed, as a preliminary of the agreement, that he should privately take her to wife, with a view to dispel all her apprehensions of his inconstancy or deceit, as such a previous engagement would be a check upon his behaviour, and keep him strictly to the letter of their contract. He could not help subscribing to the righteousness of this proposal, which, nevertheless, he would have willingly waived, on the supposition that they could not possibly be joined in the bands of wedlock with such secrecy as the nature of the case absolutely required. This would have been a difficulty soon removed, had the scene of the transaction been laid in the metropolis of England, where passengers are plied in the streets by clergymen, who prostitute their characters and consciences for hire, in defiance of all decency and law; but in the kingdom of Hungary, ecclesiastics are more scrupulous in the exercise of their function, and the objection was, or supposed to be, altogether insurmountable; so that they were fain to have recourse to an expedient, with which, after some hesitation, our she-adventurer was satisfied. They joined hands in the sight of Heaven, which they called to witness, and to judge the sincerity of their vows, and engaged, in a voluntary oath, to confirm their union by the sanction of the church, whenever a convenient opportunity for so doing should occur. The scruples of Teresa being thus removed, she admitted Ferdinand to the privileges of a husband, which he enjoyed in stolen interviews, and readily undertook to exert her whole power in promoting his suit with her young mistress, because she now considered his interest as inseparably connected with her own. Surely nothing could be more absurd or preposterous than the articles of this covenant, which she insisted upon with such inflexibility. How could she suppose that her pretended lover would be restrained by an oath, when the very occasion of incurring it was an intention to act in violation of all laws human and divine? and yet such ridiculous conjuration is commonly the cement of every conspiracy, how dark, how treacherous, how impious soever it may be: a certain sign that there are some remains of religion left in the human mind, even after every moral sentiment hath abandoned it; and that the most execrable ruffian finds means to quiet the suggestions of his conscience, by some reversionary hope of Heaven\'s forgiveness. CHAPTER EIGHT THEIR FIRST ATTEMPT; WITH A DIGRESSION WHICH SOME READERS MAY THINK IMPERTINENT. Be this as it will, our lovers, though real voluptuaries, amidst the first transports of their enjoyment did not neglect the great political aim of their conjunction. Teresa\'s bedchamber, to which our hero constantly repaired at midnight, was the scene of their deliberations, and there it was determined that the damsel, in order to avoid suspicion, should feign herself irritated at the indifference of Ferdinand, her passion for whom was by this time no secret in the family; and that, with a view to countenance this affectation, he should upon all occasions treat her with an air of loftiness and disdain. So screened from all imputation of fraud, she was furnished by him with artful instructions how to sound the inclinations of her young mistress, how to recommend his person and qualifications by the sure methods of contradiction, comparisons, revilings, and reproach; how to watch the paroxysms of her disposition, inflame her passions, and improve, for his advantage, those moments of frailty from which no woman is exempted. In short, this consummate politician taught his agent to poison the young lady\'s mind with insidious conversation, tending to inspire her with the love of guilty pleasure, to debauch her sentiments, and confound her ideas of dignity and virtue. After all, the task is not difficult to lead the unpractised heart astray, by dint of those opportunities her seducer possessed. The seeds of insinuation seasonably sown upon the warm luxuriant soil of youth, could hardly fail of shooting up into such intemperate desires as he wanted to produce, especially when cultured and cherished in her unguarded hours, by that stimulating discourse which familiarity admits, and the looser passions, ingrafted in every breast, are apt to relish and excuse. Fathom had previously reconnoitred the ground, and discovered some marks of inflammability in Mademoiselle\'s constitution; her beauty was not such as to engage her in those gaieties of amusement which could flatter her vanity and dissipate her ideas; and she was of an age when the little loves and young desires take possession of the fancy; he therefore concluded, that she had the more leisure to indulge these enticing images of pleasure that youth never fails to create, particularly in those who, like her, were addicted to solitude and study. Teresa, full fraught with the wily injunctions of her confederate, took the field, and opened the campaign with such remarkable sourness in her aspect when Ferdinand appeared, that her young lady could not help taking notice of her affected chagrin, and asked the reason of such apparent alteration in her way of thinking. Prepared for this question, the other replied, in a manner calculated for giving Mademoiselle to understand, that, whatever impressions Ferdinand might have formerly made on her heart, they were now altogether effaced by the pride and insolence with which he had received her advances; and that her breast now glowed with all the revenge of a slighted lover. To evince the sincerity of this declaration, she bitterly inveighed against him, and even affected to depreciate those talents, in which she knew his chief merit to consist; hoping, by these means, to interest Mademoiselle\'s candour in his defence. So far the train succeeded. That young lady\'s love for truth was offended at the calumnies that were vented against Ferdinand in his absence. She chid her woman for the rancour of her remarks, and undertook to refute the articles of his dispraise. Teresa supported her own assertions with great obstinacy, and a dispute ensued, in which her mistress was heated into some extravagant commendations of our adventurer. His supposed enemy did not fail to make a report of her success, and to magnify every advantage they had gained; believing, in good earnest, that her lady\'s warmth was the effect of a real passion for the fortunate Mr. Fathom. But he himself viewed the adventure in a different light, and rightly imputed the violence of Mademoiselle\'s behaviour to the contradiction she had sustained from her maid, or to the fire of her natural generosity glowing in behalf of innocence traduced. Nevertheless, he was perfectly well pleased with the nature of the contest; because, in the course of such debates, he foresaw that he should become habitually her hero, and that, in time, she would actually believe those exaggerations of his merit, which she herself had feigned, for the honour of her own arguments. This presage, founded upon that principle of self-respect, without which no individual exists, may certainly be justified by manifold occurrences in life. We ourselves have known a very pregnant example, which we shall relate, for the emolument of the reader. A certain needy author having found means to present a manuscript to one of those sons of fortune who are dignified with the appellation of patrons, instead of reaping that applause and advantage with which he had regaled his fancy, had the mortification to find his performance treated with infinite irreverence and contempt, and, in high dudgeon and disappointment, appealed to the judgment of another critic, who, he knew, had no veneration for the first. This common consolation, to which all baffled authors have recourse, was productive of very happy consequences to our bard; for, though the opinions of both judges concerning the piece were altogether the same, the latter, either out of compassion to the appellant, or desire of rendering his rival ridiculous in the eye of taste, undertook to repair the misfortune, and in this manner executed the plan. In a meeting of literati, to which both these wits belonged, he who had espoused the poet\'s cause, having previously desired another member to bring his composition on the carpet, no sooner heard it mentioned, than he began to censure it with flagrant marks of scorn, and, with an ironical air, looking at its first condemner, observed, that he must be furiously infected with the rage of patronising, who could take such a deplorable performance into his protection. The sarcasm took effect. The person against whom it was levelled, taking umbrage at his presumption, assumed an aspect of disdain, and replied with great animosity, that nothing was more easily supported than the character of a Zoilus, because no production was altogether free from blemishes; and any man might pronounce against any piece by the lump, without interesting his own discernment; but to perceive the beauties of a work, it was requisite to have learning, judgment, and taste; and therefore he did not wonder that the gentleman had overlooked a great many in the composition which he so contemptuously decried. A rejoinder succeeded this reply, and produced a long train of altercation, in which the gentleman, who had formerly treated the book with such disrespect, now professed himself its passionate admirer, and held forth in praise of it with great warmth and elocution. Not contented with having exhibited this instance of regard, he next morning sent a message to the owner, importing, that he had but superficially glanced over the manuscript, and desiring the favour of perusing it a second time. Being indulged in this request, he recommended it in terms of rapture to all his friends and dependants, and, by dint of unwearied solicitation, procured a very ample subscription for the author. But, to resume the thread of our story. Teresa\'s practices were not confined to simple defamation. Her reproaches were contrived so as to imply some intelligence in favour of the person she reviled. In exemplifying his pertness and arrogance, she repeated his witty repartee; on pretence of blaming his ferocity, she recounted proofs of his spirit and prowess; and, in explaining the source of his vanity, gave her mistress to understand, that a certain young lady of fashion was said to be enamoured of his person. Nor did this well-instructed understrapper omit those other parts of her cue which the principal judged necessary for the furtherance of his scheme. Her conversation became less guarded, and took a freer turn than usual; she seized all opportunities of introducing little amorous stories, the greatest part of which were invented for the purposes of warming her passions, and lowering the price of chastity in her esteem; for she represented all the young lady\'s contemporaries in point of age and situation, as so many sensualists, who, without scruple, indulged themselves in the stolen pleasures of youth. Meanwhile, Ferdinand seconded these endeavours with his whole industry and address. He redoubled, if possible, his deference and respect, whetting his assiduity to the keenest edge of attention; and, in short, regulated his dress, conversation, and deportment, according to the fancy, turn, and prevailing humour of his young mistress. He, moreover, attempted to profit by her curiosity, which he knew to be truly feminine; and having culled from the library of his patron certain dangerous books, calculated to debauch the minds of young people, left them occasionally upon the table in his apartment, after having directed Teresa to pick them up, as if by accident, in his absence, and carry them off for the entertainment of Mademoiselle; nay, this crafty projector found means to furnish his associate with some mischievous preparations, which were mingled in her chocolate, tea, or coffee, as provocations to warm her constitution; yet all these machinations, ingenious as they were, failed, not only in fulfilling their aim, but even in shaking the foundations of her virtue or pride, which stood their assaults unmoved, like a strong tower built upon a rock, impregnable to all the tempestuous blasts of heaven. Not but that the conspirators were more than once mistaken in the effects of their artifices, and disposed to applaud themselves on the progress they had made. When at any time she expressed a desire to examine those performances which were laid before her as snares to entrap her chastity, they attributed that, which was no other than curiosity, to a looseness of sentiment; and when she discovered no aversion to hear those anecdotes concerning the frailty of her neighbours, they imputed to abatement of chastity that satisfaction which was the result of self-congratulation on her own superior virtue. So far did the treacherous accomplice of Fathom presume upon these misconstructions, that she at length divested her tongue of all restraint, and behaved in such a manner, that the young lady, confounded and incensed at her indecency and impudence, rebuked her with great severity, and commanded her to reform her discourse, on pain of being dismissed with disgrace from her service. CHAPTER NINE THE CONFEDERATES CHANGE THEIR BATTERY, AND ACHIEVE A REMARKABLE ADVENTURE. Thunderstruck at this disappointment, the confederates held a council, in order to deliberate upon the next measures that should be taken; and Ferdinand, for the present, despairing of accomplishing his grand aim, resolved to profit in another manner, by the conveniency of his situation. He represented to his helpmate, that it would be prudent for them to make hay while the sun shone, as their connexion might be sooner or later discovered, and an end put to all those opportunities which they now so happily enjoyed. All principles of morality had been already excluded from their former plan; consequently he found it an easy task to interest Teresa in any other scheme tending to their mutual advantage, howsoever wicked and perfidious it might be. He therefore persuaded her to be his auxiliary in defrauding Mademoiselle at play, and gave her suitable directions for that purpose; and even tutored her how to abuse the trust reposed in her, by embezzling the young lady\'s effects, without incurring the suspicion of dishonesty. On the supposition that every servant in the house was not able to resist such temptation, the purse of her mistress, to which the maid had always access, was dropped in a passage which the domestics had occasion to frequent; and Fathom posted himself in a convenient place, in order to observe the effect of his stratagem. Here he was not disappointed in his conjecture. The first person who chanced to pass that way, was one of the chambermaids, with whom Teresa had lived for some time in a state of inveterate enmity, because the wench had failed in that homage and respect which was paid to her by the rest of the servants. Ferdinand had, in his heart, espoused the quarrel of his associate, and longed for an occasion to deliver her from the malicious observance of such an antagonist. When he, therefore, saw her approach, his heart throbbed with joyful expectations; but, when she snatched up the purse, and thrust it in her bosom, with all the eagerness and confusion of one determined to appropriate the windfall to her own use, his transports were altogether unspeakable. He traced her to her own apartment, whither she immediately retreated with great trepidation, and then communicated the discovery to Teresa, together with instructions how to behave in the sequel. In conformity with these lessons, she took the first opportunity of going to Mademoiselle, and demanding money for some necessary expense, that the loss might be known before the finder could have leisure to make any fresh conveyance of the prize; and, in the meantime, Ferdinand kept a strict eye upon the motions of the chambermaid. The young lady, having rummaged her pockets in vain, expressed some surprise at the loss of her purse; upon which her attendant gave indications of extreme amazement and concern. She said, it could not possibly be lost; entreated her to search her escritoir, while she herself ran about the room, prying into every corner, with all the symptoms of fear and distraction. Having made this unsuccessful inquiry, she pretended to shed a flood of tears, bewailing her own fate, in being near the person of any lady who met with such a misfortune, by which, she observed, her character might be called in question. She produced her own keys, and begged upon her knees, that her chamber and boxes might be searched without delay. In a word, she demeaned herself so artfully upon this occasion, that her mistress, who never entertained the least doubt of her integrity, now looked upon her as a miracle of fidelity and attachment, and was at infinite pains to console her for the accident which had happened; protesting that, for her own part, the loss of the money should never affect her with a moment\'s uneasiness, if she could retrieve a certain medal which she had long kept in her purse, as a remembrance of her deceased aunt, from whom she received it in a present. Fathom entered accidentally into the midst of this well-acted scene, and, perceiving the agitation of the maid, and the concern of the mistress, desired, in a respectful manner, to know the cause of their disorder. Before the young lady had time to make him acquainted with the circumstances of the case, his accomplice exclaimed, in an affected passion, "Mr. Fathom, my lady has lost her purse; and, as no persons in the family are so much about her as you and I, you must give me leave, in my own justification, to insist upon Mademoiselle\'s ordering the apartments of us both to be searched without loss of time. Here are my pockets and my keys, and you cannot scruple to give her the same satisfaction; for innocence has nothing to fear." Miss Melvil reprimanded her sharply for her unmannerly zeal; and Ferdinand eyeing her with a look of disdain, "Madam," said he, "I approve of your proposal; but, before I undergo such mortification, I would advise Mademoiselle to subject the two chambermaids to such inquiry; as they also have access to the apartments, and are, I apprehend, as likely as you or I to behave in such a scandalous manner." The young lady declared that she was too well satisfied of Teresa\'s honesty and Ferdinand\'s honour, to harbour the least suspicion of either, and that she would sooner die than disgrace them so far as to comply with the proposal the former had made; but as she saw no reason for exempting the inferior servants from that examination which Fathom advised, she would forthwith put it in execution. The chambermaids being accordingly summoned, she calmly asked if either of them had accidentally found the purse she had dropped? and both replying in the negative, she assumed an air of severity and determination, and demanding their keys, threatened to examine their trunks on the instant. The guilty Abigail, who, though an Hungarian, was not inferior, in point of effrontery, to any one of the sisterhood in England, no sooner heard this menace, than she affected an air of affronted innocence, thanked God she had lived in many reputable families, and been trusted with untold gold, but was never before suspected of theft; that the other maid might do as she should think proper, and be mean-spirited enough to let her things be tumbled topsy-turvy and exposed; but, for her own part, if she should be used in that inhuman and disgraceful manner, she would not stay another hour in the house; and in conclusion said, that Mademoiselle had more reason to look sharp after those who enjoyed the greatest share of her favour, than believe their malicious insinuations against innocent people whom they were well known to hate and defame. This declaration, implying an hint to the prejudice of Teresa, far from diverting Miss Melvil from her purpose, served only to enhance the character of the accused in her opinion, and to confirm her suspicion of the accuser, of whom she again demanded her keys, protesting that, should she prove refractory, the Count himself should take cognisance of the affair, whereas, if she would deal ingenuously, she should have no cause to repent of her confession. So saying, she desired our adventurer to take the trouble of calling up some of the men-servants; upon which the conscious criminal began to tremble, and, falling upon her knees, acknowledged her guilt, and implored the forgiveness of her young mistress. Teresa, seizing this occasion to signalise her generosity, joined in the request, and the offender was pardoned, after having restored the purse, and promised in the sight of Heaven, that the devil should never again entice her to the commission of such a crime. This adventure fully answered all the purposes of our politician; it established the opinion of his fellow-labourer\'s virtue, beyond the power of accident or information to shake, and set up a false beacon to mislead the sentiments of Mademoiselle, in case she should for the future meet with the like misfortune. CHAPTER TEN THEY PROCEED TO LEVY CONTRIBUTIONS WITH GREAT SUCCESS, UNTIL OUR HERO SETS OUT WITH THE YOUNG COUNT FOR VIENNA, WHERE HE ENTERS INTO LEAGUE WITH ANOTHER ADVENTURER. Under this secure cover, Teresa levied contributions upon her mistress with great success. Some trinket was missing every day; the young lady\'s patience began to fail; the faithful attendant was overwhelmed with consternation, and, with the appearance of extreme chagrin, demanded her dismission, affirming that these things were certainly effected by some person in the family, with a view of murdering her precious reputation. Miss Melvil, not without difficulty, quieted her vexation with assurances of inviolable confidence and esteem, until a pair of diamond earrings vanished, when Teresa could no longer keep her affliction within bounds. Indeed, this was an event of more consequence than all the rest which had happened, for the jewels were valued at five hundred florins. Mademoiselle was accordingly alarmed to such a degree, that she made her mother acquainted with her loss, and that good lady, who was an excellent economist, did not fail to give indications of extraordinary concern. She asked, if her daughter had reason to suspect any individual in the family, and if she was perfectly confident of her own woman\'s integrity? Upon which Mademoiselle, with many encomiums on the fidelity and attachment of Teresa, recounted the adventure of the chambermaid, who immediately underwent a strict inquiry, and was even committed to prison, on the strength of her former misdemeanour. Our adventurer\'s mate insisted upon undergoing the same trial with the rest of the domestics, and, as usual, comprehended Fathom in her insinuations; while he seconded the proposal, and privately counselled the old lady to introduce Teresa to the magistrate of the place. By these preconcerted recriminations, they escaped all suspicion of collusion. After a fruitless inquiry, the prisoner was discharged from her confinement, and turned out of the service of the Count, in whose private opinion the character of no person suffered so much, as that of his own son, whom he suspected of having embezzled the jewels, for the use of a certain inamorata, who, at that time, was said to have captivated his affections. The old gentleman felt upon this occasion all that internal anguish which a man of honour may be supposed to suffer, on account of a son\'s degeneracy; and, without divulging his sentiments, or even hinting his suspicions to the youth himself, determined to detach him at once from such dangerous connexions, by sending him forthwith to Vienna, on pretence of finishing his exercises at the academy, and ushering him into acquaintance with the great world. Though he would not be thought by the young gentleman himself to harbour the least doubt of his morals, he did not scruple to unbosom himself on that subject to Ferdinand, whose sagacity and virtue he held in great veneration. This indulgent patron expressed himself in the most pathetic terms, on the untoward disposition of his son; he told Fathom, that he should accompany Renaldo (that was the youth\'s name) not only as a companion, but a preceptor and pattern; conjured him to assist his tutor in superintending his conduct, and to reinforce the governor\'s precepts by his own example; to inculcate upon him the most delicate punctilios of honour, and decoy him into extravagance, rather than leave the least illiberal sentiment in his heart. Our crafty adventurer, with demonstrations of the utmost sensibility, acknowledged the great goodness of the Count in reposing such confidence in his integrity; which, as he observed, none but the worst of villains could abuse; and fervently wished that he might no longer exist, than he should continue to remember and resent the obligations he owed to his kind benefactor. While preparations were making for their departure, our hero held a council with his associate, whom he enriched with many sage instructions touching her future operations; he at the same time disburdened her of all or the greatest part of the spoils she had won, and after having received divers marks of bounty from the Count and his lady, together with a purse from his young mistress, he set out for Vienna, in the eighteenth year of his age, with Renaldo and his governor, who were provided with letters of recommendation to some of the Count\'s friends belonging to the Imperial court. Such a favourable introduction could not fail of being advantageous to a youth of Ferdinand\'s specious accomplishments; for he was considered as the young Count\'s companion, admitted into his parties, and included in all the entertainments to which Renaldo was invited. He soon distinguished himself by his activity and address, in the course of those exercises that were taught at the academy of which he was pupil; his manners were so engaging as to attract the acquaintance of his fellow-students, and his conversation being sprightly and inoffensive, grew into very great request; in a word, he and the young Count formed a remarkable contrast, which, in the eye of the world, redounded to his advantage. They were certainly, in all respects, the reverse of each other. Renaldo, under a total defect of exterior cultivation, possessed a most excellent understanding, with every virtue that dignifies the human heart; while the other, beneath a most agreeable outside, with an inaptitude and aversion to letters, concealed an amazing fund of villany and ingratitude. Hitherto his observation had been confined to a narrow sphere, and his reflections, though surprisingly just and acute, had not attained to that maturity which age and experience give; but now, his perceptions began to be more distinct, and extended to a thousand objects which had never before come under his cognisance. He had formerly imagined, but was now fully persuaded, that the sons of men preyed upon one another, and such was the end and condition of their being. Among the principal figures of life, he observed few or no characters that did not bear a strong analogy to the savage tyrants of the wood. One resembled a tiger in fury and rapaciousness; a second prowled about like an hungry wolf, seeking whom he might devour; a third acted the part of a jackal, in beating the bush for game to his voracious employer; and the fourth imitated the wily fox, in practising a thousand crafty ambuscades for the destruction of the ignorant and unwary. This last was the department of life for which he found himself best qualified by nature and inclination; and he accordingly resolved that his talent should not rust in his possession. He was already pretty well versed in all the sciences of play; but he had every day occasion to see these arts carried to such a surprising pitch of finesse and dexterity, as discouraged him from building his schemes on that foundation. He therefore determined to fascinate the judgment, rather than the eyes of his fellow-creatures, by a continual exercise of that gift of deceiving, with which he knew himself endued to an unrivalled degree; and to acquire unbounded influence with those who might be subservient to his interest, by an assiduous application to their prevailing passions. Not that play was altogether left out in the projection of his economy.— Though he engaged himself very little in the executive part of gaming, he had not been long in Vienna, when he entered into league with a genius of that kind, whom he distinguished among the pupils of the academy, and who indeed had taken up his habitation in that place with a view to pillage the provincials on their first arrival in town, before they could be armed with proper circumspection to preserve their money, or have time to dispose of it in any other shape. Similar characters naturally attract each other, and people of our hero\'s principles are, of all others, the most apt to distinguish their own likeness wheresoever it occurs; because they always keep the faculty of discerning in full exertion. It was in consequence of this mutual alertness, that Ferdinand and the stranger, who was a native of Tyrol, perceived themselves reflected in the dispositions of each other, and immediately entered into an offensive and defensive alliance; our adventurer undertaking for the articles of intelligence, countenance, and counsel, and his associate charging himself with the risk of execution. CHAPTER ELEVEN FATHOM MAKES VARIOUS EFFORTS IN THE WORLD OF GALLANTRY. Thus connected, they began to hunt in couples; and Fathom, in order to profit by the alliance with a good grace, contrived a small scheme that succeeded to his wish. Renaldo being one night intoxicated in the course of a merry-making with his fellow-pupils, from which Fathom had purposely absented himself, was by the Tyrolese so artfully provoked to play, that he could not resist the temptation, but engaged at passdice with that fell adversary, who, in less than an hour, stripped him of a pretty round sum. Next day, when the young gentleman recovered the use of his reflection, he was sensibly chagrined at the folly and precipitation of his own conduct, an account of which he communicated in confidence to our hero, with demonstrations of infinite shame and concern.', 'readingModes': {'text': True, 'image': True}, 'pageCount': 300, 'printType': 'BOOK', 'categories': ['Fiction'], 'maturityRating': 'MATURE', 'allowAnonLogging': True, 'contentVersion': '1.2.2.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=2QN5CwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=2QN5CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=2QN5CwAAQBAJ&printsec=frontcover&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&cd=1&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=2QN5CwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=2QN5CwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 2.42, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 2.42, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=2QN5CwAAQBAJ&rdid=book-2QN5CwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 2420000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 2420000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/The_Adventures_of_Ferdinand_Count_Fathom-sample-epub.acsm?id=2QN5CwAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/The_Adventures_of_Ferdinand_Count_Fathom-sample-pdf.acsm?id=2QN5CwAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=2QN5CwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'To one whose idea of Smollett&#39;s genius is formed entirely by Random and Pickle and Humphry Clinker, Ferdinand Count Fathom will offer many surprises. The first of these is the comparative lifelessness of the book.'}}, {'kind': 'books#volume', 'id': 'cP0NAAAAIAAJ', 'etag': '4nkW9NfZ3VA', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/cP0NAAAAIAAJ', 'volumeInfo': {'title': 'The Adventures of Ferdinand, Count Fathom', 'authors': ['Tobias Smollett'], 'publisher': 'Oxford University Press, USA', 'publishedDate': '1971', 'description': 'The Adventures of Ferdinand Count Fathom is a novel by Tobias Smollett first published in 1753. It was Smollett\'s third novel ... The central character is a villainous dandy who cheats, swindles and philanders his way across Europe and England with little concern for the law or the welfare of others. The son of an equally disreputable mother, Smollett himself comments that "Fathom justifies the proverb, \'What\'s bred in the bone will never come out of the flesh\'." Sir Walter Scott commented that the novel paints a "complete picture of human depravity."--Wikipedia.com.', 'industryIdentifiers': [{'type': 'OTHER', 'identifier': 'UOM:39015005309045'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 424, 'printType': 'BOOK', 'categories': ['Adventure stories'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '0.5.2.0.preview.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=cP0NAAAAIAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=cP0NAAAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=cP0NAAAAIAAJ&q=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&cd=2&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=cP0NAAAAIAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Ferdinand_Count_Fathom.html?hl=&id=cP0NAAAAIAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=cP0NAAAAIAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The Adventures of Ferdinand Count Fathom is a novel by Tobias Smollett first published in 1753. It was Smollett&#39;s third novel .'}}, {'kind': 'books#volume', 'id': 'leLwuQEACAAJ', 'etag': 'WL8IEm/hI6w', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/leLwuQEACAAJ', 'volumeInfo': {'title': 'The Adventures of Ferdinand Count Fathom', 'authors': ['Tobias George Smollett'], 'publisher': 'Createspace Independent Publishing Platform', 'publishedDate': '2018-07-28', 'description': '--The Adventures of Ferdinand Count Fathom by Tobias Smollett We are delighted to publish this classic book as part of our extensive Classic Library collection. Many of the books in our collection have been out of print for decades, and therefore have not been accessible to the general public. The aim of our publishing program is to facilitate rapid access to this vast reservoir of literature, and our view is that this is a significant literary work, which deserves to be brought back into print after many decades. The contents of the vast majority of titles in the Classic Library have been scanned from the original works. To ensure a high quality product, each title has been meticulously hand curated by our staff. Our philosophy has been guided by a desire to provide the reader with a book that is as close as possible to ownership of the original work. We hope that you will enjoy this wonderful classic work, and that for you it becomes an enriching experience.', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1724443771'}, {'type': 'ISBN_13', 'identifier': '9781724443779'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 626, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=leLwuQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=leLwuQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=leLwuQEACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&cd=3&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=leLwuQEACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Ferdinand_Count_Fathom.html?hl=&id=leLwuQEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=leLwuQEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': '--The Adventures of Ferdinand Count Fathom by Tobias Smollett We are delighted to publish this classic book as part of our extensive Classic Library collection.'}}, {'kind': 'books#volume', 'id': 'GsC8nQEACAAJ', 'etag': 'k29+9d155xk', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/GsC8nQEACAAJ', 'volumeInfo': {'title': 'The Adventures of Ferdinand Count Fathom', 'authors': ['Tobias Smollett'], 'publishedDate': '2008-09-01', 'description': 'Tobias George Smollett (1721-1771) was a Scottish author, best known for his picaresque novels, such as The Adventures of Roderick Random (1748) and The Adventures of Peregrine Pickle (1753). He was educated at the University of Glasgow qualifying as a surgeon. His career in medicine came second to his literary ambitions, and in 1739 he went to London to seek his fortune as a dramatist. His first published work was a poem entitled "The Tears of Scotland," but it was The Adventures of Roderick Random which made his name. In 1756, he became editor of The Critical Review. Smollett then began what he regarded as his major work, A Complete History of England, which took from 1757 to 1765. He also wrote The History and Adventures of an Atom (1769), which give his view of English politics during the Seven Years\' War under the guise of a tale from ancient Japan. Amongst his other works are Travels Through France and Italy (1766) and The Expedition of Humphrey Clinker (1771).', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1437847307'}, {'type': 'ISBN_13', 'identifier': '9781437847307'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 396, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=GsC8nQEACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&cd=4&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=GsC8nQEACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Ferdinand_Count_Fathom.html?hl=&id=GsC8nQEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=GsC8nQEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'In 1756, he became editor of The Critical Review. Smollett then began what he regarded as his major work, A Complete History of England, which took from 1757 to 1765.'}}, {'kind': 'books#volume', 'id': 'TzvPzAEACAAJ', 'etag': '3tfroA8QTJU', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/TzvPzAEACAAJ', 'volumeInfo': {'title': 'The Adventures of Ferdinand Count Fathom', 'subtitle': 'New Special Edition', 'authors': ['Tobias Smollett'], 'publishedDate': '2019-12-22', 'description': 'We are happy to announce this classic book. Many of the books in our collection have not been published for decades and are therefore not broadly available to the readers. Our goal is to access the very large literary repository of general public books. The main contents of our entire classical books are the original works. To ensure high quality products, all the titles are chosen carefully by our staff. We hope you enjoy this classic.', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1679561391'}, {'type': 'ISBN_13', 'identifier': '9781679561399'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 378, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=TzvPzAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=TzvPzAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=TzvPzAEACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&cd=5&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=TzvPzAEACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Ferdinand_Count_Fathom.html?hl=&id=TzvPzAEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=TzvPzAEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'We are happy to announce this classic book. Many of the books in our collection have not been published for decades and are therefore not broadly available to the readers.'}}, {'kind': 'books#volume', 'id': 'Q1MrPQAACAAJ', 'etag': 'XlYkZshae3k', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/Q1MrPQAACAAJ', 'volumeInfo': {'title': 'The Adventures of Count Fathom by Tobias Smollett, Fiction, Literary', 'authors': ['Tobias George Smollett', 'G. H. Maynadier'], 'publishedDate': '2003-08', 'description': 'The central character of the novel is a villainous dandy who cheats, swindles and philanders his way across Europe and England with little concern for the law or the welfare of others. The son of an equally disreputable mother, Smollett himself comments that "Fathom justifies the proverb, \'What\'s bred in the bone will never come out of the flesh"', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '159224551X'}, {'type': 'ISBN_13', 'identifier': '9781592245512'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 560, 'printType': 'BOOK', 'categories': ['Fiction'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=Q1MrPQAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=Q1MrPQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=Q1MrPQAACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&cd=6&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=Q1MrPQAACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Count_Fathom_by_Tobias.html?hl=&id=Q1MrPQAACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=Q1MrPQAACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The central character of the novel is a villainous dandy who cheats, swindles and philanders his way across Europe and England with little concern for the law or the welfare of others.'}}, {'kind': 'books#volume', 'id': '21-ptgEACAAJ', 'etag': 't8DdmX2JZzw', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/21-ptgEACAAJ', 'volumeInfo': {'title': 'The Adventures of Ferdinand Count Fathom. by the Author of Roderick Random. ... of 2; Volume 2', 'authors': ['Anonymous'], 'publisher': 'Gale Ecco, Print Editions', 'publishedDate': '2018-04-19', 'description': 'The 18th century was a wealth of knowledge, exploration and rapidly growing technology and expanding record-keeping made possible by advances in the printing press. In its determination to preserve the century of revolution, Gale initiated a revolution of its own: digitization of epic proportions to preserve these invaluable works in the largest archive of its kind. Now for the first time these high-quality digital copies of original 18th century manuscripts are available in print, making them highly accessible to libraries, undergraduate students, and independent scholars. Western literary study flows out of eighteenth-century works by Alexander Pope, Daniel Defoe, Henry Fielding, Frances Burney, Denis Diderot, Johann Gottfried Herder, Johann Wolfgang von Goethe, and others. Experience the birth of the modern novel, or compare the development of language using dictionaries and grammar discourses. ++++ The below data was compiled from various identification fields in the bibliographic record of this title. This data is provided as an additional tool in helping to insure edition identification: ++++ British Library T055299 Author of Roderick Random = Tobias George Smollett. The imprint is probably fictitious. London: printed for J. Davies; T. Smith; N. Taylor, and W. Thompson, 1786. 2v.; 12°', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1379764300'}, {'type': 'ISBN_13', 'identifier': '9781379764304'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 258, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=21-ptgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=21-ptgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=21-ptgEACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&cd=7&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=21-ptgEACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Ferdinand_Count_Fathom.html?hl=&id=21-ptgEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=21-ptgEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'In its determination to preserve the century of revolution, Gale initiated a revolution of its own: digitization of epic proportions to preserve these invaluable works in the largest archive of its kind.'}}, {'kind': 'books#volume', 'id': '6BkfRQAACAAJ', 'etag': '93rdZIodS3w', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/6BkfRQAACAAJ', 'volumeInfo': {'title': 'The Adventures of Count Fathom', 'authors': ['Tobias George Smollett'], 'publishedDate': '2003-09-01', 'description': "'...There are, besides, true Smollett strokes in the scenes in the prison from which Melvil rescues Fathom, and there is a good deal of the satirical Smollett fun in the description of Fathom's ups and downs, first as the petted beau, and then as the fashionable doctor. In chronicling the latter meteoric career, Smollett had already observed the peculiarity of his countrymen which Thackeray was fond of harping on in the next century -- the maxim which universally prevails among the English people ...to overlook, ...on their return to the metropolis, all the connections they may have chanced to acquire during their residence at any of the medical wells...'", 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1592243673'}, {'type': 'ISBN_13', 'identifier': '9781592243679'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 560, 'printType': 'BOOK', 'categories': ['Fiction'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=6BkfRQAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=6BkfRQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=6BkfRQAACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&cd=8&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=6BkfRQAACAAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Count_Fathom.html?hl=&id=6BkfRQAACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=6BkfRQAACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The central character of the novel is a villainous dandy who cheats, swindles and philanders his way across Europe and England with little concern for the law or the welfare of others.'}}, {'kind': 'books#volume', 'id': 'HEVkAgAAQBAJ', 'etag': '++C6KSQ0lEA', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/HEVkAgAAQBAJ', 'volumeInfo': {'title': 'The Life and Adventures of Sir Launcelot Greaves', 'authors': ['Tobias Smollett'], 'publisher': 'University of Georgia Press', 'publishedDate': '2002', 'description': "This new edition brings to life Tobias Smollett's fourth novel, The Life and Adventures of Sir Launcelot Greaves. No annotated edition of the work existed before the second half of the twentieth century, and this comprehensive edition by Robert Folkenflik and Barbara Laning Fitzpatrick features more accurate text as well as scrupulous textual and critical information. Also included in the detailed introduction is a unique examination of Sir Launcelot Greaves, the first illustrated serial novel, in relation to the engravings by Anthony Walker. Sir Launcelot Greaves was a groundbreaking novel for Smollett. Published in British Magazine beginning in January 1760, it was the first major work by an English novelist to have been written specifically for serial publication. The novel, Smollett's shortest, differs stylistically from his previous works. The most attractive of his heroes, Sir Launcelot is virtuous and strange, and he is surrounded by a Smollettian menagerie whose various jargons are part of this novel's linguistic virtuosity and satire. Sir Launcelot's character is an English naturalization of Quixote. Although Sir Launcelot, unlike Quixote, is not the object of the author's satire, an idealistic madness is central to both characters. In Smollett's work the theme of madness is integral to the relationship between self and society as the work ponders both the constitution of madness and the alternatives to revenge. Sir Launcelot Greaves, though not Smollett's most heralded work, has not received the recognition it deserves. Folkenflik and Fitzpatrick present a definitive edition that will be appreciated by scholars and lovers of eighteenth-century literature.", 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9780820323077'}, {'type': 'ISBN_10', 'identifier': '0820323071'}], 'readingModes': {'text': False, 'image': True}, 'pageCount': 370, 'printType': 'BOOK', 'categories': ['Fiction'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '0.1.0.0.preview.1', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=HEVkAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=HEVkAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=HEVkAgAAQBAJ&printsec=frontcover&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&cd=9&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=HEVkAgAAQBAJ&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Life_and_Adventures_of_Sir_Launcelot.html?hl=&id=HEVkAgAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/The_Life_and_Adventures_of_Sir_Launcelot-sample-pdf.acsm?id=HEVkAgAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=HEVkAgAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'This new edition brings to life Tobias Smollett&#39;s fourth novel, The Life and Adventures of Sir Launcelot Greaves.'}}, {'kind': 'books#volume', 'id': '6ELzQw7t7REC', 'etag': 'q7oLFQQMJVg', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/6ELzQw7t7REC', 'volumeInfo': {'title': 'The Expedition of Humphry Clinker', 'authors': ['Tobias George Smollett'], 'publisher': 'Cosimo, Inc.', 'publishedDate': '2005-11-01', 'description': 'Before I was born, [my aunt] had gone such lengths in the way of flirting with a recruiting officer, that her reputation was a little singed. She afterwards made advances to the curate of the parish...-from "To Sir Watkin Phillips, of Jesus college, Oxon, Bath, May 6"An often overlooked but nevertheless important name in the history of the English novel, Tobias Smollett greatly influenced Dickens, with his unsentimental depiction of poverty, and was a favorite of William Makepeace Thackeray, who called The Expedition of Humphry Clinker "the most laughable story that has ever been written since the goodly art of novel-writing began."An early example of the epistolary novel, consisting entirely of letters written between its characters, this is Smollett\'s last book, completed and published just before his death in 1771. Far less brutal than his earlier work, it is the comic story of Humphry Clinker, a poor lad who joins a touring party of aristocrats on their journey through city and country. Smollett\'s satire on the well-to-do and the fripperies that consumed their society echoes in countless writers who came after him, from Jane Austen to "Bridget Jones" with her diary.Scottish writer TOBIAS GEORGE SMOLLETT (1721-1771) trained as a surgeon but found far more success as a novelist; he also worked as an editor and translator. Among his works are Roderick Random (1748) and The Adventures of Peregrine Pickle (1751).', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781596055094'}, {'type': 'ISBN_10', 'identifier': '159605509X'}], 'readingModes': {'text': False, 'image': True}, 'pageCount': 340, 'printType': 'BOOK', 'categories': ['Fiction'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '0.2.0.0.preview.1', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=6ELzQw7t7REC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=6ELzQw7t7REC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=6ELzQw7t7REC&printsec=frontcover&dq=title:The+Adventures+of+Ferdinand+Count+Fathom+%E2%80%94+Complete+by+T.+Smollett&hl=&cd=10&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=6ELzQw7t7REC&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=6ELzQw7t7REC'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 4.83, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 4.83, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=6ELzQw7t7REC&rdid=book-6ELzQw7t7REC&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 4830000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 4830000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=6ELzQw7t7REC&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': '&quot;An early example of the epistolary novel, consisting entirely of letters written between its characters, this is Smollett&#39;s last book, completed and published just before his death in 1771.'}}]}