{'kind': 'books#volumes', 'totalItems': 284, 'items': [{'kind': 'books#volume', 'id': 'jAqUEAAAQBAJ', 'etag': '9rrPbsdkNkI', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/jAqUEAAAQBAJ', 'volumeInfo': {'title': 'THE ENCHANTED APRIL', 'authors': ['ELIZABETH VON ARNIM'], 'publisher': 'BEYOND BOOKS HUB', 'publishedDate': '2022-01-01', 'description': "It began in a Woman's Club in London on a February afternoon—an uncomfortable club, and a miserable afternoon—when Mrs. Wilkins, who had come down from Hampstead to shop and had lunched at her club, took up The Times from the table in the smoking-room, and running her listless eye down the Agony Column saw this: To Those Who Appreciate Wistaria and Sunshine. Small mediaeval Italian Castle on the shores of the Mediterranean to be Let furnished for the month of April. Necessary servants remain. Z, Box 1000, The Times. That was its conception; yet, as in the case of many another, the conceiver was unaware of it at the moment. So entirely unaware was Mrs. Wilkins that her April for that year had then and there been settled for her that she dropped the newspaper with a gesture that was both irritated and resigned, and went over to the window and stared drearily out at the dripping street...", 'readingModes': {'text': True, 'image': True}, 'pageCount': 217, 'printType': 'BOOK', 'categories': ['Fiction'], 'averageRating': 3.5, 'ratingsCount': 66, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '1.1.1.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=jAqUEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=jAqUEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=jAqUEAAAQBAJ&printsec=frontcover&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&cd=1&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=jAqUEAAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=jAqUEAAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 1.29, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 1.29, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=jAqUEAAAQBAJ&rdid=book-jAqUEAAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 1290000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 1290000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/THE_ENCHANTED_APRIL-sample-epub.acsm?id=jAqUEAAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/THE_ENCHANTED_APRIL-sample-pdf.acsm?id=jAqUEAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=jAqUEAAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'From the author of the Books Like: · Elizabeth and Her German Garden · Vera · The Solitary Summer · Mr Skeffington · Love · The Pastor&#39;s Wife · Father · The Benefactress · In the Mountains ♥♥ The Enchanted April By Elizabeth ...'}}, {'kind': 'books#volume', 'id': 'oIiDzQEACAAJ', 'etag': '4Iyj6XufbYM', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/oIiDzQEACAAJ', 'volumeInfo': {'title': 'The Enchanted April', 'authors': ['Elizabeth Von Arnim'], 'publishedDate': '2015-06-16', 'description': 'An immediate bestseller upon its release in 1922, The Enchanted April by Elizabeth Von Arnim tells the story of four very different women who escape from the dreariness of London in springtime to a castle on the shores of Italy. Surrounded by "Wistaria and Sunshine," the women blossom in unexpected ways and discover the refreshing changes that life has in store for them. Written in the humorously witty style that Elizabeth Von Arnim was known for, this title is sure to delight.-This edition contains 40 Study Guide Questions', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9798647730916'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 282, 'printType': 'BOOK', 'averageRating': 3.5, 'ratingsCount': 66, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=oIiDzQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=oIiDzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=oIiDzQEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&cd=2&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=oIiDzQEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Enchanted_April.html?hl=&id=oIiDzQEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=oIiDzQEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'An immediate bestseller upon its release in 1922, The Enchanted April by Elizabeth Von Arnim tells the story of four very different women who escape from the dreariness of London in springtime to a castle on the shores of Italy.'}}, {'kind': 'books#volume', 'id': 'ZTWzEAAAQBAJ', 'etag': '5SSh37RCqro', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/ZTWzEAAAQBAJ', 'volumeInfo': {'title': "The Enchanted April By Elizabeth Von Arnim | From the Author of Books Like: Elizabeth and Her German Garden / Vera / The Solitary Summer / Mr Skeffington / Love / The Pastor's Wife / Father / The Benefactress / In the Mountains", 'authors': ['Elizabeth Von Arnim'], 'publisher': 'BEYOND BOOKS HUB', 'publishedDate': '2023-03-11', 'description': 'From the author of the Books Like · Elizabeth and Her German Garden · Vera · The Solitary Summer · Mr Skeffington · Love · The Pastor\'s Wife · Father · The Benefactress · In the Mountains ♥♥ The Enchanted April By Elizabeth Von Arnim ♥♥ Glimpse of the Book: It began in a Woman’s Club in London on a February afternoon—an uncomfortable club, and a miserable afternoon—when Mrs. Wilkins, who had come down from Hampstead to shop and had lunched at her club, took up The Times from the table in the smoking-room, and running her listless eye down the Agony Column saw this: To Those Who Appreciate Wistaria and Sunshine. Small mediaeval Italian Castle on the shores of the Mediterranean to be Let furnished for the month of April. Necessary servants remain. Z, Box 1000, The Times. That was its conception; yet, as in the case of many another, the conceiver was unaware of it at the moment. So entirely unaware was Mrs. Wilkins that her April for that year had then and there been settled for her that she dropped the newspaper with a gesture that was both irritated and resigned, and went over to the window and stared drearily out at the dripping street. Not for her were mediaeval castles, even those that are specially described as small. Not for her the shores in April of the Mediterranean, and the wisteria and sunshine. Such delights were only for the rich. Yet the advertisement had been addressed to persons who appreciate these things, so that it had been, anyhow addressed too to her, for she certainly appreciated them; more than anybody knew; more than she had ever told. But she was poor. In the whole world she possessed of her very own only ninety pounds, saved from year to year, put by carefully pound by pound, out of her dress allowance. She had scraped this sum together at the suggestion of her husband as a shield and refuge against a rainy day. Her dress allowance, given her by her father, was £100 a year, so that Mrs. Wilkins’s clothes were what her husband, urging her to save, called modest and becoming, and her acquaintance to each other, when they spoke of her at all, which was seldom for she was very negligible, called a perfect sight. Mr. Wilkins, a solicitor, encouraged thrift, except that branch of it which got into his food. He did not call that thrift, he called it bad housekeeping. But for the thrift which, like moth, penetrated into Mrs. Wilkins’s clothes and spoilt them, he had much praise. “You never know,” he said, “when there will be a rainy day, and you may be very glad to find you have a nest-egg. Indeed we both may.” ♥♥ The Enchanted April By Elizabeth Von Arnim ♥♥ About the Author: Elizabeth, Countess Russell, was a British novelist and, through marriage, a member of the German nobility, known as Mary Annette Gräfin von Arnim. Born Mary Annette Beauchamp in Sydney, Australia, she was raised in England and in 1891 married Count Henning August von Arnim, a Prussian aristocrat, and the great-great-great-grandson of King Friedrich Wilhelm I of Prussia. She had met von Arnim during an Italian tour with her father. They married in London but lived in Berlin and eventually moved to the countryside where, in Nassenheide, Pomerania, the von Arnims had their family estate. The couple had five children, four daughters and a son. The children\'s tutors at Nassenheide included E. M. Forster and Hugh Walpole. In 1898 she started her literary career by publishing Elizabeth and Her German Garden, a semi-autobiographical novel about a rural idyll published anonymously and, as it turned out to be highly successful, reprinted 21 times within the first year. Von Arnim wrote another 20 books, which were all published "By the author of Elizabeth and Her German Garden". Count von Arnim died in 1910, and in 1916 Elizabeth married John Francis Stanley Russell, 2nd Earl Russell, Bertrand Russell\'s elder brother. The marriage ended in disaster, with Elizabeth escaping to the United States and the couple finally agreeing, in 1919, to get a divorce. She also had an affair with H. G. Wells. She was a cousin of Katherine Mansfield (whose full name was Kathleen Mansfield Beauchamp). Elizabeth von Arnim spent her old age in London, Switzerland, and on the French Riviera. When World War II broke out she permanently took up residence in the United States, where she died in 1941, aged 74. ♥♥ The Enchanted April By Elizabeth Von Arnim ♥♥ Summary of the Book: A light and pastoral novel compared to her other works, British author Elizabeth von Arnim’s historical fiction The Enchanted April (1922) was inspired by her experience touring the Italian Riviera. It ties together the narratives of four unique women living in Arnim’s present-day England, who somewhat reluctantly band together to vacation in Italy. Eventually, realizing they have a number of commonalities, the women reach the moralistic conclusion that it is prudent and wise to seek social connection rather than exclusivity. Famous for being a relatively early text to feature a solidarity of women as protagonist figures, the novel inaugurated later feminist British literature. It also addresses themes such as self-fulfillment, love, the intrinsic value of the natural world, and the texture of memory. The Enchanted April begins on an ordinary day in England. Mrs. Arbuthnot, a reticent and traditional woman, meets up with Mrs. Wilkins, who is more spontaneous, to discuss an advertisement they found listing the lease of a villa in Italy the next April. Each woman considers the other an acquaintance, but not a friend by any means. However, Mrs. Wilkins notices Mrs. Arbuthnot’s dissatisfaction with life and resonates with her. She urges Mrs. Arbuthnot to sign the lease with her. Mrs. Arbuthnot contacts Mr. Briggs, the owner, who becomes infatuated with her. Realizing that the rate is higher than they expected, the two women resolve to find other female boarders to split the cost. Their petition draws in two other women, Mrs. Fisher, a controlling woman, and the extremely wealthy Lady Caroline Denston. Lacking other interested parties, Mrs. Arbuthnot and Mrs. Wilkins agree to go with them despite their initial judgments. Mrs. Arbuthnot and Mrs. Wilkins travel together to Italy, while the other two women make their own arrangements. When they arrive at the villa, they find that they are the last to reach it, and are irritated that Mrs. Fisher and Lady Caroline have taken the villa’s two finest rooms. Quickly enamored with the beauty of Italy, Mrs. Wilkins forgets her trivial woes. In contrast, Mrs. Arbuthnot despairs, revealing that she has not even informed her husband of her travels. Mrs. Fisher proves to be a solitary person, and Lady Caroline uses Italy as a meditative and spiritual experience. As their vacation progresses, the four women learn more about themselves and of each other. Mrs. Wilkins revels in the Italian countryside, believing that her marital woes would disappear if she lived there; she decides to invite her lawyer husband to join her at the villa. Mrs. Arbuthnot follows suit, inviting her husband as well, though it is out of guilt. Mrs. Fisher, realizing she has repressed much of her youthful spirit, resolves to nurture it further. Reflecting on her life in England, Lady Caroline realizes she has cheapened it with trivialities and shallowness. However, she is at a loss as to how to lead a more meaningful life. Soon, Mr. Wilkins makes it to the Italian villa. An ambitious man, he tries to use the opportunity to get business from the wealthy Mrs. Fisher and Lady Caroline. Despite his preoccupation with his career, he comes to appreciate Mrs. Wilkins more for getting him out of his element. Lady Caroline rebuffs Mr. Wilkins, viewing him as just another man interested in her fortune. Mrs. Fisher befriends him, spending time with him and his wife, who is elated to spend so much more time with him. Mr. Briggs, en route to Rome, stops at the villa. He virtually forgets about Mrs. Arbuthnot upon seeing Lady Caroline. Lady Caroline ignores him, but eventually softens, seeing that his affection is genuine and not based on shallow personal desire. The plot takes an unexpected twist near the end of the novel: Lady Caroline invites a lover from England who turns out to be Mr. Arbuthnot. Before Mr. Arbuthnot registers shock, giving his affair away, Mrs. Arbuthnot rejoices that he has come to see her. Lady Caroline quickly pivots, turning to Mr. Briggs, as Mrs. Arbuthnot reconnects with her husband. The story concludes at the end of the women’s month in Italy. They look forward to returning to England, implementing their improved relationships and self-understanding in daily life. A gentle novel even with its unexpected twists and turns, The Enchanted April casts the setting of an idealized rural Italy as an environment that enables its visitors to reconnect to their spiritual roots. Using this trope of the “change of scenery” as a source of therapy, it suggests that the social connections that nature and relaxation foster can be a remedy to one’s exacting and modern urban life. ♥♥ The Enchanted April By Elizabeth Von Arnim ♥♥', 'readingModes': {'text': True, 'image': True}, 'pageCount': 217, 'printType': 'BOOK', 'categories': ['Drama'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '0.1.2.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=ZTWzEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=ZTWzEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=ZTWzEAAAQBAJ&printsec=frontcover&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&cd=3&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=ZTWzEAAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=ZTWzEAAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 1.29, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 1.29, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=ZTWzEAAAQBAJ&rdid=book-ZTWzEAAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 1290000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 1290000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/The_Enchanted_April_By_Elizabeth_Von_Arn-sample-epub.acsm?id=ZTWzEAAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/The_Enchanted_April_By_Elizabeth_Von_Arn-sample-pdf.acsm?id=ZTWzEAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=ZTWzEAAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'From the author of the Books Like · Elizabeth and Her German Garden · Vera · The Solitary Summer · Mr Skeffington · Love · The Pastor&#39;s Wife · Father · The Benefactress · In the Mountains ♥♥ The Enchanted April By Elizabeth Von ...'}}, {'kind': 'books#volume', 'id': 'Yb5FzgEACAAJ', 'etag': 'wCp3GXLkSzk', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/Yb5FzgEACAAJ', 'volumeInfo': {'title': 'The Enchanted April by Elizabeth Von Arnim', 'authors': ['Elizabeth Arnim'], 'publishedDate': '2021-03-02', 'description': 'A lovely tale of enticing figures that turn themselves into an enchanting location during their holiday. With idyllic depictions of spring in Italy, this is delightfully amusing and observant. With its well-drawn female characters, magical atmosphere, and happy ending for everyone. Led to action by the monotony of their lives in London, two not-quite friends resolve to rent a medieval Italian castle for a month in the hopes of seeking revival. They are accompanied by two other ladies, a socialite and a dowager, searching for a solution to their problems. As the quartet finally settles in together (though not always gracefully), they share the charm and pleasure of their springtime castle, and each of them rediscovers the selves they had lost. The concern is whether the magic will be carried over into their lives and loves in the "real" world. This is a timeless classic that inspired the film of the same name. The book is full of reflective and informative introspection and significant character interaction that turns the characters from traditional archetypes to more thoroughly fleshed-out women. The book\'s structure and vocabulary are poetic and romantic, which acts as a fun backdrop for the development we witness in character. The book contains a biography of one of the most famous British writers - Elizabeth von Arnim.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9798714919923'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 238, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=Yb5FzgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=Yb5FzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=Yb5FzgEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&cd=4&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=Yb5FzgEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Enchanted_April_by_Elizabeth_Von_Arn.html?hl=&id=Yb5FzgEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=Yb5FzgEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The book&#39;s structure and vocabulary are poetic and romantic, which acts as a fun backdrop for the development we witness in character. The book contains a biography of one of the most famous British writers - Elizabeth von Arnim.'}}, {'kind': 'books#volume', 'id': 'WQnJtQEACAAJ', 'etag': 'u87gqgKccr4', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/WQnJtQEACAAJ', 'volumeInfo': {'title': 'The Enchanted April', 'subtitle': 'Special Edition', 'authors': ['Elizabeth Von Arnim'], 'publisher': 'Createspace Independent Publishing Platform', 'publishedDate': '2018-04-07', 'description': "'The Enchanted April', a novel by Elizabeth von Arnim, follows four dissimilar women in 1920s England who leave their rainy, grey environments to go on holiday in Italy. Mrs Arbuthnot and Mrs Wilkins, who belong to the same ladies' club but have never spoken, become acquainted after reading a newspaper advertisement for a small medieval castle on the Mediterranean to be let furnished for April. They find some common ground in that both are struggling to make the best of unhappy marriages. They also reluctantly take on the waspish, elderly Mrs Fisher and the stunning but aloof Lady Caroline Dester to defray expenses. The four women come together at the castle and find rejuvenation in the tranquil beauty of their surroundings, rediscovering hope and love. We are delighted to publish this classic book as part of our extensive Classic Library collection. Many of the books in our collection have been out of print for decades, and therefore have not been accessible to the general public. The aim of our publishing program is to facilitate rapid access to this vast reservoir of literature, and our view is that this is a significant literary work, which deserves to be brought back into print after many decades. The contents of the vast majority of titles in the Classic Library have been scanned from the original works. To ensure a high quality product, each title has been meticulously hand curated by our staff. Our philosophy has been guided by a desire to provide the reader with a book that is as close as possible to ownership of the original work. We hope that you will enjoy this wonderful classic work, and that for you it becomes an enriching experience.", 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1986837904'}, {'type': 'ISBN_13', 'identifier': '9781986837903'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 308, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=WQnJtQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=WQnJtQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=WQnJtQEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&cd=5&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=WQnJtQEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Enchanted_April.html?hl=&id=WQnJtQEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=WQnJtQEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'We are delighted to publish this classic book as part of our extensive Classic Library collection. Many of the books in our collection have been out of print for decades, and therefore have not been accessible to the general public.'}}, {'kind': 'books#volume', 'id': 'Ug_NtAEACAAJ', 'etag': 'K0MQFyrWuNw', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/Ug_NtAEACAAJ', 'volumeInfo': {'title': 'The Enchanted April', 'authors': ['Elizabeth Arnim'], 'publisher': 'Createspace Independent Publishing Platform', 'publishedDate': '2018-01-29', 'description': 'This collection chronicles the fiction and non fiction classics by the greatest writers the world has ever known. The inclusion of both popular as well as overlooked pieces is pivotal to providing a broad and representative collection of classic works. We are delighted to publish this classic book as part of our extensive Classic Library collection. Many of the books in our collection have been out of print for decades, and therefore have not been accessible to the general public. The aim of our publishing program is to facilitate rapid access to this vast reservoir of literature, and our view is that this is a significant literary work, which deserves to be brought back into print after many decades. The contents of the vast majority of titles in the Classic Library have been scanned from the original works. To ensure a high quality product, each title has been meticulously hand curated by our staff. Our philosophy has been guided by a desire to provide the reader with a book that is as close as possible to ownership of the original work. We hope that you will enjoy this wonderful classic work, and that for you it becomes an enriching experience.', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '198422994X'}, {'type': 'ISBN_13', 'identifier': '9781984229946'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 114, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=Ug_NtAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=Ug_NtAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=Ug_NtAEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&cd=6&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=Ug_NtAEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Enchanted_April.html?hl=&id=Ug_NtAEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=Ug_NtAEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'We are delighted to publish this classic book as part of our extensive Classic Library collection. Many of the books in our collection have been out of print for decades, and therefore have not been accessible to the general public.'}}, {'kind': 'books#volume', 'id': 'J_1UswEACAAJ', 'etag': 'jSq4xeC81C4', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/J_1UswEACAAJ', 'volumeInfo': {'title': 'The Enchanted April', 'authors': ['Elizabeth von Elizabeth von Arnim'], 'publisher': 'Createspace Independent Publishing Platform', 'publishedDate': '2017-12-22', 'description': 'An entertaining story of four dissimilar women in post-World War I England who leave damp and rainy London for a holiday at a secluded villa on the Italian coast. Two housewives, who belong to the same church but have never spoken, are joined by a beautiful young socialite and an elderly dowager.', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1981774696'}, {'type': 'ISBN_13', 'identifier': '9781981774692'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 168, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=J_1UswEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=J_1UswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=J_1UswEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&cd=7&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=J_1UswEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Enchanted_April.html?hl=&id=J_1UswEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=J_1UswEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'An entertaining story of four dissimilar women in post-World War I England who leave damp and rainy London for a holiday at a secluded villa on the Italian coast.'}}, {'kind': 'books#volume', 'id': 'dKLJDwAAQBAJ', 'etag': 'HU3/UcIVgvY', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/dKLJDwAAQBAJ', 'volumeInfo': {'title': 'Elizabeth and Her German Garden', 'authors': ['Elizabeth Von Arnim'], 'publisher': 'Good Press', 'publishedDate': '2020-01-09', 'description': '"Elizabeth and Her German Garden" by Elizabeth Von Arnim. Published by Good Press. Good Press publishes a wide range of titles that encompasses every genre. From well-known classics & literary fiction and non-fiction to forgotten−or yet undiscovered gems−of world literature, we issue the books that need to be read. Each Good Press edition has been meticulously edited and formatted to boost readability for all e-readers and devices. Our goal is to produce eBooks that are user-friendly and accessible to everyone in a high-quality digital format.', 'industryIdentifiers': [{'type': 'OTHER', 'identifier': 'EAN:4064066120856'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 192, 'printType': 'BOOK', 'categories': ['Gardening'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '1.6.7.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=dKLJDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=dKLJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=dKLJDwAAQBAJ&printsec=frontcover&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&cd=8&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=dKLJDwAAQBAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Elizabeth_and_Her_German_Garden.html?hl=&id=dKLJDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Elizabeth_and_Her_German_Garden-sample-epub.acsm?id=dKLJDwAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Elizabeth_and_Her_German_Garden-sample-pdf.acsm?id=dKLJDwAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=dKLJDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Good Press publishes a wide range of titles that encompasses every genre. From well-known classics &amp; literary fiction and non-fiction to forgotten−or yet undiscovered gems−of world literature, we issue the books that need to be read.'}}, {'kind': 'books#volume', 'id': 'itiVzQEACAAJ', 'etag': 'sXSZzua2msw', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/itiVzQEACAAJ', 'volumeInfo': {'title': "The April Baby's Book of Tunes with the Story of how They Came to be Written", 'subtitle': '1900 (the First) Edition, Illustrated', 'authors': ['Elizabeth Von Arnim'], 'publishedDate': '2019-06-20', 'description': '1900 (the first) edition, illustrated by Kate GreenwayFull title "The April Baby\'s Book of Tunes with the story of how they came to be written"This book contains lovely illustrations, it depicts a mother who entertain her 2 young girls teaching them English from nursery rhymes and tunes.* * *Elizabeth von Arnim (1866 - 1941), born Mary Annette Beauchamp, was an Australian-born British novelist. By marriage she became Countess von Arnim-Schlagenthin, and after her second marriage she was styled as Elizabeth Russell, Countess Russell. She is the author of "Elizabeth and Her German Garden" and "Enchanted April".', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1075121876'}, {'type': 'ISBN_13', 'identifier': '9781075121876'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 48, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=itiVzQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=itiVzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=itiVzQEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&cd=9&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=itiVzQEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_April_Baby_s_Book_of_Tunes_with_the.html?hl=&id=itiVzQEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=itiVzQEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': '1900 (the first) edition, illustrated by Kate GreenwayFull title &quot;The April Baby&#39;s Book of Tunes with the story of how they came to be written&quot;This book contains lovely illustrations, it depicts a mother who entertain her 2 young girls ...'}}, {'kind': 'books#volume', 'id': 'KBhDrgEACAAJ', 'etag': '9kxQ6TWUiz8', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/KBhDrgEACAAJ', 'volumeInfo': {'title': "The Enchanted April - Scholar's Choice Edition", 'authors': ['Elizabeth Von Arnim'], 'publishedDate': '2015-02-16', 'description': 'This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most important libraries around the world), and other notations in the work. This work is in the public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work.As a reproduction of a historical artifact, this work may contain missing or blurred pages, poor pictures, errant marks, etc. Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant.', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1298053048'}, {'type': 'ISBN_13', 'identifier': '9781298053046'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 242, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=KBhDrgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=KBhDrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=KBhDrgEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&cd=10&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=KBhDrgEACAAJ&dq=title:The+Enchanted+April+by+Elizabeth+Von+Arnim&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Enchanted_April_Scholar_s_Choice_Edi.html?hl=&id=KBhDrgEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=KBhDrgEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it.'}}]}