{'kind': 'books#volumes', 'totalItems': 46, 'items': [{'kind': 'books#volume', 'id': 'jN6cDprdnd0C', 'etag': 'xfvFexWsBFY', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/jN6cDprdnd0C', 'volumeInfo': {'title': "The Web Application Hacker's Handbook", 'subtitle': 'Finding and Exploiting Security Flaws', 'authors': ['Dafydd Stuttard', 'Marcus Pinto'], 'publisher': 'John Wiley & Sons', 'publishedDate': '2011-09-27', 'description': "The highly successful security book returns with a new edition, completely updated Web applications are the front door to most organizations, exposing them to attacks that may disclose personal information, execute fraudulent transactions, or compromise ordinary users. This practical book has been completely updated and revised to discuss the latest step-by-step techniques for attacking and defending the range of ever-evolving web applications. You'll explore the various new technologies employed in web applications that have appeared since the first edition and review the new attack techniques that have been developed, particularly in relation to the client side. Reveals how to overcome the new technologies and techniques aimed at defending web applications against attacks that have appeared since the previous edition Discusses new remoting frameworks, HTML5, cross-domain integration techniques, UI redress, framebusting, HTTP parameter pollution, hybrid file attacks, and more Features a companion web site hosted by the authors that allows readers to try out the attacks described, gives answers to the questions that are posed at the end of each chapter, and provides a summarized methodology and checklist of tasks Focusing on the areas of web application security where things have changed in recent years, this book is the most current resource on the critical topic of discovering, exploiting, and preventing web application security flaws.", 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781118026472'}, {'type': 'ISBN_10', 'identifier': '1118026470'}], 'readingModes': {'text': False, 'image': True}, 'pageCount': 912, 'printType': 'BOOK', 'categories': ['Computers'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '0.4.2.0.preview.1', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=jN6cDprdnd0C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=jN6cDprdnd0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=jN6cDprdnd0C&printsec=frontcover&dq=title:The+Hackers+Playbook+3&hl=&cd=1&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=jN6cDprdnd0C&dq=title:The+Hackers+Playbook+3&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Web_Application_Hacker_s_Handbook.html?hl=&id=jN6cDprdnd0C'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/The_Web_Application_Hacker_s_Handbook-sample-pdf.acsm?id=jN6cDprdnd0C&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=jN6cDprdnd0C&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'This book shows you how they do it. This fully updated edition contains the very latest attack techniques and countermeasures, showing you how to break into today&#39;s complex and highly functional applications.'}}, {'kind': 'books#volume', 'id': 'hyOGDwAAQBAJ', 'etag': 'eFkQGM6jjE8', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/hyOGDwAAQBAJ', 'volumeInfo': {'title': 'Becoming the Hacker', 'subtitle': 'The Playbook for Getting Inside the Mind of the Attacker', 'authors': ['Adrian Pruteanu'], 'publisher': 'Packt Publishing Ltd', 'publishedDate': '2019-01-31', 'description': "Web penetration testing by becoming an ethical hacker. Protect the web by learning the tools, and the tricks of the web application attacker. Key Features Builds on books and courses on penetration testing for beginners Covers both attack and defense perspectives Examines which tool to deploy to suit different applications and situations Book Description Becoming the Hacker will teach you how to approach web penetration testing with an attacker's mindset. While testing web applications for performance is common, the ever-changing threat landscape makes security testing much more difficult for the defender. There are many web application tools that claim to provide a complete survey and defense against potential threats, but they must be analyzed in line with the security needs of each web application or service. We must understand how an attacker approaches a web application and the implications of breaching its defenses. Through the first part of the book, Adrian Pruteanu walks you through commonly encountered vulnerabilities and how to take advantage of them to achieve your goal. The latter part of the book shifts gears and puts the newly learned techniques into practice, going over scenarios where the target may be a popular content management system or a containerized application and its network. Becoming the Hacker is a clear guide to web application security from an attacker's point of view, from which both sides can benefit. What you will learn Study the mindset of an attacker Adopt defensive strategies Classify and plan for standard web application security threats Prepare to combat standard system security problems Defend WordPress and mobile applications Use security tools and plan for defense against remote execution Who this book is for The reader should have basic security experience, for example, through running a network or encountering security issues during application development. Formal education in security is useful, but not required. This title is suitable for people with at least two years of experience in development, network management, or DevOps, or with an established interest in security.", 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781788623759'}, {'type': 'ISBN_10', 'identifier': '1788623754'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 404, 'printType': 'BOOK', 'categories': ['Computers'], 'averageRating': 5, 'ratingsCount': 1, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.2.2.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=hyOGDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=hyOGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=hyOGDwAAQBAJ&pg=PA366&dq=title:The+Hackers+Playbook+3&hl=&cd=2&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=hyOGDwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=hyOGDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 27.55, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 19.28, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=hyOGDwAAQBAJ&rdid=book-hyOGDwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 27550000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 19280000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=hyOGDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The <b>Playbook</b> for Getting Inside the Mind of the Attacker Adrian Pruteanu. &lt;script src=&quot;/js/jquery-1.11.<b>3</b>.min.js&quot;&gt;&lt;/script&gt; &lt;script src=&quot;/js/term.js&quot;&gt;&lt;/script&gt;&lt;link rel=&quot;stylesheet&quot; href=&quot;/css/term.css&quot; type=&quot;text/css&quot; /&gt; &lt;/head&gt;&nbsp;...'}}, {'kind': 'books#volume', 'id': 'cXMdDAAAQBAJ', 'etag': '5lQ2T85iY78', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/cXMdDAAAQBAJ', 'volumeInfo': {'title': 'Hacking Sales', 'subtitle': 'The Playbook for Building a High-Velocity Sales Machine', 'authors': ['Max Altschuler'], 'publisher': 'John Wiley & Sons', 'publishedDate': '2016-05-31', 'description': 'Stay ahead of the sales evolution with a more efficient approach to everything Hacking Sales helps you transform your sales process using the next generation of tools, tactics and strategies. Author Max Altschuler has dedicated his business to helping companies build modern, efficient, high tech sales processes that generate more revenue while using fewer resources. In this book, he shows you the most effective changes you can make, starting today, to evolve your sales and continually raise the bar. You’ll walk through the entire sales process from start to finish, learning critical hacks every step of the way. Find and capture your lowest-hanging fruit at the top of the funnel, build massive lead lists using ICP and TAM, utilize multiple prospecting strategies, perfect your follow-ups, nurture leads, outsource where advantageous, and much more. Build, refine, and enhance your pipeline over time, close deals faster, and use the right tools for the job—this book is your roadmap to fast and efficient revenue growth. Without a reliable process, you’re disjointed, disorganized, and ultimately, underperforming. Whether you’re building a sales process from scratch or looking to become your company’s rock star, this book shows you how to make it happen. Identify your Ideal Customer and your Total Addressable Market Build massive lead lists and properly target your campaigns Learn effective hacks for messaging and social media outreach Overcome customer objections before they happen The economy is evolving, the customer is evolving, and sales itself is evolving. Forty percent of the Fortune 500 from the year 2000 were absent from the Fortune 500 in the year 2015, precisely because they failed to evolve. Today’s sales environment is very much a “keep up or get left behind” paradigm, but you need to do better to excel. Hacking Sales shows you how to get ahead of everyone else with focused effort and the most effective approach to modern sales.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781119281641'}, {'type': 'ISBN_10', 'identifier': '1119281644'}], 'readingModes': {'text': False, 'image': True}, 'pageCount': 162, 'printType': 'BOOK', 'categories': ['Business & Economics'], 'averageRating': 4, 'ratingsCount': 1, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '2.7.3.0.preview.1', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=cXMdDAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=cXMdDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=cXMdDAAAQBAJ&pg=PA22&dq=title:The+Hackers+Playbook+3&hl=&cd=3&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=cXMdDAAAQBAJ&dq=title:The+Hackers+Playbook+3&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Hacking_Sales.html?hl=&id=cXMdDAAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Hacking_Sales-sample-pdf.acsm?id=cXMdDAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=cXMdDAAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The <b>Playbook</b> for Building a High-Velocity Sales Machine Max Altschuler. 22 <b>HACKING</b> SALES Step <b>3</b>: Mapping the Fields to Reports in Salesforce In Step <b>3</b>, you want to think about the optimal method for presenting the data so that (1) the&nbsp;...'}}, {'kind': 'books#volume', 'id': 'cWNDDwAAQBAJ', 'etag': '7rN00LVB/fE', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/cWNDDwAAQBAJ', 'volumeInfo': {'title': 'Regulatory Hacking', 'subtitle': 'A Playbook for Startups', 'authors': ['Evan Burfield', 'J.D. Harrison'], 'publisher': 'Penguin', 'publishedDate': '2018-06-19', 'description': 'Named by Inc. magazine as one of the 10 Best Business Books of 2018 Every startup wants to change the world. But the ones that truly make an impact know something the others don\'t: how to make government and regulation work for them. As startups use technology to shape the way we live, work, and learn, they\'re taking on challenges in sectors like healthcare, infrastructure, and education, where failure is far more consequential than a humorous chat with Siri or the wrong package on your doorstep. These startups inevitably have to face governments responsible for protecting citizens through regulation. Love it or hate it, we\'re entering the next era of the digital revolution: the Regulatory Era. The big winners in this era--in terms of both impact and financial return--will need skills they won\'t teach you in business school or most startup incubators: how to scale a business in an industry deeply intertwined with government. Here, for the first time, is the playbook on how to win the regulatory era. "Regulatory hacking" doesn\'t mean "cutting through red tape"; it\'s really about finding a creative, strategic approach to navigating complex markets. Evan Burfield is the cofounder of 1776, a Washington, DC-based venture capital firm and incubator specializing in regulated industries. Burfield has coached startups on how to understand, adapt to, and influence government regulation. Now, in Regulatory Hacking, he draws on that expertise and real startup success stories to show you how to do the same. For instance, you\'ll learn how... * AirBnB rallied a grassroots movement to vote No on San Francisco\'s Prop F, which would have restricted its business in the city. * HopSkipDrive overcame safety concerns about its kids\' ridesharing service by working with state government to build trust into its platform. * 23andMe survived the FDA\'s order to stop selling its genetic testing kits by building trusted relationships with scientists who could influence the federal regulatory community. Through fascinating case studies and interviews with startup founders, Burfield shows you how to build a compelling narrative for your startup, use it to build a grassroots movement to impact regulation, and develop influence to overcome entrenched relationships between incumbents and governments. These are just some of the tools in the book that you\'ll need to win the next frontier of innovation.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9780525533214'}, {'type': 'ISBN_10', 'identifier': '0525533214'}], 'readingModes': {'text': True, 'image': False}, 'pageCount': 320, 'printType': 'BOOK', 'categories': ['Business & Economics'], 'averageRating': 5, 'ratingsCount': 3, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.2.3.0.preview.2', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=cWNDDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=cWNDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=cWNDDwAAQBAJ&pg=PT4&dq=title:The+Hackers+Playbook+3&hl=&cd=4&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=cWNDDwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=cWNDDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 7.88, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 7.88, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=cWNDDwAAQBAJ&rdid=book-cWNDDwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 7880000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 7880000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Regulatory_Hacking-sample-epub.acsm?id=cWNDDwAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=cWNDDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'A <b>Playbook</b> for Startups Evan Burfield, J.D. Harrison. Contents <b>Title</b> Page Copyright Dedication Introduction THE REGULATORY ERA SECTION 1 <b>Hacking</b> in the Public Interest Chapter 1 REGULATORY <b>HACKING</b> Chapter 2 POWER Chapter <b>3</b> BUSINESS&nbsp;...'}}, {'kind': 'books#volume', 'id': 'T_LlAwAAQBAJ', 'etag': 'eK81IF0JPnM', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/T_LlAwAAQBAJ', 'volumeInfo': {'title': 'Penetration Testing', 'subtitle': 'A Hands-On Introduction to Hacking', 'authors': ['Georgia Weidman'], 'publisher': 'No Starch Press', 'publishedDate': '2014-06-14', 'description': 'Penetration testers simulate cyber attacks to find security weaknesses in networks, operating systems, and applications. Information security experts worldwide use penetration techniques to evaluate enterprise defenses. In Penetration Testing, security expert, researcher, and trainer Georgia Weidman introduces you to the core skills and techniques that every pentester needs. Using a virtual machine–based lab that includes Kali Linux and vulnerable operating systems, you’ll run through a series of practical lessons with tools like Wireshark, Nmap, and Burp Suite. As you follow along with the labs and launch attacks, you’ll experience the key stages of an actual assessment—including information gathering, finding exploitable vulnerabilities, gaining access to systems, post exploitation, and more. Learn how to: –Crack passwords and wireless network keys with brute-forcing and wordlists –Test web applications for vulnerabilities –Use the Metasploit Framework to launch exploits and write your own Metasploit modules –Automate social-engineering attacks –Bypass antivirus software –Turn access to one machine into total control of the enterprise in the post exploitation phase You’ll even explore writing your own exploits. Then it’s on to mobile hacking—Weidman’s particular area of research—with her tool, the Smartphone Pentest Framework. With its collection of hands-on lessons that cover key tools and strategies, Penetration Testing is the introduction that every aspiring hacker needs.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781593275648'}, {'type': 'ISBN_10', 'identifier': '1593275641'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 531, 'printType': 'BOOK', 'categories': ['Computers'], 'averageRating': 4.5, 'ratingsCount': 5, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.2.2.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=T_LlAwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=T_LlAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=T_LlAwAAQBAJ&printsec=frontcover&dq=title:The+Hackers+Playbook+3&hl=&cd=5&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=T_LlAwAAQBAJ&dq=title:The+Hackers+Playbook+3&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Penetration_Testing.html?hl=&id=T_LlAwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=T_LlAwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'In Penetration Testing, security expert, researcher, and trainer Georgia Weidman introduces you to the core skills and techniques that every pentester needs.'}}, {'kind': 'books#volume', 'id': 'U0klDwAAQBAJ', 'etag': 'yVNvgn4gg1Q', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/U0klDwAAQBAJ', 'volumeInfo': {'title': 'Expert Secrets', 'subtitle': 'The Underground Playbook for Creating a Mass Movement of People Who Will Pay for Your Advice', 'authors': ['Russell Brunson'], 'publisher': 'Morgan James Publishing', 'publishedDate': '2017-06-02', 'description': 'Your message has the ability to change someone’s life. The impact that the right message can have on someone at the right time in their life is immeasurable. It could help to save marriages, repair families, change someone’s health, grow a company or more... But only if you know how to get it into the hands of the people whose lives you have been called to change. Expert Secrets will put your message into the hands of people who need it.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781683504597'}, {'type': 'ISBN_10', 'identifier': '1683504593'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 240, 'printType': 'BOOK', 'categories': ['Business & Economics'], 'averageRating': 3, 'ratingsCount': 2, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '0.2.3.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=U0klDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=U0klDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=U0klDwAAQBAJ&pg=PT157&dq=title:The+Hackers+Playbook+3&hl=&cd=6&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=U0klDwAAQBAJ&dq=title:The+Hackers+Playbook+3&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Expert_Secrets.html?hl=&id=U0klDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Expert_Secrets-sample-epub.acsm?id=U0klDwAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Expert_Secrets-sample-pdf.acsm?id=U0klDwAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=U0klDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The Underground <b>Playbook</b> for Creating a Mass Movement of People Who Will Pay for Your Advice Russell Brunson ... You already created the <b>titles</b> of these <b>3</b> Secrets, so you can plug them in here and introduce them to everyone.'}}, {'kind': 'books#volume', 'id': 'AKJyDwAAQBAJ', 'etag': 'se9L/Gint3c', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/AKJyDwAAQBAJ', 'volumeInfo': {'title': 'Πώς πεθαίνουν οι δημοκρατίες', 'authors': ['Daniel Ziblatt', 'Steven Levitsky'], 'publisher': 'Metaichmio Publications', 'publishedDate': '2018-09-20', 'description': 'Στην αφυπνιστική αυτή μελέτη, που γνώρισε τεράστια επιτυχία και προκάλεσε θύελλα συζητήσεων και δημοσιευμάτων τόσο στον διεθνή όσο και στον ελληνικό Τύπο, οι Steven Levitsky και Daniel Ziblatt, πολιτικοί επιστήμονες και καθηγητές στο Πανεπιστήμιο του Χάρβαρντ, απαριθμούν και αναλύουν τα χαρακτηριστικά σημάδια που εμφανίζονται κάθε φορά που μια δημοκρατία πνέει τα λοίσθια, ενώ κάνουν λόγο και για τα μέσα που μπορούν να αναστείλουν την ασθένεια του δημοκρατικού πολιτεύματος, επισημαίνοντας ότι οι δημοκρατίες θα επιβιώσουν μόνο αν αποφασίσουν να υπερασπιστούν τις αρχές και τα ιδεώδη τους. Οι στυγνές δικτατορίες, στρατιωτικές, φασιστικές ή κομμουνιστικές, είναι πλέον λίγες, τουλάχιστον σε μεγάλα τμήματα της ανθρωπότητας. Τα στρατιωτικά πραξικοπήματα και άλλες μορφές βίαιης κατάληψης της εξουσίας γίνονται όλο και πιο σπάνια. Οι δημοκρατίες εξακολουθούν ωστόσο να καταλύονται, να ?πεθαίνουν?, με άλλον όμως τρόπο. Μετά το τέλος του Ψυχρού Πολέμου δεν είναι τόσο οι στρατιωτικοί που πρωταγωνιστούν στην κατάλυση της δημοκρατίας όσο οι ίδιοι οι εκλεγμένοι ηγέτες. Αυτή είναι η περίπτωση όχι μόνο της Βενεζουέλας και του Τσάβες αλλά και χωρών όπως η Γεωργία, η Ουγγαρία, η Ρωσία, η Ουκρανία, η Πολωνία, η Τουρκία, το Περού, η Νικαράγουα, οι Φιλιππίνες, η Σρι Λάνκα. Η παρακμή, η ?αποψίλωση? της δημοκρατίας αρχίζει στις μέρες μας από την κάλπη. απόσπασμα από την εισαγωγή του βιβλίου Μεταξύ άλλων στο βιβλίο επισημαίνεται ότι μια από τις θεμελιώδεις προϋποθέσεις επιβίωσης της Δημοκρατίας είναι η θεσμική αυτοσυγκράτηση που (οφείλουν να) δείχνουν οι εκάστοτε κυβερνώντες. Με άλλα λόγια, δεν είναι μόνο οι τυπικοί κανόνες τους οποίους είναι υποχρεωμένοι να σέβονται, έτσι κι αλλιώς, οι άνθρωποι της εξουσίας αλλά και οι άγραφοι. Πρόκειται για άρρητους ή εθιμικούς κανόνες που έχουν καθιερωθεί μέσα από δεκαετίες ή και αιώνες θεσμικής λειτουργίας μιας Δημοκρατίας, οι οποίοι δεσμεύουν όσο και οι τυπικοί έναν πολιτικό, υπαγορεύοντάς του τι πρέπει να αποφεύγει να λέει ή να κάνει, ασχέτως αν τυπικά αυτό δεν το απαγορεύει κανένας θεσμοθετημένος νόμος. Είναι η πρώτη φορά στις μέρες μας -με την τρανταχτή εξαίρεση του μεσοπολέμου και της ανόδου των ολοκληρωτισμών- που ο βασικός κίνδυνος για τις Δημοκρατίες δεν προέρχεται από κάποια αστοχία των τυπικών κανόνων αλλά από τον τρόπο που οι ίδιοι οι φορείς της εξουσίας αντιλαμβάνονται τα όρια που θέτουν αυτοί οι κανόνες. Δημήτρης Π. Σωτηρόπουλος , υπεύθυνος της σειράς', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9786180317558'}, {'type': 'ISBN_10', 'identifier': '6180317550'}], 'readingModes': {'text': True, 'image': False}, 'pageCount': 420, 'printType': 'BOOK', 'categories': ['History'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.1.1.0.preview.2', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=AKJyDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=AKJyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'el', 'previewLink': 'http://books.google.gr/books?id=AKJyDwAAQBAJ&pg=PP1&dq=title:The+Hackers+Playbook+3&hl=&cd=7&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=AKJyDwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=AKJyDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 13.99, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 13.99, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=AKJyDwAAQBAJ&rdid=book-AKJyDwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 13990000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 13990000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/%CE%A0%CF%8E%CF%82_%CF%80%CE%B5%CE%B8%CE%B1%CE%AF%CE%BD%CE%BF%CF%85%CE%BD_%CE%BF%CE%B9_%CE%B4%CE%B7%CE%BC%CE%BF-sample-epub.acsm?id=AKJyDwAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=AKJyDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Στην αφυπνιστική αυτή μελέτη, που γνώρισε τεράστια επιτυχία και προκάλεσε θύελλα συζητήσεων και δημοσιευμάτων τόσο στον διεθνή ...'}}, {'kind': 'books#volume', 'id': 'NmmwEAAAQBAJ', 'etag': 'hrUNEJ85FRg', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/NmmwEAAAQBAJ', 'volumeInfo': {'title': 'The Deep State Encyclopedia', 'subtitle': "Exposing the Cabal's Playbook", 'authors': ['Grace Reallygraceful'], 'publisher': 'reallygraceful', 'publishedDate': '2023-03-07', 'description': 'Our country is being attacked from within. The past several years showed us that the shadow government seeks to assert absolute control over the human cattle, but what if we could stop them? What if we could take away the cabal’s power by exposing their entire playbook? Uncover the hidden web of power and influence that shapes our world with The Deep State Encyclopedia. Delve into the secrets of the shadow government, from dark occult practices to the most notorious secret societies and their unexpected famous members. Explore the titans of industry and banking who have shaped America\'s early years, as well as the controversies and scandals that still haunt their legacy. From the forces behind Bill Gates and Rockefeller Medicine, to the formation of the Federal Reserve and the scandals of the families who created the institution at Jekyll Island over a century ago, to the tactics used by mainstream media in gaslighting, manipulating, and controlling the masses, to highly censored stories about Jeffrey Epstein and his madam, Ghislaine Maxwell, as well as the real contents of the leaked Podesta emails, no topic is off-limits. With the principle that nothing and no one is above questioning, this book is a guide for those who seek to understand the masked machinations of power behind the cabal. As vital information becomes increasingly censored and hidden, this encyclopedia is your guide to peeling back the layers of secrecy and discovering the truth for yourself. Grace from the YouTube channel "reallygraceful" provides nearly 500 pages of irrefutable, highly sourced evidence of deep state doings, the motivations and mysterious religious beliefs behind their actions, and events and individuals they\'ve attempted to bury. Mystery religions are no longer a mystery… Secret societies are no longer a secret… What was once hidden will be revealed...', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9798218950880'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 488, 'printType': 'BOOK', 'categories': ['Reference'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.3.3.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=NmmwEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=NmmwEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=NmmwEAAAQBAJ&pg=PT236&dq=title:The+Hackers+Playbook+3&hl=&cd=8&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=NmmwEAAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=NmmwEAAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 9.7, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 9.7, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=NmmwEAAAQBAJ&rdid=book-NmmwEAAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 9700000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 9700000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/The_Deep_State_Encyclopedia-sample-epub.acsm?id=NmmwEAAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/The_Deep_State_Encyclopedia-sample-pdf.acsm?id=NmmwEAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=NmmwEAAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Exposing the Cabal&#39;s <b>Playbook</b> Grace Reallygraceful ... His <b>name</b> was Loyd Blankenship, a member of the <b>hacker</b> group Legion of Doom, who was assembling a tool kit for a new game called Cyberpunk.[<b>3</b>] Somewhere along the way,&nbsp;...'}}, {'kind': 'books#volume', 'id': 'JoUrEAAAQBAJ', 'etag': 'guN7juTS5Q4', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/JoUrEAAAQBAJ', 'volumeInfo': {'title': 'The Power Law', 'subtitle': 'Venture Capital and the Art of Disruption', 'authors': ['Sebastian Mallaby'], 'publisher': 'Penguin UK', 'publishedDate': '2022-01-25', 'description': 'From an award-winning financial historian comes the gripping, character-driven story of venture capital and the world it made Innovations rarely come from "experts." Jeff Bezos was not a bookseller; Elon Musk was not in the auto industry. When it comes to innovation, a legendary venture capitalist told Sebastian Mallaby, the future cannot be predicted, it can only be discovered. Most attempts at discovery fail, but a few succeed at such a scale that they more than make up for everything else. That extreme ratio of success and failure is the power law that drives venture capital, Silicon Valley, the tech sector, and, by extension, the world. Drawing on unprecedented access to the most celebrated venture capitalists of all time, award-winning financial historian Sebastian Mallaby tells the story of this strange tribe of financiers who have funded the world\'s most successful companies, from Google to SpaceX to Alibaba. With a riveting blend of storytelling and analysis, The Power Law makes sense of the seeming randomness of success in venture capital, an industry that relies, for good and ill, on gut instinct and personality rather than spreadsheets and data. We learn the unvarnished truth about some of the most iconic triumphs and infamous disasters in the history of tech, from the comedy of errors that was the birth of Apple to the venture funding that fostered hubris at WeWork and Uber to the industry\'s notorious lack of women and ethnic minorities. Now the power law echoes around the world: it has transformed China\'s digital economy beyond recognition, and London is one of the top cities for venture capital investment. By taking us so deeply into the VCs\' game, The Power Law helps us think about our own future through their eyes.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9780241356531'}, {'type': 'ISBN_10', 'identifier': '0241356539'}], 'readingModes': {'text': True, 'image': False}, 'pageCount': 376, 'printType': 'BOOK', 'categories': ['Business & Economics'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.8.8.0.preview.2', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=JoUrEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=JoUrEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=JoUrEAAAQBAJ&pg=PT137&dq=title:The+Hackers+Playbook+3&hl=&cd=9&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=JoUrEAAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=JoUrEAAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 10.99, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 10.99, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=JoUrEAAAQBAJ&rdid=book-JoUrEAAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 10990000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 10990000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/The_Power_Law-sample-epub.acsm?id=JoUrEAAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=JoUrEAAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The <b>title</b> of Zuckerberg&#39;s deck was even more insulting. “The Top Ten Reasons You Should Not Invest in Wirehog,” it ... A bit later, “Number <b>3</b>: We showed up at your office late in our pajamas.” “Number 2: Because Sean Parker is involved.'}}, {'kind': 'books#volume', 'id': '4kUHEAAAQBAJ', 'etag': 'dkJrU94UM24', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/4kUHEAAAQBAJ', 'volumeInfo': {'title': 'Design Principles for Photography', 'authors': ['Jeremy Webb'], 'publisher': 'Routledge', 'publishedDate': '2020-09-11', 'description': "In an age over-saturated with photographic imagery, Design Principles for Photography demonstrates how design awareness can add a new level of depth to your images. By adapting and experimenting with the tried and tested techniques used by graphic designers every day, you can add dynamism and impact to your imagery, whatever the style or genre - something that today's editors, curators and publishers are all crying out for.The second edition includes examples of unsuccessful compositions, annotated images highlighting key techniques and an expanded glossary. There’s also a new section on movements in photography and their reflection in composition, including modernism, expressionism, and surrealism and interviews with international practitioners discussing how they’ve included design principles in their work. Featured topics: Basic design theory; the use of space; positional decisions; the elements of design; line; shape or form; space; texture; light; colour; pattern; rhythm; contrast; scale and proportion; abstraction; movement and flow; containment; emphasis and emotion; justaposition; incongruity; mood and emotion.", 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781000213232'}, {'type': 'ISBN_10', 'identifier': '1000213234'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 226, 'printType': 'BOOK', 'categories': ['Photography'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '0.1.1.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=4kUHEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=4kUHEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=4kUHEAAAQBAJ&pg=PT85&dq=title:The+Hackers+Playbook+3&hl=&cd=10&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=4kUHEAAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=4kUHEAAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 31.79, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 22.95, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=4kUHEAAAQBAJ&rdid=book-4kUHEAAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 31790000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 22950000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Design_Principles_for_Photography-sample-epub.acsm?id=4kUHEAAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Design_Principles_for_Photography-sample-pdf.acsm?id=4kUHEAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=4kUHEAAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Wynn Bullock Hiroshi Sugimoto Uta Barth William Eggleston Suggested reading The Photographer&#39;s <b>Playbook</b> by Gregory Halpern Photography by John Ingledew Photography: The Whole Story by Juliet <b>Hacking</b> The Photographer&#39;s Eye: A Graphic&nbsp;...'}}]}