{'kind': 'books#volumes', 'totalItems': 501, 'items': [{'kind': 'books#volume', 'id': 'OL_1swEACAAJ', 'etag': 'VBkNEo5eEns', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/OL_1swEACAAJ', 'volumeInfo': {'title': 'The Adventures of Sherlock Holmes by Arthur Conan Doyle', 'authors': ['Arthur Conan Doyle'], 'publishedDate': '2017-11-28', 'description': 'Title: The Adventures of Sherlock HolmesAuthor: Arthur Conan DoyleLanguage: English', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1981205985'}, {'type': 'ISBN_13', 'identifier': '9781981205981'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 378, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=OL_1swEACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&cd=1&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=OL_1swEACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Sherlock_Holmes_by_Art.html?hl=&id=OL_1swEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=OL_1swEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Title: The Adventures of Sherlock HolmesAuthor: Arthur Conan DoyleLanguage: English'}}, {'kind': 'books#volume', 'id': 'spdrEAAAQBAJ', 'etag': '3G6blHoYsZg', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/spdrEAAAQBAJ', 'volumeInfo': {'title': 'Sherlock Holmes Collection: All Time Bestseller Stories and Novels of Sherlock Holmes by Arthur Conan Doyle', 'subtitle': 'THE ADVENTURE OF THE CARDBOARD BOX/ THE ADVENTURE OF THE RED CIRCLE/ THE HOUND OF THE BASKERVILLES/ THE SIGN OF THE FOUR/ THE VALLEY OF FEAR/ HIS LAST BOW / Short Stories for High School/ The White Company/ The Coming of the Fairies/ The Adventure of the Bruce-Partington Plans/ A Study in Scarlet/ Tales of Terror and Mystery/ The Parasite/ The Disintegration Machine/ The Memoirs of Sherlock Holmes/ THE ADVENTURES OF SHERLOCK HOLMES/ The Casebook of Sherlock Holmes/ The Return of Sherlock Holmes', 'authors': ['ARTHUR CONAN DOYLE'], 'publisher': 'BEYOND BOOKS HUB', 'publishedDate': '2022-04-19', 'description': 'THE ADVENTURE OF THE CARDBOARD BOX "The Adventure of the Cardboard Box" is one of the 56 short Sherlock Holmes stories written by British author Sir Arthur Conan Doyle. It is the second of the twelve Memoirs of Sherlock Holmes in most British editions of the canon, and the second of the eight stories from His Last Bow in most American versions. The story was first published in The Strand Magazine in 1892. Craving a classic mystery tale? You can\'t go wrong with Arthur Conan Doyle, a towering figure in the origination of the detective fiction genre. This short story features master detective Sherlock Holmes attempting to pinpoint the origins of a mysterious and gory parcel. THE ADVENTURE OF THE RED CIRCLE "Well, Mrs. Warren, I cannot see that you have any particular cause for uneasiness, nor do I understand why I, whose time is of some value, should interfere in the matter. I really have Other things to engage me." So spoke Sherlock Holmes and turned back to the great scrapbook in which he was arranging and indexing some of his recent material. But the landlady had the pertinacity and also the cunning of her sex. She held her ground firmly. "You arranged an affair for a lodger of mine last year," she said--"Mr. Fairdale Hobbs." "Ah, yes--a simple matter. When you\'re in the mood for a classic Sherlock Holmes story, nothing else will do. In this tightly plotted tale, the services of the famed super-sleuth are solicited by a distraught landlady. At her behest, Holmes and Watson investigate the case of a mysterious lodger who may not be what he appears to be. THE HOUND OF THE BASKERVILLES The Hound of the Baskervilles is the third of the four crime novels written by Sir Arthur Conan Doyle featuring the detective Sherlock Holmes. Originally serialised in The Strand Magazine from August 1901 to April 1902, it is set largely on Dartmoor in Devon in England\'s West Country and tells the story of an attempted murder inspired by the legend of a fearsome, diabolical hound of supernatural origin. Sherlock Holmes and his companion Dr. Watson investigate the case. This was the first appearance of Holmes since his apparent death in "The Final Problem", and the success of The Hound of the Baskervilles led to the character\'s eventual revival.One of the most famous stories ever written, in 2003, the book was listed as number 128 of 200 on the BBC\'s The Big Read poll of the UK\'s "best-loved novel". In 1999, it was listed as the top Holmes novel, with a perfect rating from Sherlockian scholars of 100. THE SIGN OF THE FOUR The Sign of the Four (1890), also called The Sign of Four, is the second novel featuring Sherlock Holmes written by Sir Arthur Conan Doyle. Doyle wrote four novels and 56 short stories featuring the fictional detective. Set in 1888, The Sign of the Four has a complex plot involving service in India, the Indian Mutiny of 1857, a stolen treasure, and a secret pact among four convicts ("the Four" of the title) and two corrupt prison guards. It presents Holmes\'s drug habit and humanizes him in a way that had not been done in the preceding novel, A Study in Scarlet (1887). It also introduces Dr. Watson\'s future wife, Mary Morstan. According to Mary, in December 1878, her father had telegraphed her upon his safe return from India and requested her to meet him at the Langham Hotel in London. When Mary arrived at the hotel, she was told her father had gone out the previous night and not returned. Despite all efforts, no trace was ever found of him. Mary contacted her father\'s only friend who was in the same regiment and had since retired to England, one Major John Sholto, but he denied knowing her father had returned. The second puzzle is that she has received six pearls in the mail from an anonymous benefactor, one per year since 1882, after answering an anonymous newspaper query inquiring for her. With the last pearl she received a letter remarking that she has been wronged and asking for a meeting. Holmes takes the case and soon discovers that Major Sholto had died in 1882 and that within a short span of time Mary began to receive the pearls, implying a connection. The only clue Mary can give Holmes is a map of a fortress found in her father\'s desk with the names of Jonathan Small, Mahomet Singh, Abdullah Khan and Dost Akbar. THE VALLEY OF FEAR The Valley of Fear is the fourth and final Sherlock Holmes novel by Sir Arthur Conan Doyle. It is loosely based on the Molly Maguires and Pinkerton agent James McParland. The story was first published in the Strand Magazine between September 1914 and May 1915. The first book edition was copyrighted in 1914, and it was first published by George H. Doran Company in New York on 27 February 1915, and illustrated by Arthur I. Keller. ‘The greatest schemer of all time, the organizer of every deviltry, the controlling brain of the underworld, a brain which might have made or marred the destiny of nations – that\'s the man!’ Summoned to a mysterious manor house by one of the henchmen of his arch nemesis, Professor Moriarty, Holmes and Watson find themselves confronted by the scene of a brutal murder. But the brilliant Holmes soon reveals that there is much more to this case than first meets the eye… First published as a serialisation in The Strand Magazine between 1914 and 1915, this fourth and final Sherlock Holmes novel will delight fans of Conan Doyle’s legendary detective and his faithful sidekick Watson. HIS LAST BOW "His Last Bow. The War Service of Sherlock Holmes", later titled "His Last Bow: An Epilogue of Sherlock Holmes", is one of 56 short stories about Sherlock Holmes written by Sir Arthur Conan Doyle. It was first published in September 1917 in The Strand Magazine and collected as the last of an anthology of eight stories titled His Last Bow: Some Reminiscences of Sherlock Holmes the following month. The narration is in the third person, instead of the first-person narration usually provided by the character of Dr. Watson, and it is a spy story, rather than a detective mystery. Due to its portrayal of British and German spies on the eve of war, its publication during the First World War, and its patriotic themes, the story has been interpreted as a propaganda tool intended to boost morale for British readers On the eve of World War I. A German agent awaits one last package containing valuable naval signals before he prepares to leave for Berlin. A London landlady has a mysterious tenant who is never seen to emerge from his room. A rich elderly woman disappears from her home. The highly confidential plans to build a submarine are missing though ten pages are found near the body of a naval clerk. These mysteries and many more are brought to the house on Baker Street where Sherlock Holmes resides. But no case is too tricky for the world\'s most famous sleuth and his incredible powers of deduction. \'His Last Bow\', the title story of this collection, tells how Sherlock Holmes is brought out of retirement to help the Government fight the German threat at the approach of the First World War. The Prime Minister himself requests Holmes\'s services to hunt down the remarkable German agent, Von Bork. Several of the detective\'s earlier cases complete the volume, including \'Wisteria Lodge\', \'The Bruce-Partington Plans\', and \'The Disappearance of Lady Frances Carfax\'. In \'The Dying Detective\', Dr Watson is horrified to discover Holmes at death\'s door from a mysterious tropical disease as his friend lays a trap for a murderer Short Stories for High School Why must we confine the reading of our children to the older literary classics? This is the question asked by an ever-increasing number of thoughtful teachers. They have no wish to displace or to discredit the classics. On the contrary, they love and revere them. But they do wish to give their pupils something additional, something that pulses with the present life, that is characteristic of today. The children, too, wonder that, with the great literary outpouring going on about them, they must always fill their cups from the cisterns of the past. The short story is specially adapted to supplement our high-school reading. It is of a piece with our varied, hurried, efficient American life, wherein figure the business man’s lunch, the dictagraph, the telegraph, the telephone, the automobile, and the railway “limited.” It has achieved high art, yet conforms to the modern demand that our literature—since it must be read with despatch if read at all—be compact and compelling. Moreover, the short story is with us in almost overwhelming numbers and is probably here to stay. Indeed, our boys and girls are somewhat appalled at the quantity of material from which they must select their reading, and welcome any instruction that enables them to know the good from the bad. It is certain, therefore, that, whatever else they may throw into the educational discard when they leave the high school, they will keep and use anything they may have learned about this form of literature which has become so powerful a factor in our daily life. This book does not attempt to select the greatest stories of the time. What tribunal would dare make such a choice? Nor does it attempt to trace the evolution of the short story or to point out natural types and differences. These topics are better suited to college classes. Its object is threefold: to supply interesting reading belonging to the student’s own time, to help him to see that there is no divorce between classic and modern literature, and, by offering him material structurally good and typical of the qualities represented, to assist him in discriminating between the artistic and the inartistic. The stories have been carefully selected, because in the period of adolescence “nothing read fails to leave its mark”; they have also been carefully arranged with a view to the needs of the adolescent boy and girl. Stories of the type loved by primitive man, and therefore easily approached and understood, have been placed first. Those which appeared in periods of higher development follow, roughly in the order of their increasing difficulty. It is hoped, moreover, that this arrangement will help the student to understand and appreciate the development of the story. He begins with the simple tale of adventure and the simple story of character. As he advances he sees the story develop in the plot, in character analysis, and in setting, until he ends with the psychological study of Markheim, remarkable for its complexity of motives and its great spiritual problem. Both the selection and the arrangement have been made with this further purpose in view—“to keep the heart warm, reinforcing all its good motives, performing choices, universalizing sympathies.” It is a pleasure to acknowledge, in this connection, the suggestions and the criticism of Mr. William N. Otto, Head of the Department of English in Shortridge High School, Indianapolis; and the courtesies of the publishers who have permitted the use of their material. The White Company One of Arthur Conan Doyle\'s lesser known works, The White Company is a historical novel that is set during the Hundred Years War - a series of conflicts in the 14th and 15th centuries between the House of Plantaganet and the House of Valois. The novel in particular tells of Edward, the Black Prince and his attempts to restore Peter of Castille to his throne. The name of the book comes from a group of archers (The White Company) and is taken from an actual group of merceneries from the 14th century. The book is supposed to be read alongside Doyle\'s Sir Nigel, about a knight (based on Sir Neil Loring) - and this character also features in this book. As well as many fictional characters, The White Company includes some real life historical figures, such as John of Gaunt, Edward III, Thomas Percy, and Henry II of Castille. Doyle regarded this novel, as well as his other historical ones, higher than he did his books about Sherlock Holmes, and it was popular up until the time of WWII. He wrote the book after attending a lecture about the Middle Ages, and after much research, it was first serialised in Cornhill Magazine. The Coming of the Fairies Best remembered for his creation of Sherlock Holmes, the world\'s first consulting detective and a dedicated adherent to logic, Sir Arthur Conan Doyle in later life became fascinated by the occult. The Adventure of the Bruce-Partington Plans A thick smog has fallen over London. Mycroft comes to visit his brother Sherlock Holmes, asking for his help. A ten-page secret document has gone missing and three pages have just been found... in the pocket of Arthur Cadogan West?s lifeless body. He was discovered near Aldgate tube station with his head smashed in and with only a little money, the confidential pages, and theatre tickets on him. Strangely, he had no Underground ticket. The document is a construction plan for the Bruce-Partington submarine and it is feared that the document may fall into enemy hands. "The Adventure of the Bruce-Partington Plans" is part of "His Last Bow". A Study in Scarlet A Study in Scarlet is an 1887 detective novel written by Arthur Conan Doyle. The story marks the first appearance of Sherlock Holmes and Dr. Watson, who would become the most famous detective duo in literature. The book\'s title derives from a speech given by Holmes, a consulting detective, to his friend and chronicler Watson on the nature of his work, in which he describes the story\'s murder investigation as his "study in scarlet": "There\'s the scarlet thread of murder running through the colourless skein of life, and our duty is to unravel it, and isolate it, and expose every inch of it." The story, and its main characters, attracted little public interest when it first appeared. Only 11 complete copies of the magazine in which the story first appeared, Beeton\'s Christmas Annual for 1887, are known to exist now and they have considerable value. Although Conan Doyle wrote 56 short stories featuring Holmes, A Study in Scarlet is one of only four full-length novels in the original canon. The novel was followed by The Sign of the Four, published in 1890. A Study in Scarlet was the first work of detective fiction to incorporate the magnifying glass as an investigative tool. Tales of Terror and Mystery A collection of short stories that don\'t feature Doyle\'s most famous creation, Sherlock Holmes. Stories include: The Horror Of The Heights; The Leather Funnel; The New Catacomb; The Case Of Lady Sannox; The Terror Of Blue John Gap; The Brazilian Cat; The Lost Special; The Beetle-Hunter; The Man With The Watches; The Japanned Box; The Black Doctor; and, The Jew\'s Breastplate. This volume presents some of Conan Doyle s unduly neglected masterworks. Each begins in a quietly factual way, making all the more dramatic the crescendo of fear and puzzlement that ensues as each new circumstance is revealed. Even without his supremely logical brain child, Sherlock Holmes, Conan Doyle shows that his tales are unbeatable for thrills and excitement. The Parasite The Parasite is about a young man known as Austin Gilroy, who studies physiology and knows a professor who is studying the occult. The young man is introduced to a middle-aged woman known as Miss Penclosa, who has a crippled leg and psychic powers. And some other stuff happens. The Disintegration Machine The Disintegration Machine is the last story in the Professor Challenger series. It was first published in Strand Magazine in January 1929. The story centers around the discovery of a machine capable of disintegrating objects and reforming them as they were. The Memoirs of Sherlock Holmes The memoirs of Sherlock Holmes see Sherlock Holmes and his friend, Dr. Watson, pursuing the strangest of cases across Britain once again. This edition boasts of stories where Holmes deals with challenges that defy the understanding of most people. Conan Doyle’s genius shines through as he spins tales and shapes them around the extraordinary ability of Holmes. The bizarre cases that Holmes takes up are fascinating, for they fall beyond the mundane. Indulge children in this volume of stories that have enthralled readers over generations. Sherlock Holmes and Dr. Watson have once again taken up some of the most intriguing cases. Join them as they investigate disappearances, violent murders, and burglary and solve the mystery of a strange yellow-faced figure and an unusual business agreement. A collection of eleven short stories, The Memoirs of Sherlock Holmes introduces Mycroft, Holmes’ elder brother, in ‘The Adventure of the Greek Interpreter,’ and Professor James Moriarty, the criminal mastermind and Holmes’ archenemy, in ‘The Adventure of the Final Problem.’ The stories continue to thrill their readers. THE ADVENTURES OF SHERLOCK HOLMES The Adventures of Sherlock Holmes is a collection of twelve short stories by Arthur Conan Doyle, first published on 14 October 1892. It contains the earliest short stories featuring the consulting detective Sherlock Holmes, which had been published in twelve monthly issues of The Strand Magazine from July 1891 to June 1892. The stories are collected in the same sequence, which is not supported by any fictional chronology. The only characters common to all twelve are Holmes and Dr. Watson and all are related in the first-person narrative from Watson\'s point of view. In general, the stories in The Adventures of Sherlock Holmes identify and try to correct social injustices. Holmes is portrayed as offering a new, fairer sense of justice. The stories were well received, and boosted the subscriptions figures of The Strand Magazine, prompting Doyle to be able to demand more money for his next set of stories. The first story, "A Scandal in Bohemia", includes the character of Irene Adler, who, despite being featured only within this one story by Doyle, is a prominent character in modern Sherlock Holmes adaptations, generally as a love interest for Holmes. Doyle included four of the twelve stories from this collection in his twelve favourite Sherlock Holmes stories, picking "The Adventure of the Speckled Band" as his overall favourite. The Casebook of Sherlock Holmes The Case-Book of Sherlock Holmes is the final set of twelve Sherlock Holmes short stories (56 total) by Arthur Conan Doyle first published in the Strand Magazine between October 1921 and April 1927. It includes 12 stories: The Adventure Of The Mazarin Stone; The Problem Of Thor Bridge; The Adventure Of The Creeping Man; The Adventure Of The Sussex Vampire; The Adventure Of The Three Garridebs; The Adventure Of The Illustrious Client; The Adventure Of The Blanched Soldier; The Adventure Of The Retired Colourman; The Adventure Of The Three Gables; The Adventure Of The Lion\'s Mane; The Adventure Of The Veiled Lodger; and, The Adventure Of Shoscombe Old Place (the last Sherlock Holmes story written by Arthur Conan Doyle to be published). The Return of Sherlock Holmes Thirteen classic Sherlock Holmes mysteries, complete and unabridged, in a newly packaged electronic edition - featuring full-page illustrations by Frederic Dorr Steele (the premiere American illustrator of the Sherlock Holmes stories) and a ten page introduction by Andrew Malec. Steele\'s illustrations - modelled upon the features of William Gillette - add colour and spice to Doyle\'s tales. Witness Holmes\' dramatic return; observe the downfall of Milverton, \'king of blackmailers\'; and crack the cryptic message of the Dancing Men - all the while, allowing Steele\'s beautiful and thoughtful illustrations to bring your imagination to life. The Return of Sherlock Holmes is a collection of 13 stories. This was the first collection since 1893, when Holmes had died in The Final Problem. Having published The Hound of the Baskervilles, Doyle came under intense pressure to revive his famous character. The first story is set in 1894 and has Holmes returning in London and explaining the period from 1891–94, a period called \'The Great Hiatus\' by Sherlockian enthusiasts. Also of note is Watson\'s statement in the last story of the cycle that Holmes has retired, and forbids him to publish any more stories.', 'readingModes': {'text': False, 'image': True}, 'printType': 'BOOK', 'categories': ['Fiction'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '0.1.1.0.preview.1', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=spdrEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=spdrEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=spdrEAAAQBAJ&printsec=frontcover&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&cd=2&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=spdrEAAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=spdrEAAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 1.29, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 1.29, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=spdrEAAAQBAJ&rdid=book-spdrEAAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 1290000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 1290000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Sherlock_Holmes_Collection_All_Time_Best-sample-pdf.acsm?id=spdrEAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=spdrEAAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'This book does not attempt to select the greatest stories of the time. What tribunal would dare make such a choice? Nor does it attempt to trace the evolution of the short story or to point out natural types and differences.'}}, {'kind': 'books#volume', 'id': 'Nm-UwgEACAAJ', 'etag': 's/KOo0xraVU', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/Nm-UwgEACAAJ', 'volumeInfo': {'title': 'The Adventures of Sherlock Holmes', 'authors': ['Arthur Conan Doyle'], 'publishedDate': '2019-02-23', 'description': 'The Adventures of Sherlock Holmes Sherlock Holmes is one of the great characters of literature - who can resist the aloof arrogance and limitless self-satisfaction which stems from that intellectual superiority with which he squishes all the dodgy baronets and rum foreign coves that turn up in the mysteries presented to him by the clients who never fail, when recounting their tangled tales, to speak in perfect paragraphs full of precisely recollected speech in a style exactly like a Conan Doyle story? The Adventures of Sherlock Holmes is a collection of twelve short stories by Arthur Conan Doyle, featuring his fictional detective Sherlock Holmes. It was first published on 14 October 1892, though the individual stories had been serialised in "The Strand Magazine" between June 1891 and July 1892. The stories are not in chronological order, and the only characters common to all twelve are Holmes and Dr. Watson. Sir Arthur set many of the patterns which can still be observed in the modern genre novel. It takes an actual genius to create such a vivid and convincing fictional genius and Doyle does it in a masterful way. Facts and Trivia: 1. Sherlock Holmes has been adapted numerous times for both films and plays, and the character has been played by over 70 different actors in more than 200 films. A number of film and television series have borne the title "The Adventures of Sherlock Holmes", but some of these are either original stories, combinations of a number of Doyle\'s stories, or in one case, an adaptation of The Sign of the Four. 2. Doyle\'s first Sherlock Holmes story, was published by Ward Lock & Co. The novel was well received, but Doyle was paid little for it, and despite a sequel novel, The Sign of the Four, also being published by Ward Lock, he shifted his focus to short stories.', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1797889133'}, {'type': 'ISBN_13', 'identifier': '9781797889139'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 226, 'printType': 'BOOK', 'categories': ['Fiction'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=Nm-UwgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=Nm-UwgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=Nm-UwgEACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&cd=3&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=Nm-UwgEACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Sherlock_Holmes.html?hl=&id=Nm-UwgEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=Nm-UwgEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The stories are not in chronological order, and the only characters common to all twelve are Holmes and Dr. Watson. Sir Arthur set many of the patterns which can still be observed in the modern genre novel.'}}, {'kind': 'books#volume', 'id': 'taQQMQAACAAJ', 'etag': 'hsNdisv9uNw', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/taQQMQAACAAJ', 'volumeInfo': {'title': 'The Casebook of Sherlock Holmes Arthur Conan Doyle', 'authors': ['Arthur Conan Doyle'], 'publishedDate': '2016-12-11', 'description': 'The Case-Book of Sherlock Holmes is the final set of twelve (out of a total of fifty-six) Sherlock Holmes short stories by Arthur Conan Doyle first published in the Strand Magazine between October 1921 and April 1927.The first British edition and the first American edition of the collection were both published in June 1927. However, they had slightly different titles. The title of the British collection was The Case-Book of Sherlock Holmes (hyphenated "Case-Book"), whereas title of the American was The Case Book of Sherlock Holmes ("Case Book" as two words).Further confusing the issue of the title, some later publishers published the collection under the title The Casebook of Sherlock Holmes ("Casebook" as a single word).', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '154106187X'}, {'type': 'ISBN_13', 'identifier': '9781541061873'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 304, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=taQQMQAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=taQQMQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=taQQMQAACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&cd=4&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=taQQMQAACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Casebook_of_Sherlock_Holmes_Arthur_C.html?hl=&id=taQQMQAACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=taQQMQAACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The Case-Book of Sherlock Holmes is the final set of twelve (out of a total of fifty-six) Sherlock Holmes short stories by Arthur Conan Doyle first published in the Strand Magazine between October 1921 and April 1927.The first British ...'}}, {'kind': 'books#volume', 'id': 'Li5nuQEACAAJ', 'etag': 'zBv3/tlNhmI', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/Li5nuQEACAAJ', 'volumeInfo': {'title': 'The Adventures of Gerard', 'authors': ['Arthur Conan Doyle'], 'publisher': 'Createspace Independent Publishing Platform', 'publishedDate': '2018-07-11', 'description': 'The Adventures of Gerard By Sir Arthur Conan Doyle Lang: - eng, Pages 351. Reprinted in 2015 with the help of original edition published long back[1903]. This book is in black & white, Hardcover, sewing binding for longer life with Matt laminated multi-Colour Dust Cover, Printed on high quality Paper, re-sized as per Current standards, professionally processed without changing its contents. As these are old books, there may be some pages which are blur or missing or black spots. We expect that you will understand our compulsion in these books. We found this book important for the readers who want to know more about our old treasure so we brought it back to the shelves. Hope you will like it and give your comments and suggestions. Title: The adventures of Gerard 1903 [Hardcover], Author: Doyle, Arthur Conan, Sir, We are delighted to publish this classic book as part of our extensive Classic Library collection. Many of the books in our collection have been out of print for decades, and therefore have not been accessible to the general public. The aim of our publishing program is to facilitate rapid access to this vast reservoir of literature, and our view is that this is a significant literary work, which deserves to be brought back into print after many decades. The contents of the vast majority of titles in the Classic Library have been scanned from the original works. To ensure a high quality product, each title has been meticulously hand curated by our staff. Our philosophy has been guided by a desire to provide the reader with a book that is as close as possible to ownership of the original work. We hope that you will enjoy this wonderful classic work, and that for you it becomes an enriching experience.', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1722820772'}, {'type': 'ISBN_13', 'identifier': '9781722820770'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 84, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=Li5nuQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=Li5nuQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=Li5nuQEACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&cd=5&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=Li5nuQEACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Adventures_of_Gerard.html?hl=&id=Li5nuQEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=Li5nuQEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'As these are old books, there may be some pages which are blur or missing or black spots. We expect that you will understand our compulsion in these books.'}}, {'kind': 'books#volume', 'id': 'U6b0vQAACAAJ', 'etag': 'GkOTGFFsCi4', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/U6b0vQAACAAJ', 'volumeInfo': {'title': 'The Casebook of Sherlock Holmes', 'subtitle': 'Sherlock Holmes #8', 'authors': ['Arthur Conan Doyle'], 'publisher': 'Createspace Independent Publishing Platform', 'publishedDate': '2016-07-24', 'description': 'The Case-Book of Sherlock Holmes is the final set of twelve Sherlock Holmes short stories (56 in total) by Arthur Conan Doyle first published in the Strand Magazine between October 1921 and April 1927. The first British edition and the first American edition of the collection were both published in June 1927. However, they had slightly different titles. The title of the British collection was The Case-Book of Sherlock Holmes (hyphenated "Case-Book"), whereas title of the American was The Case Book of Sherlock Holmes ("Case Book" as two words). Further confusing the issue of the title, some later publishers published the collection under the title The Casebook of Sherlock Holmes ("Casebook" as a single word).', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1535504862'}, {'type': 'ISBN_13', 'identifier': '9781535504867'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 138, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=U6b0vQAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=U6b0vQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=U6b0vQAACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&cd=6&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=U6b0vQAACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Casebook_of_Sherlock_Holmes.html?hl=&id=U6b0vQAACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=U6b0vQAACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The Case-Book of Sherlock Holmes is the final set of twelve Sherlock Holmes short stories (56 in total) by Arthur Conan Doyle first published in the Strand Magazine between October 1921 and April 1927.'}}, {'kind': 'books#volume', 'id': 'sAc2MQAACAAJ', 'etag': 'QEaehdSbc68', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/sAc2MQAACAAJ', 'volumeInfo': {'title': 'The Casebook of Sherlock Holmes', 'subtitle': 'By Arthur Conan Doyle - Illustrated', 'authors': ['Arthur Conan Arthur Conan Doyle'], 'publishedDate': '2016-12-16', 'description': 'Why buy our paperbacks? Printed in USA on High Quality Paper Standard Font size of 10 for all books Fulfilled by Amazon Expedited shipping 30 Days Money Back Guarantee Unabridged (100% Original content) BEWARE OF LOW-QUALITY SELLERS Don\'t buy cheap paperbacks just to save a few dollars. Most of them use low-quality papers & binding. Their pages fall off easily. Some of them even use very small font size of 6 or less to increase their profit margin. It makes their books completely unreadable. About The Casebook Of Sherlock Holmes by Arthur Conan Doyle The Case-Book of Sherlock Holmes is the final set of twelve Sherlock Holmes short stories (56 in total) by Arthur Conan Doyle first published in the Strand Magazine between October 1921 and April 1927.The first British edition and the first American edition of the collection were both published in June 1927. However, they had slightly different titles. The title of the British collection was The Case-Book of Sherlock Holmes (hyphenated "Case-Book"), whereas title of the American was The Case Book of Sherlock Holmes ("Case Book" as two words). Further confusing the issue of the title, some later publishers published the collection under the title The Casebook of Sherlock Holmes ("Casebook" as a single word).', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1541103696'}, {'type': 'ISBN_13', 'identifier': '9781541103696'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 218, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=sAc2MQAACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&cd=7&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=sAc2MQAACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Casebook_of_Sherlock_Holmes.html?hl=&id=sAc2MQAACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=sAc2MQAACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'About The Casebook Of Sherlock Holmes by Arthur Conan Doyle The Case-Book of Sherlock Holmes is the final set of twelve Sherlock Holmes short stories (56 in total) by Arthur Conan Doyle first published in the Strand Magazine between October ...'}}, {'kind': 'books#volume', 'id': 'v9sZAgAAQBAJ', 'etag': 'KNgr9uSz+PQ', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/v9sZAgAAQBAJ', 'volumeInfo': {'title': 'Collected Works of Sir Arthur Conan Doyle (Delphi Classics)', 'authors': ['Sir Arthur Conan Doyle'], 'publisher': 'Delphi Classics', 'publishedDate': '2013-11-17', 'description': "Finally, the great literary giant Sir Arthur Conan Doyle receives the scholarly Delphi Classics treatment. This comprehensive eBook offers the most complete edition possible Sir Arthur Conan Doyle's works in the US. Features: * the most complete edition possible due to US copyright restrictions * annotated with concise introductions to the novels and other texts * illustrated with the original Sherlock Holmes images * images of how the books first appeared, giving your EReader a taste of the Victorian texts * ALMOST all of the Sherlock Holmes stories (due to copyright) – even the rare and unfinished THE ADVENTURE OF THE TALL MAN * the rare comic opera Conan Doyle collaborated on with Peter Pan author J.M. Barrie * ALL of the short stories and short story collections have their own unique contents tables – choose from a vast range of amazing and rare short stories * rare non-fiction texts * Conan Doyle’s historic war treatises with maps and more * scholarly ordering of texts into chronological order and literary genres * features five rare plays by Conan Doyle, including SHERLOCK HOLMES - explore the Great Man's theatrical talents! * scarce non-fiction works, including the GEORGE EDALJI and OSCAR SLATER real-life crime cases that Conan Doyle helped solve! * UPDATED with rare works and stories Please visit www.delphiclassics.com for more information and to browse our exciting titles. The Sherlock Holmes Collections SHERLOCK HOLMES: AN INTRODUCTION A STUDY IN SCARLET THE SIGN OF THE FOUR THE ADVENTURES OF SHERLOCK HOLMES THE MEMOIRS OF SHERLOCK HOLMES THE HOUND OF THE BASKERVILLES THE RETURN OF SHERLOCK HOLMES THE VALLEY OF FEAR HIS LAST BOW THE FIELD BAZAAR HOW WATSON LEARNT THE TRICK THE ADVENTURE OF THE TALL MAN The Sherlock Holmes Stories The Challenger Works THE LOST WORLD THE POISON BELT Historical Novels MICAH CLARKE THE WHITE COMPANY THE GREAT SHADOW THE REFUGEES RODNEY STONE UNCLE BERNAC SIR NIGEL Other Novels and Novellas THE MYSTERY OF CLOOMBER THE FIRM OF GIRDLESTONE THE DOINGS OF RAFFLES HAW BEYOND THE CITY THE PARASITE THE STARK MUNRO LETTERS THE TRAGEDY OF THE KOROSKO A DUET The Short Story Collections THE CAPTAIN OF THE POLESTAR AND OTHER TALES. THE GREAT KEINPLATZ EXPERIMENT AND OTHER TALES OF TWILIGHT AND THE UNSEEN MY FRIEND THE MURDERER AND OTHER MYSTERIES AND ADVENTURES THE GULLY OF BLUEMANSDYKE AND OTHER STORIES ROUND THE RED LAMP THE GREEN FLAG AND OTHER STORIES THE EXPLOITS OF BRIGADIER GERARD THE ADVENTURES OF GERARD ROUND THE FIRE STORIES THE LAST OF THE LEGIONS AND OTHER TALES OF LONG AGO THE LAST GALLEY DANGER! AND OTHER STORIES TALES OF TERROR AND MYSTERY THE DEALINGS OF CAPTAIN SHARKEY AND OTHER TALES OF PIRATES THE MAN FROM ARCHANGEL AND OTHER TALES OF ADVENTURE UNCOLLECTED SHORT STORIES The Short Stories LIST OF SHORT STORIES IN CHRONOLOGICAL ORDER LIST OF SHORT STORIES IN ALPHABETICAL ORDER The Opera JANE ANNIE, OR THE GOOD CONDUCT PRIZE The Plays WATERLOO SHERLOCK HOLMES THE SPECKLED BAND THE CROWN DIAMOND THE JOURNEY The Poetry SONGS OF ACTION SONGS OF THE ROAD THE GUARDS CAME THROUGH The Non Fiction THE GREAT BOER WAR THE WAR IN SOUTH AFRICA THROUGH THE MAGIC DOOR THE CRIME OF THE CONGO THE CASE OF MR. GEORGE EDALJI THE CASE OF MR. OSCAR SLATER THE HOLOCAUST OF MANOR PLACE THE BRAVOES OF MARKET-DRAYTON THE DEBATABLE CASE OF MRS. EMSLEY THE LOVE AFFAIR OF GEORGE VINCENT PARKER THE BRITISH CAMPAIGN IN FRANCE AND FLANDERS VOLUMES I-VI A VISIT TO THREE FRONTS. JUNE 1916 A GLIMPSE OF THE ARMY GREAT BRITAIN AND THE NEXT WAR THE FUTURE OF CANADIAN LITERATURE THE NEW REVELATION THE VITAL MESSAGE THE WANDERINGS OF A SPIRITUALIST THE COMING OF THE FAIRIES", 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781908909152'}, {'type': 'ISBN_10', 'identifier': '1908909153'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 10151, 'printType': 'BOOK', 'categories': ['Fiction'], 'averageRating': 1, 'ratingsCount': 1, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.15.12.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=v9sZAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=v9sZAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=v9sZAgAAQBAJ&printsec=frontcover&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&cd=8&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=v9sZAgAAQBAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Collected_Works_of_Sir_Arthur_Conan_Doyl.html?hl=&id=v9sZAgAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Collected_Works_of_Sir_Arthur_Conan_Doyl-sample-epub.acsm?id=v9sZAgAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Collected_Works_of_Sir_Arthur_Conan_Doyl-sample-pdf.acsm?id=v9sZAgAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=v9sZAgAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'This comprehensive eBook offers the most complete edition possible Sir Arthur Conan Doyle&#39;s works in the US. Features: * the most complete edition possible due to US copyright restrictions * annotated with concise introductions to the ...'}}, {'kind': 'books#volume', 'id': '7065tAEACAAJ', 'etag': 'jjoUUMEEsfo', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/7065tAEACAAJ', 'volumeInfo': {'title': 'The Casebook of Sherlock Holmes', 'authors': ['Arthur Conan Doyle'], 'publishedDate': '2017-07-04', 'description': 'The Case-Book of Sherlock Holmes is the final set of twelve (out of a total of fifty-six) Sherlock Holmes short stories by Arthur Conan Doyle first published in the Strand Magazine between October 1921 and April 1927.The first British edition and the first American edition of the collection were both published in June 1927. However, they had slightly different titles. The title of the British collection was The Case-Book of Sherlock Holmes (hyphenated "Case-Book"), whereas the title of the American edition was The Case Book of Sherlock Holmes ("Case Book" as two words).Further confusing the issue of the title, some later publishers released the collection under the title The Casebook of Sherlock Holmes ("Casebook" as a single word).', 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '1548431443'}, {'type': 'ISBN_13', 'identifier': '9781548431440'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 220, 'printType': 'BOOK', 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=7065tAEACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&cd=9&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=7065tAEACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Casebook_of_Sherlock_Holmes.html?hl=&id=7065tAEACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=7065tAEACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'The Case-Book of Sherlock Holmes is the final set of twelve (out of a total of fifty-six) Sherlock Holmes short stories by Arthur Conan Doyle first published in the Strand Magazine between October 1921 and April 1927.The first British ...'}}, {'kind': 'books#volume', 'id': 'mWZLPgAACAAJ', 'etag': 'k/ZFjTljTBM', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/mWZLPgAACAAJ', 'volumeInfo': {'title': 'The Complete Sherlock Holmes', 'authors': ['Arthur Conan Doyle'], 'publisher': 'Vintage Classic', 'publishedDate': '2009', 'description': "DIVDIVDIVDIVFrom The Adventure of the Gloria Scott to His Last Bow we follow the illustrious career of this quintessential British hero from his university days to his final case. Sherlock Holmes's efforts to uncover the truth take him all over the world and into conflict with all manner of devious criminals and dangerous villains, but thankfully his legendary powers of deduction and his faithful companion Dr. Watson are more than up to the challenge.DIVDIVDIVDIVSir Arthur Conan Doyle (1859–1930) produced more than 30 books, 150 short stories, poems, plays and essays across a wide range of genres. His most famous creation is the detective Sherlock Holmes, who he introduced in his first novelA Study in Scarlet. P. D. James is an award-winning author whose titles includeDeath in Holy Orders,The Lighthouse, andThe Murder Room.", 'industryIdentifiers': [{'type': 'ISBN_10', 'identifier': '0099529939'}, {'type': 'ISBN_13', 'identifier': '9780099529934'}], 'readingModes': {'text': False, 'image': False}, 'pageCount': 0, 'printType': 'BOOK', 'categories': ['Detective and mystery stories'], 'averageRating': 4, 'ratingsCount': 46, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=mWZLPgAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=mWZLPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=mWZLPgAACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&cd=10&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=mWZLPgAACAAJ&dq=title:The+Adventures+of+Sherlock+Holmes+by+Arthur+Conan+Doyle&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/The_Complete_Sherlock_Holmes.html?hl=&id=mWZLPgAACAAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'NO_PAGES', 'embeddable': False, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': False}, 'webReaderLink': 'http://play.google.com/books/reader?id=mWZLPgAACAAJ&hl=&source=gbs_api', 'accessViewStatus': 'NONE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'This oversized commemorative volume contains the entire canon of Holmes adventures, both before and after his creator&#39;s attempt to dispatch him in print.'}}]}