{'kind': 'books#volumes', 'totalItems': 361, 'items': [{'kind': 'books#volume', 'id': 'PJZGDwAAQBAJ', 'etag': 'QM/Esey06G0', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/PJZGDwAAQBAJ', 'volumeInfo': {'title': 'Android Development with Kotlin', 'authors': ['Marcin Moskala', 'Igor Wojda'], 'publisher': 'Packt Publishing Ltd', 'publishedDate': '2017-08-30', 'description': 'Learn how to make Android development much faster using a variety of Kotlin features, from basics to advanced, to write better quality code. About This Book Leverage specific features of Kotlin to ease Android application development Write code based on both object oriented and functional programming to build robust applications Filled with various practical examples so you can easily apply your knowledge to real world scenarios Identify the improved way of dealing with common Java patterns Who This Book Is For This book is for developers who have a basic understanding of Java language and have 6-12 months of experience with Android development and developers who feel comfortable with OOP concepts. What You Will Learn Run a Kotlin application and understand the integration with Android Studio Incorporate Kotlin into new/existing Android Java based project Learn about Kotlin type system to deal with null safety and immutability Define various types of classes and deal with properties Define collections and transform them in functional way Define extensions, new behaviours to existing libraries and Android framework classes Use generic type variance modifiers to define subtyping relationship between generic types Build a sample application In Detail Nowadays, improved application development does not just mean building better performing applications. It has become crucial to find improved ways of writing code. Kotlin is a language that helps developers build amazing Android applications easily and effectively. This book discusses Kotlin features in context of Android development. It demonstrates how common examples that are typical for Android development, can be simplified using Kotlin. It also shows all the benefits, improvements and new possibilities provided by this language. The book is divided in three modules that show the power of Kotlin and teach you how to use it properly. Each module present features in different levels of advancement. The first module covers Kotlin basics. This module will lay a firm foundation for the rest of the chapters so you are able to read and understand most of the Kotlin code. The next module dives deeper into the building blocks of Kotlin, such as functions, classes, and function types. You will learn how Kotlin brings many improvements to the table by improving common Java concepts and decreasing code verbosity. The last module presents features that are not present in Java. You will learn how certain tasks can be achieved in simpler ways thanks to Kotlin. Through the book, you will learn how to use Kotlin for Android development. You will get to know and understand most important Kotlin features, and how they can be used. You will be ready to start your own adventure with Android development with Kotlin.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781787128989'}, {'type': 'ISBN_10', 'identifier': '1787128989'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 440, 'printType': 'BOOK', 'categories': ['Computers'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.2.3.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=PJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=PJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=PJZGDwAAQBAJ&pg=PA32&dq=title:kotlin&hl=&cd=1&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=PJZGDwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=PJZGDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 30.73, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 21.51, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=PJZGDwAAQBAJ&rdid=book-PJZGDwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 30730000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 21510000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=PJZGDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'As we saw in previous examples, unlike Java, the <b>Kotlin</b> type is defined after the variable <b>name</b>: var <b>title</b>: String At first glance, this may look strange to Java developers, but this construct is a building block of a very important&nbsp;...'}}, {'kind': 'books#volume', 'id': 'fO1mDwAAQBAJ', 'etag': 'ufzzRy1yvZU', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/fO1mDwAAQBAJ', 'volumeInfo': {'title': 'Kotlin Standard Library Cookbook', 'subtitle': 'Master the powerful Kotlin standard library through practical code examples', 'authors': ['Samuel Urbanowicz'], 'publisher': 'Packt Publishing Ltd', 'publishedDate': '2018-07-30', 'description': "Build optimized applications in Kotlin by learning how to make use of the standard library features the smart way Key Features Get the most out of the Kotlin library to develop high-quality portable applications Explore the powerful support for data processing and I/O operations Discover ways to enhance your Android application development Book Description Given the verbosity of Java, developers have turned to Kotlin for effective software development. The Kotlin standard library provides vital tools that make day-to-day Kotlin programming easier. This library features the core attributes of the language, such as algorithmic problems, design patterns, data processing, and working with files and data streams. The recipes in this book offer coding solutions that can be readily executed. The book covers various topics related to data processing, I/O operations, and collections transformation. We'll walk through effective design patterns in Kotlin and you'll understand how coroutines add new features to JavaScript. As you make your way through the chapters, you'll learn how to implement clean, reusable functions and scalable interfaces containing default implementations. In the concluding chapters, we'll provide recipes on functional programming concepts, such as lambdas, monads, functors, and Kotlin scoping functions. By the end of the book, you'll be able to address a range of problems that Kotlin developers face by implementing easy-to-follow solutions. What you will learn Work with ranges, progressions, and sequences in use cases Add new functionalities to current classes with Kotlin extensions Understand elements such as lambdas, closures, and monads Build a REST API consumer with Retrofit and a coroutine adapter Discover useful tips and solutions for making your Android projects Explore the benefits of standard library features Who this book is for This book is for software developers who are familiar with Kotlin’s basics and want to discover more advanced features and concepts, especially those provided by the Kotlin standard library. It’s also ideal for experienced software developers who are familiar with the functional programming paradigm and other programming languages who want to switch to Kotlin. It will also help Java developers switch to Kotlin and integrate it into existing Java Virtual Machine (JVM) projects.", 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781788834643'}, {'type': 'ISBN_10', 'identifier': '178883464X'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 242, 'printType': 'BOOK', 'categories': ['Computers'], 'averageRating': 5, 'ratingsCount': 1, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '1.5.6.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=fO1mDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=fO1mDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=fO1mDwAAQBAJ&pg=PA74&dq=title:kotlin&hl=&cd=2&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=fO1mDwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=fO1mDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 27.55, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 19.28, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=fO1mDwAAQBAJ&rdid=book-fO1mDwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 27550000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 19280000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=fO1mDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Master the powerful <b>Kotlin</b> standard library through practical code examples Samuel Urbanowicz. The News class is defined as follows: data class News(val <b>title</b>: String, val url: String) How to do it... Apply the filterNotNull function to&nbsp;...'}}, {'kind': 'books#volume', 'id': 'S9qEDwAAQBAJ', 'etag': 'ubIiaw0HkFY', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/S9qEDwAAQBAJ', 'volumeInfo': {'title': 'Kotlin Compact', 'subtitle': 'Get to know Kotlin within a few subway rides!', 'authors': ['Thorsten Schleinzer'], 'publisher': 'Thorsten Schleinzer', 'publishedDate': '2018-08-15', 'description': "Kotlin Compact is for all Java professionals who want to get into Kotlin development with minimal time and effort. In compact chapters, concentrating on the essentials, you'll get to know Kotlin within a few afternoons or some subway rides. As the title suggests, Kotlin Compact is not explicitly an all-encompassing work on Kotlin. Rather, I focus on the necessary foundations and best features Kotlin has to offer, and which I find to be most valuable when getting started with Kotlin development.", 'readingModes': {'text': True, 'image': True}, 'printType': 'BOOK', 'categories': ['Computers'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.1.1.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=S9qEDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=S9qEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=S9qEDwAAQBAJ&printsec=frontcover&dq=title:kotlin&hl=&cd=3&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=S9qEDwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=S9qEDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 7.99, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 7.99, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=S9qEDwAAQBAJ&rdid=book-S9qEDwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 7990000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 7990000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Kotlin_Compact-sample-epub.acsm?id=S9qEDwAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Kotlin_Compact-sample-pdf.acsm?id=S9qEDwAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=S9qEDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Kotlin Compact is for all Java professionals who want to get into Kotlin development with minimal time and effort. In compact chapters, concentrating on the essentials, you&#39;ll get to know Kotlin within a few afternoons or some subway rides.'}}, {'kind': 'books#volume', 'id': 'Xje2DwAAQBAJ', 'etag': 'ztVjr4WIyQo', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/Xje2DwAAQBAJ', 'volumeInfo': {'title': 'Mastering Kotlin', 'subtitle': 'Learn advanced Kotlin programming techniques to build apps for Android, iOS, and the web', 'authors': ['Nate Ebel'], 'publisher': 'Packt Publishing Ltd', 'publishedDate': '2019-10-11', 'description': "Explore popular language features, Java to Kotlin interoperability, advanced topics, and practical applications by building a variety of sample projects Key FeaturesUnderstand and leverage the syntax, tools, and patterns by writing code in KotlinExplore practical topics such as Java interop, concurrency with coroutines, and functional programmingDiscover how to use Kotlin for build targets like Android, iOS, JavaScript, and backend serviceBook Description Using Kotlin without taking advantage of its power and interoperability is like owning a sports car and never taking it out of the garage. While documentation and introductory resources can help you learn the basics of Kotlin, the fact that it’s a new language means that there are limited learning resources and code bases available in comparison to Java and other established languages. This Kotlin book will show you how to leverage software designs and concepts that have made Java the most dominant enterprise programming language. You’ll understand how Kotlin is a modern approach to object-oriented programming (OOP). This book will take you through the vast array of features that Kotlin provides over other languages. These features include seamless interoperability with Java, efficient syntax, built-in functional programming constructs, and support for creating your own DSL. Finally, you will gain an understanding of implementing practical design patterns and best practices to help you master the Kotlin language. By the end of the book, you'll have obtained an advanced understanding of Kotlin in order to be able to build production-grade applications. What you will learnModel data using interfaces, classes, and data classesGrapple with practical interoperability challenges and solutions with JavaBuild parallel apps using concurrency solutions such as coroutinesExplore functional, reactive, and imperative programming to build flexible appsDiscover how to build your own domain-specific languageEmbrace functional programming using the standard library and ArrowDelve into the use of Kotlin for frontend JavaScript developmentBuild server-side services using Kotlin and KtorWho this book is for If you’re a Kotlin developer looking to further their skills or a professional Java developer looking for better or professional resources in order to make a switch to Kotlin, this book is for you. Familiarity with Kotlin programming will assist with understanding key concepts covered in the book.", 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781838552367'}, {'type': 'ISBN_10', 'identifier': '1838552367'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 434, 'printType': 'BOOK', 'categories': ['Computers'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '0.1.1.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=Xje2DwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=Xje2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=Xje2DwAAQBAJ&pg=PA117&dq=title:kotlin&hl=&cd=4&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=Xje2DwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=Xje2DwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 27.55, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 19.28, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=Xje2DwAAQBAJ&rdid=book-Xje2DwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 27550000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 19280000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=Xje2DwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Learn advanced <b>Kotlin</b> programming techniques to build apps for Android, iOS, and the web Nate Ebel ... toString() { return &quot;Article(<b>title</b>=&quot; + this.<b>title</b> + &quot;, author=&quot; + this.author + &quot;)&quot;; } } This is useful for debugging or output,&nbsp;...'}}, {'kind': 'books#volume', 'id': 'x08oDwAAQBAJ', 'etag': 'adYnoVjaw/0', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/x08oDwAAQBAJ', 'volumeInfo': {'title': 'Programming Kotlin', 'authors': ['Stephen Samuel', 'Stefan Bocutiu'], 'publisher': 'Packt Publishing Ltd', 'publishedDate': '2017-01-18', 'description': "Familiarize yourself with all of Kotlin's features with this in-depth guide About This Book Get a thorough introduction to Kotlin Learn to use Java code alongside Kotlin without any hiccups Get a complete overview of null safety, Generics, and many more interesting features Who This Book Is For The book is for existing Java developers who want to learn more about an alternative JVM language. If you want to see what Kotlin has to offer, this book is ideal for you. What You Will Learn Use new features to write structured and readable object-oriented code Find out how to use lambdas and higher order functions to write clean, reusable, and simple code Write unit tests and integrate Kotlin tests with Java code in a transitioning code base Write real-world production code in Kotlin in the style of microservices Leverage Kotlin's extensions to the Java collections library Use destructuring expressions and find out how to write your own Write code that avoids null pointer errors and see how Java-nullable code can integrate with features in a Kotlin codebase Discover how to write functions in Kotlin, see the new features available, and extend existing libraries Learn to write an algebraic data types and figure out when they should be used In Detail Kotlin has been making waves ever since it was open sourced by JetBrains in 2011; it has been praised by developers across the world and is already being adopted by companies. This book provides a detailed introduction to Kotlin that shows you all its features and will enable you to write Kotlin code to production. We start with the basics: get you familiar with running Kotlin code, setting up, tools, and instructions that you can use to write basic programs. Next, we cover object oriented code: functions, lambdas, and properties – all while using Kotlin's new features. Then, we move on to null safety aspects and type parameterization. We show you how to destructure expressions and even write your own. We also take you through important topics like testing, concurrency, microservices, and a whole lot more. By the end of this book you will be able to compose different services and build your own applications. Style and approach An easy to follow guide that covers the full set of features in Kotlin programming.", 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781787122659'}, {'type': 'ISBN_10', 'identifier': '1787122654'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 420, 'printType': 'BOOK', 'categories': ['Computers'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.3.3.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=x08oDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=x08oDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=x08oDwAAQBAJ&pg=PA265&dq=title:kotlin&hl=&cd=5&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=x08oDwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=x08oDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 30.73, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 21.51, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=x08oDwAAQBAJ&rdid=book-x08oDwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 30730000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 21510000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=x08oDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Let&#39;s consider the <b>title</b> field. You are not expected to know the bytecode at this level, but you might work out what is happening. The key lies in these two lines: 18: iconst_1 and 20: ifeq 28. Here&#39;s the code snippet for this: 15:&nbsp;...'}}, {'kind': 'books#volume', 'id': 'la6aDwAAQBAJ', 'etag': 'WNSJuzi6jOA', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/la6aDwAAQBAJ', 'volumeInfo': {'title': 'Learn Kotlin Programming', 'subtitle': 'A comprehensive guide to OOP, functions, concurrency, and coroutines in Kotlin 1.3, 2nd Edition', 'authors': ['Stephen Samuel', 'Stefan Bocutiu'], 'publisher': 'Packt Publishing Ltd', 'publishedDate': '2019-05-29', 'description': "Delve into the world of Kotlin and learn to build powerful Android and web applications Key FeaturesLearn the fundamentals of Kotlin to write high-quality codeTest and debug your applications with the different unit testing frameworks in KotlinExplore Kotlin's interesting features such as null safety, reflection, and annotationsBook Description Kotlin is a general-purpose programming language used for developing cross-platform applications. Complete with a comprehensive introduction and projects covering the full set of Kotlin programming features, this book will take you through the fundamentals of Kotlin and get you up to speed in no time. Learn Kotlin Programming covers the installation, tools, and how to write basic programs in Kotlin. You'll learn how to implement object-oriented programming in Kotlin and easily reuse your program or parts of it. The book explains DSL construction, serialization, null safety aspects, and type parameterization to help you build robust apps. You'll learn how to destructure expressions and write your own. You'll then get to grips with building scalable apps by exploring advanced topics such as testing, concurrency, microservices, coroutines, and Kotlin DSL builders. Furthermore, you'll be introduced to the kotlinx.serialization framework, which is used to persist objects in JSON, Protobuf, and other formats. By the end of this book, you'll be well versed with all the new features in Kotlin and will be able to build robust applications skillfully. What you will learnExplore the latest Kotlin features in order to write structured and readable object-oriented codeGet to grips with using lambdas and higher-order functionsWrite unit tests and integrate Kotlin with Java codeCreate real-world apps in Kotlin in the microservices styleUse Kotlin extensions with the Java collections libraryUncover destructuring expressions and find out how to write your ownUnderstand how Java-nullable code can be integrated with Kotlin featuresWho this book is for If you’re a beginner or intermediate programmer who wants to learn Kotlin to build applications, this book is for you. You’ll also find this book useful if you’re a Java developer interested in switching to Kotlin.", 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781789808742'}, {'type': 'ISBN_10', 'identifier': '178980874X'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 514, 'printType': 'BOOK', 'categories': ['Computers'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '0.1.1.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=la6aDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=la6aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=la6aDwAAQBAJ&pg=PA278&dq=title:kotlin&hl=&cd=6&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=la6aDwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=la6aDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 24.37, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 17.06, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=la6aDwAAQBAJ&rdid=book-la6aDwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 24370000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 17060000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=la6aDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': '0: aload_1 1: ldc #17 // String &lt;set-?&gt; 3: invokestatic #23 // Method <b>kotlin</b>/jvm/internal/Intrinsics.checkParameterIsNotNull:(Ljava/lang/Object;L java/lang/String;)V 6: aload_0 7: aload_1 8: putfield #11 // Field <b>title</b>:Ljava/lang/String&nbsp;...'}}, {'kind': 'books#volume', 'id': 'aMxPDwAAQBAJ', 'etag': 'eOc4Yqv1J7E', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/aMxPDwAAQBAJ', 'volumeInfo': {'title': 'Kotlin Blueprints', 'subtitle': 'A practical guide to building industry-grade web, mobile, and desktop applications in Kotlin using frameworks such as Spring Boot and Node.js', 'authors': ['Ashish Belagali', 'Hardik Trivedi', 'Akshay Chordiya'], 'publisher': 'Packt Publishing Ltd', 'publishedDate': '2017-12-08', 'description': "Get to know the building blocks of Kotlin and best practices when using quality world-class applications About This Book Learn to build exciting and scalable Android and web applications (both the server-side and client-side parts) with your Kotlin skills Dive into the great ecosystem of Kotlin frameworks and libraries through projects that you'll build using this book This project-based guide contains clear instructions to help you extend your applications across a wide domain Who This Book Is For This practical guide is for programmers who are already familiar with Kotlin. If you are familiar with Kotlin and want to put your knowledge to work, then this is the book for you. Kotlin programming knowledge is a must. What You Will Learn See how Kotlin's power and versatility make it a great choice to create applications across various platforms, and how it delivers business and technology benefits Write a robust web applications using Kotlin with Spring Boot Write Android applications with ease using Kotlin Write rich desktop applications in Kotlin Learn how Kotlin can generate Javascript and how this can be used on client side and server side development Understand how native applications can be written with Kotlin/Native Learn the practical aspects of programming in each of the applications In Detail Kotlin is a powerful language that has applications in a wide variety of fields. It is a concise, safe, interoperable, and tool-friendly language. The Android team has also announced first-class support for Kotlin, which is an added boost to the language. Kotlin's growth is fueled through carefully designed business and technology benefits. The collection of projects demonstrates the versatility of the language and enables you to build standalone applications on your own. You'll build comprehensive applications using the various features of Kotlin. Scale, performance, and high availability lie at the heart of the projects, and the lessons learned throughout this book. You'll learn how to build a social media aggregator app that will help you efficiently track various feeds, develop a geospatial webservice with Kotlin and Spring Boot, build responsive web applications with Kotlin, build a REST API for a news feed reader, and build a server-side chat application with Kotlin. It also covers the various libraries and frameworks used in the projects. Through the course of building applications, you'll not only get to grips with the various features of Kotlin, but you'll also discover how to design and prototype professional-grade applications. Style and approach Each chapter is independent and focuses on a unique technology, where Kotlin is used to build an example application. Together the chapters cover a full spectrum.", 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781788470421'}, {'type': 'ISBN_10', 'identifier': '1788470427'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 227, 'printType': 'BOOK', 'categories': ['Computers'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': True, 'contentVersion': '1.1.2.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=aMxPDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=aMxPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=aMxPDwAAQBAJ&pg=PA112&dq=title:kotlin&hl=&cd=7&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=aMxPDwAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=aMxPDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 30.73, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 21.51, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=aMxPDwAAQBAJ&rdid=book-aMxPDwAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 30730000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 21510000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=aMxPDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'A practical guide to building industry-grade web, mobile, and desktop applications in Kotlin using frameworks such as ... DOCTYPE html&gt; &lt;html lang=&quot;en&quot;&gt; &lt;head&gt; &lt;meta charset=&quot;UTF-8&quot;&gt; &lt;<b>title</b>&gt;<b>Kotlin</b> BluePrints JS Demo&lt;/title&gt; &lt;/head&gt;&nbsp;...'}}, {'kind': 'books#volume', 'id': 'PCdHEAAAQBAJ', 'etag': 'Fdd3sBmRpKo', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/PCdHEAAAQBAJ', 'volumeInfo': {'title': "Beginner's Guide to Kotlin Programming", 'authors': ['John Hunt'], 'publisher': 'Springer Nature', 'publishedDate': '2021-10-08', 'description': 'This textbook assumes very little knowledge of programming so whether you have dabbled with a little JavaScript, played with a bit of Python, written Java or have virtually no programming experience at all you will find that it is for you. The first part of the book introduces Kotlin program structures as well as conditional flow of control features such as if and when expressions as well as iteration loops such as for, while and do-while. Subsequent chapters explain how functions are implemented in Kotlin and introduce concepts from functional programming such as higher order functions and curried functions. The second part focusses on object oriented programming techniques, these include classes, inheritance, abstraction and interfaces. The third part presents container data types such as Arrays, and collections including Lists, Sets and Maps and the fourth part considers concurrency and parallelism using Kotlin coroutines. The book concludes with an introduction to Android mobile application development using Kotlin. Clear steps are provided explaining how to set up your environment and get started writing your own Kotlin programs. An important aspect of the book is teaching by example and there are many examples presented throughout the chapters. These examples are supported by a public GitHub repository that provides complete working code as well as sample solutions to the chapter exercises. This helps illustrate how to write well structured, clear, idiomatic Kotlin to build real applications.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9783030808938'}, {'type': 'ISBN_10', 'identifier': '3030808939'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 516, 'printType': 'BOOK', 'categories': ['Computers'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': 'preview-1.0.0', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=PCdHEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=PCdHEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=PCdHEAAAQBAJ&pg=PA176&dq=title:kotlin&hl=&cd=8&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=PCdHEAAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=PCdHEAAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 58.29, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 40.8, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=PCdHEAAAQBAJ&rdid=book-PCdHEAAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 58290000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 40800000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Beginner_s_Guide_to_Kotlin_Programming-sample-epub.acsm?id=PCdHEAAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Beginner_s_Guide_to_Kotlin_Programming-sample-pdf.acsm?id=PCdHEAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=PCdHEAAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'For example, the following code defines an object MyUtils that has a lateinit var <b>title</b>. ... try to obtain the length of the uninitialised <b>title</b> property and a runtime error will be shown to the user: Exception in thread &quot;main&quot; <b>kotlin</b>.'}}, {'kind': 'books#volume', 'id': 'R1iZEAAAQBAJ', 'etag': 'xA8ICL29UtA', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/R1iZEAAAQBAJ', 'volumeInfo': {'title': 'Kotlin', 'subtitle': 'The Ultimate Guide', 'authors': ['Sufyan bin Uzayr'], 'publisher': 'CRC Press', 'publishedDate': '2022-12-20', 'description': 'Kotlin is a free and open-source general purpose programming language that is mostly used to create Android apps. Kotlin was developed by JetBrains initially and later picked up by Google as the language of choice for its Android platform. Over the past few years, Kotlin has become one of the most popular alternatives to Java language and is used by more than 80 percent of Android app developers. Kotlin is a statically typed, advanced programming language that compiles Kotlin code into Java byte-code and runs on a Java Virtual Machine (JVM). It can also be compiled to native executables and JavaScript source code. It is an object-oriented programming language that includes data types, operators, I/O comments, control statements, functions, classes, object expressions, and constructors, among other features. It is not a standalone programming language; rather, it is an innovative manner of coding that runs on Java. Kotlin is a versatile language with some cool features like compatibility, low runtime, and efficient coding characteristics. The features that help distinguish Kotlin from other languages are its reliability, tool support, and interoperability. It is a simplified version of Java that is much easier to deal with. Why Should You Learn Kotlin? The popularity of Kotlin is growing, and will continue to do so in the coming years. Kotlin has always been -- and will continue to be -- a cutting-edge programming language that meets the needs of real professionals. Many emerging fields, including mobile, online gaming, server-side, cloud development, data science, and education, are progressively using Kotlin. All of this indicates that there is already a high demand for Kotlin developers, and that demand will continue to grow in the future. Furthermore, if you are looking to build native Android apps, Kotlin is the language that you should be using.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781000801538'}, {'type': 'ISBN_10', 'identifier': '1000801535'}], 'readingModes': {'text': True, 'image': True}, 'pageCount': 372, 'printType': 'BOOK', 'categories': ['Computers'], 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '1.1.1.0.preview.3', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=R1iZEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=R1iZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=R1iZEAAAQBAJ&pg=PT3&dq=title:kotlin&hl=&cd=9&source=gbs_api', 'infoLink': 'https://play.google.com/store/books/details?id=R1iZEAAAQBAJ&source=gbs_api', 'canonicalVolumeLink': 'https://play.google.com/store/books/details?id=R1iZEAAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'FOR_SALE', 'isEbook': True, 'listPrice': {'amount': 49.38, 'currencyCode': 'EUR'}, 'retailPrice': {'amount': 37.02, 'currencyCode': 'EUR'}, 'buyLink': 'https://play.google.com/store/books/details?id=R1iZEAAAQBAJ&rdid=book-R1iZEAAAQBAJ&rdot=1&source=gbs_api', 'offers': [{'finskyOfferType': 1, 'listPrice': {'amountInMicros': 49380000, 'currencyCode': 'EUR'}, 'retailPrice': {'amountInMicros': 37020000, 'currencyCode': 'EUR'}}]}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Kotlin-sample-epub.acsm?id=R1iZEAAAQBAJ&format=epub&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'pdf': {'isAvailable': True, 'acsTokenLink': 'http://books.google.gr/books/download/Kotlin-sample-pdf.acsm?id=R1iZEAAAQBAJ&format=pdf&output=acs4_fulfillment_token&dl_type=sample&source=gbs_api'}, 'webReaderLink': 'http://play.google.com/books/reader?id=R1iZEAAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': '<b>Title</b>: <b>Kotlin</b> : the ultimate guide / Sufyan bin Uzayr. Description: First edition. | Boca Raton : CRC Press, 2023. | Includes bibliographical references and index. Identifiers: LCCN 2022025675 (print) | LCCN 2022025676 (ebook) | ISBN&nbsp;...'}}, {'kind': 'books#volume', 'id': 'NcuHDwAAQBAJ', 'etag': 'Vt2pVAM68IM', 'selfLink': 'https://www.googleapis.com/books/v1/volumes/NcuHDwAAQBAJ', 'volumeInfo': {'title': 'Head First Kotlin', 'subtitle': 'A Brain-Friendly Guide', 'authors': ['Dawn Griffiths', 'David Griffiths'], 'publisher': "O'Reilly Media", 'publishedDate': '2019-02-13', 'description': 'What will you learn from this book? Head First Kotlin is a complete introduction to coding in Kotlin. This hands-on book helps you learn the Kotlin language with a unique method that goes beyond syntax and how-to manuals and teaches you how to think like a great Kotlin developer. You’ll learn everything from language fundamentals to collections, generics, lambdas, and higher-order functions. Along the way, you’ll get to play with both object-oriented and functional programming. If you want to really understand Kotlin, this is the book for you. Why does this book look so different? Based on the latest research in cognitive science and learning theory, Head First Kotlin uses a visually rich format to engage your mind rather than a text-heavy approach that puts you to sleep. Why waste your time struggling with new concepts? This multisensory learning experience is designed for the way your brain really works.', 'industryIdentifiers': [{'type': 'ISBN_13', 'identifier': '9781491996669'}, {'type': 'ISBN_10', 'identifier': '1491996668'}], 'readingModes': {'text': False, 'image': True}, 'pageCount': 483, 'printType': 'BOOK', 'categories': ['Computers'], 'averageRating': 3, 'ratingsCount': 1, 'maturityRating': 'NOT_MATURE', 'allowAnonLogging': False, 'contentVersion': '0.2.2.0.preview.1', 'panelizationSummary': {'containsEpubBubbles': False, 'containsImageBubbles': False}, 'imageLinks': {'smallThumbnail': 'http://books.google.com/books/content?id=NcuHDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api', 'thumbnail': 'http://books.google.com/books/content?id=NcuHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api'}, 'language': 'en', 'previewLink': 'http://books.google.gr/books?id=NcuHDwAAQBAJ&pg=PA201&dq=title:kotlin&hl=&cd=10&source=gbs_api', 'infoLink': 'http://books.google.gr/books?id=NcuHDwAAQBAJ&dq=title:kotlin&hl=&source=gbs_api', 'canonicalVolumeLink': 'https://books.google.com/books/about/Head_First_Kotlin.html?hl=&id=NcuHDwAAQBAJ'}, 'saleInfo': {'country': 'GR', 'saleability': 'NOT_FOR_SALE', 'isEbook': False}, 'accessInfo': {'country': 'GR', 'viewability': 'PARTIAL', 'embeddable': True, 'publicDomain': False, 'textToSpeechPermission': 'ALLOWED', 'epub': {'isAvailable': False}, 'pdf': {'isAvailable': True}, 'webReaderLink': 'http://play.google.com/books/reader?id=NcuHDwAAQBAJ&hl=&source=gbs_api', 'accessViewStatus': 'SAMPLE', 'quoteSharingAllowed': False}, 'searchInfo': {'textSnippet': 'Create the Recipes project Create a new <b>Kotlin</b> project that targets the JVM, and <b>name</b> the project “Recipes”. Then create a new <b>Kotlin</b> file named Recipes.kt by highlighting the src folder, clicking on the File menu and choosing New&nbsp;...'}}]}